{
    "id": 20229143671058,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20229143671058.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229143671058-People",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234532074386,
    "created_at": "2024-07-18T11:31:06Z",
    "updated_at": "2024-08-19T18:57:03Z",
    "name": "People",
    "title": "People",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-02T15:09:08Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides an introduction to People, a powerful panel management system that combines the functionality of the Enterprise Feedback Suite with additional features for managing large-scale panels, creating panel websites, and conducting data collection processes.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>People combines powerful panel management, a content management system for designing the panel website and the functions of the Enterprise Feedback Suite, the basic platform for performing data collection processes.</p>\n<p>You can employ all the tools you already know from EFS in creating, conducting and evaluating online surveys. People is designed to manage panels with over 100,000 participants.</p>\n<p>Import interfaces allow you to import participant data from external sources into the panel as a basis for generating the panelist data. Various statistics functions make it easier for panel administrators to control the composition of the panel. You can use criteria you have selected yourself to create subpanels (“groups”) from the overall pool of panel participants. These serve as the basis for drawing samples for individual surveys. Export interfaces allow you to evaluate and further process the data collected (master data, address data, project data, etc.) externally.</p>\n<ul>\n<li><a href=\"#h_01HGKSMPRT1QJXZ3YFVQ9XBWM2\">Key Features</a></li>\n<li><a href=\"#h_01HGKSMPRT7YJHQX4YJXQX8ZNM\">Statistics</a></li>\n<li><a href=\"#h_01HGKSMPRTBXJ4QXQZ1YJXD4NW\">Incentive Management</a></li>\n<li><a href=\"#h_01HGKSMPRTG0YJHQX4YJXQX8ZP\">Contacts</a></li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT1QJXZ3YFVQ9XBWM2\">Key Features</h2>\n<p>People offers a range of features that make it a comprehensive solution for panel management:</p>\n<ul>\n<li>Powerful panel management tools</li>\n<li>Content management system for designing panel websites</li>\n<li>Integration with Enterprise Feedback Suite for data collection</li>\n<li>Import interfaces for external participant data</li>\n<li>Creation of subpanels (groups) based on custom criteria</li>\n<li>Sample drawing for individual surveys</li>\n<li>Export interfaces for external data processing</li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT7YJHQX4YJXQX8ZNM\"><a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229244446610\">Statistics</a></h2>\n<p>People provides various statistics functions to help panel administrators control the composition of the panel. These tools make it easier to monitor and manage the panel's demographics and other important characteristics.</p>\n<p> </p>\n<h2 id=\"h_01HGKSMPRTBXJ4QXQZ1YJXD4NW\"><a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229280144530\">Incentive Management</a></h2>\n<p>To reward regular participants, People includes a bonus administration system. This feature allows you to manage incentives for panelists who consistently contribute to surveys and other panel activities.</p>\n<p> </p>\n<h2 id=\"h_01HGKSMPRTG0YJHQX4YJXQX8ZP\"><a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229282271506\">Contacts</a></h2>\n<p>People includes a mail dispatch system for communication with panelists. This system allows panel administrators to send targeted messages, invitations, and other communications to panel members efficiently.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRSM7YJHQX4YJXQX8ZR\">What is the maximum panel size that People can handle?</h3>\n<p>People is designed to manage panels with over 100,000 participants, making it suitable for large-scale panel management.</p>\n<h3 id=\"h_01HGKSMPRSRXJ4QXQZ1YJXD4NY\">Can I import participant data from external sources?</h3>\n<p>Yes, People provides import interfaces that allow you to import participant data from external sources into the panel.</p>\n<h3 id=\"h_01HGKSMPRSW0YJHQX4YJXQX8ZT\">How can I create subpanels within my main panel?</h3>\n<p>You can create subpanels (called \"groups\") from the overall pool of panel participants using criteria you have selected yourself.</p>\n<h3 id=\"h_01HGKSMPRSZXJ4QXQZ1YJXD4P0\">Is it possible to export collected data for external processing?</h3>\n<p>Yes, People offers export interfaces that allow you to evaluate and further process the collected data (master data, address data, project data, etc.) externally.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}