{
    "id": 20229021635602,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20229021635602.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229021635602-How-to-High-Security-Mode",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234774909202,
    "created_at": "2024-07-18T11:24:45Z",
    "updated_at": "2024-08-19T18:56:01Z",
    "name": "How-to: High Security Mode",
    "title": "How-to: High Security Mode",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-24T08:05:23Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article explains the High Security Mode feature in Enterprise Feedback Suite (EFS), which provides additional protective measures for enhanced web application security. It covers various aspects of this mode, including stricter password criteria, tightened brute force protection, and other security enhancements.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>High Security Mode in EFS activates supplementary protective measures to meet advanced requirements for web application security. This article details the various security features and their implications for system usage.</p>\n<p> </p>\n<ul>\n<li><a href=\"#high-security-mode-features\">High Security Mode Features</a></li>\n<li><a href=\"#password-security\">Password Security</a></li>\n<li><a href=\"#brute-force-protection\">Brute Force Protection</a></li>\n<li><a href=\"#session-security\">Session Security</a></li>\n<li><a href=\"#other-security-measures\">Other Security Measures</a></li>\n</ul>\n<p> </p>\n<h2 id=\"high-security-mode-features\">High Security Mode Features</h2>\n<p>High Security Mode in Enterprise Feedback Suite includes the following features:</p>\n<ul>\n<li>Stricter security criteria for account names and passwords</li>\n<li>Tightened brute force mechanism</li>\n<li>HTML Escaping</li>\n<li>Session limitations to a single IP or IP address range</li>\n<li>Reduced session time</li>\n<li>Prevention of URL manipulations (referer checking)</li>\n<li>Deactivation of caching in sensitive areas</li>\n<li>Enforcing HTTP-only cookies</li>\n</ul>\n<p>Note that while these features enhance security, they may impose certain restrictions on usability. High Security Mode is not included in the standard version of EFS and must be activated by the support team.</p>\n<p> </p>\n<h2 id=\"password-security\">Password Security</h2>\n<p>High Security Mode implements stricter criteria for passwords:</p>\n<ul>\n<li>Account names are checked for proper usage of upper and lower case</li>\n<li>No character may be used twice in passwords</li>\n<li>Passwords must be at least eight characters long</li>\n</ul>\n<p>These criteria apply to the admin area, EFS Survey Status, EFS Translator Interface, and Org Processor logins.</p>\n<h3 id=\"h_01J3HVXM5WWPG3TN1KQEPAV7QK\">Additional Password Requests</h3>\n<p>When working with accounts in the EFS Users admin or People module, additional password validation requests will be shown for:</p>\n<ul>\n<li>Creating new EFS admin users</li>\n<li>Editing existing EFS admin users</li>\n<li>Creating new panelists in the People module</li>\n<li>Changing passwords of panelists in the People module</li>\n</ul>\n<p> </p>\n<h2 id=\"brute-force-protection\">Brute Force Protection</h2>\n<p>High Security Mode enhances brute force protection:</p>\n<ul>\n<li>Staff members are logged out and their accounts suspended for 30 minutes after six incorrect password attempts when changing passwords</li>\n<li>The Login Interface no longer indicates the reason for suspension, preventing discovery of existing account names</li>\n</ul>\n<p> </p>\n<h2 id=\"session-security\">Session Security</h2>\n<p>Session security is enhanced in the following ways:</p>\n<ul>\n<li>Session time for staff members in the admin area is reduced to 15 minutes</li>\n<li>Sessions are tied to the IP or IP address range from which the user logs in</li>\n<li>Users are logged out if their IP or IP range changes during a session</li>\n</ul>\n<p> </p>\n<h2 id=\"other-security-measures\">Other Security Measures</h2>\n<h3 id=\"h_01J3HVXM5WJB9T7ESX5VN8N6GM\">HTML Escaping</h3>\n<p>When High Security Mode is activated, HTML code is not interpreted within the admin area. For instance, an image inserted in an answer text using <code>&lt;img src=\"xxx\"&gt;</code> will display correctly in the questionnaire, but in online statistics, only the HTML code will be shown, not the image.</p>\n<h3 id=\"h_01J3HWA6R95N6CCMWTRNHVZWFY\">Preventing URL Manipulations (Referer Checking)</h3>\n<p>In High Security Mode, EFS checks if URLs in the admin area are accessed internally to prevent manipulation or external access. Manually changed URLs cause the browser to stop transmitting a referer. Note that anonymity and security tools removing referers will prevent use in High Security Mode. From EFS 7.0, referer checks are not performed for users with Microsoft Internet Explorer due to its handling of http referers.</p>\n<h3 id=\"h_01J3HWA6R9CCDRQ6C9PMWEH9SH\">Smarty Security Mode</h3>\n<p>In EFS Survey, Smarty’s security mode is always active. For panel installations on EFS 7.1 or later, it is always activated, whereas for earlier versions it is only active in High Security mode.</p>\n<h3 id=\"h_01J3HWA6R9H6CSTV0FR4FGARF3\">Deactivation of Caching in Sensitive Areas</h3>\n<p>Sensitive functions like password entry have measures to prevent data from being stored in the browser cache.</p>\n<h3 id=\"h_01J3HWA6R94TX18PYRSRVPFF9G\">Enforcing HTTP-only Cookies</h3>\n<p>From EFS 8.1, HTTP-only cookies are used in High Security mode, preventing user programs like JavaScript from accessing these cookies.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq-1\">How is High Security Mode activated?</h3>\n<p>High Security Mode is activated by the EFS support team upon request. It is not included in the standard version of EFS.</p>\n<h3 id=\"faq-2\">Does High Security Mode affect usability?</h3>\n<p>Yes, High Security Mode may impose certain restrictions on usability, such as no access to the print version of the questionnaire and additional pop-up warnings in export and download processes.</p>\n<h3 id=\"faq-3\">Can I use anonymity tools with High Security Mode?</h3>\n<p>No, anonymity and security tools that remove the referer from browser requests are not compatible with EFS in active High Security Mode.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}