{
    "id": 20230486773138,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230486773138.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230486773138-Which-question-type-is-right-for-your-survey",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:25:29Z",
    "updated_at": "2024-08-19T19:13:11Z",
    "name": "Which question type is right for your survey",
    "title": "Which question type is right for your survey",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T09:19:12Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides guidance on selecting the right question types for surveys, forming effective questions, and best practices for creating well-structured questionnaires. It covers various aspects of survey design to help you gather accurate and meaningful data from respondents.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>This guide focuses on the key elements of survey design, including question types, language use, and common pitfalls to avoid when creating survey questions.</p>\n<p> </p>\n<ul>\n<li><a href=\"#selecting-question-types\">Selecting question types</a></li>\n<li><a href=\"#forming-the-questions\">Forming the Questions</a></li>\n<li><a href=\"#language-use\">Language use in the questionnaire</a></li>\n<li><a href=\"#one-vs-several-answers\">One possible answer vs. several possible answers</a></li>\n<li><a href=\"#non-leading-questions\">Non-leading questions</a></li>\n<li><a href=\"#mutually-exclusive\">Mutually exclusive response options</a></li>\n<li><a href=\"#collective-exhaustive\">Collective exhaustive response options</a></li>\n<li><a href=\"#correlation\">Correlation between questions and response options</a></li>\n<li><a href=\"#dont-assume\">Don't take anything for granted</a></li>\n<li><a href=\"#one-thing-at-a-time\">Ask about one thing at a time</a></li>\n</ul>\n<p> </p>\n<h2 id=\"selecting-question-types\">Selecting question types</h2>\n<p>There are three main types of questions commonly used in surveys:</p>\n<ol>\n<li>\n<p><strong>Closed-ended questions:</strong> Respondents select from pre-defined options. These are quick to answer and easy to analyze but may not cover all possible responses.</p>\n</li>\n<li>\n<p><strong>Open-ended questions:</strong> Respondents provide answers in their own words. These can yield surprising and useful insights but are more labor-intensive to analyze.</p>\n</li>\n<li>\n<p><strong>Combination of closed-ended and open-ended questions:</strong> This approach increases the likelihood of capturing all possible answers and is useful when you're unsure if all response options are covered.</p>\n</li>\n</ol>\n<p> </p>\n<h2 id=\"forming-the-questions\">Forming the Questions</h2>\n<p>Properly formed questions are crucial for gathering valid data and drawing accurate conclusions. The following sections outline important elements to consider when creating survey questions.</p>\n<p> </p>\n<h2 id=\"language-use\">Language use in the questionnaire</h2>\n<p>The language used in a survey is critical. Questions should have the following characteristics:</p>\n<ul>\n<li>\n<p>Relevant to a clearly defined problem</p>\n</li>\n<li>\n<p>Simple and conversational in tone</p>\n</li>\n<li>\n<p>Unambiguous and not open to misinterpretation</p>\n</li>\n<li>\n<p>Not offensive or inflammatory</p>\n</li>\n<li>\n<p>Free of slang, abbreviations, or specialist terminology</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"one-vs-several-answers\">One possible answer vs. several possible answers</h2>\n<p>Be clear about whether a question should have one or multiple possible answers. Avoid confusion by explicitly stating when multiple selections are allowed.</p>\n<p> </p>\n<h2 id=\"non-leading-questions\">Non-leading questions</h2>\n<p>Ensure questions are as neutral as possible and do not lead respondents to specific answers. Avoid including assumptions or biases in the question wording.</p>\n<p> </p>\n<h2 id=\"mutually-exclusive\">Mutually exclusive response options</h2>\n<p>When providing multiple-choice options, ensure that the choices are mutually exclusive. For example, when asking about age ranges, make sure the ranges don't overlap:</p>\n<ul>\n<li>\n<p>Below 20 years</p>\n</li>\n<li>\n<p>20-29 years</p>\n</li>\n<li>\n<p>30-39 years</p>\n</li>\n<li>\n<p>40-49 years</p>\n</li>\n<li>\n<p>50 years or older</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"collective-exhaustive\">Collective exhaustive response options</h2>\n<p>Ensure that response options cover all possible answers a respondent might give. Include options like \"Other\" or \"Don't know\" when appropriate to capture all potential responses.</p>\n<p> </p>\n<h2 id=\"correlation\">Correlation between questions and response options</h2>\n<p>Maintain consistency between the phrasing of the question and the response options. This prevents misunderstandings and ensures the validity of the results.</p>\n<p> </p>\n<h2 id=\"dont-assume\">Don't take anything for granted</h2>\n<p>Allow respondents the option to indicate that they don't know or don't have an opinion. Be aware that words and concepts can mean different things to different individuals or groups.</p>\n<p> </p>\n<h2 id=\"one-thing-at-a-time\">Ask about one thing at a time</h2>\n<p>Avoid asking about multiple issues in a single question. This can lead to confusion and make it difficult to interpret the results accurately.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq-1\">What are the main types of survey questions?</h3>\n<p>The main types of survey questions are closed-ended questions, open-ended questions, and a combination of both. Closed-ended questions offer pre-defined options, open-ended questions allow free-text responses, and a combination approach uses both types to capture comprehensive data.</p>\n<h3 id=\"faq-2\">How can I ensure my survey questions are not biased?</h3>\n<p>To avoid bias in survey questions, use neutral language, avoid leading questions, provide balanced response options, and allow respondents to express uncertainty or lack of opinion when appropriate.</p>\n<h3 id=\"faq-3\">Why is it important to have mutually exclusive response options?</h3>\n<p>Mutually exclusive response options are important because they prevent confusion and ensure that respondents can select only one appropriate answer. This makes data analysis more accurate and reliable.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}