{
    "id": 20230544557970,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230544557970.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230544557970-Don-t-miss-these-9-important-tips-for-creating-a-survey",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:27:28Z",
    "updated_at": "2024-08-19T19:14:29Z",
    "name": "Don’t miss these 9 important tips for creating a survey",
    "title": "Don’t miss these 9 important tips for creating a survey",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T08:42:23Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides nine essential tips for creating effective surveys, focusing on technical considerations and question formulation. It aims to help survey creators design inclusive, well-structured, and unbiased questionnaires.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Creating a successful survey requires careful planning and attention to detail. This guide covers technical aspects to consider before programming your survey and offers valuable advice on formulating questions to ensure accurate and meaningful results.</p>\n<ul>\n<li><a href=\"#technical_considerations\">Technical Considerations</a></li>\n<li><a href=\"#question_formulation_tips\">9 Tips for Question Formulation</a></li>\n</ul>\n<h2 id=\"technical_considerations\">Technical Considerations</h2>\n<p>Before programming your survey, consider the following technical aspects to ensure accessibility and usability for all participants:</p>\n<ul>\n<li>Base technical requirements on the lower level of possibilities in the target group</li>\n<li>Consider data transmission, graphics usage, and programming techniques</li>\n<li>Ensure acceptable loading times</li>\n<li>Optimize readability for different screen sizes and resolutions</li>\n<li>Make sure all options, including scales, question texts, and answer choices, are fully visible</li>\n<li>Verify that options like \"don't know\" are visible to prevent result distortion</li>\n</ul>\n<h2 id=\"question_formulation_tips\">9 Tips for Question Formulation</h2>\n<p>Follow these guidelines to create clear, unbiased, and effective survey questions:</p>\n<ol>\n<li>\n<h3 id=\"tip_1\">Keep questions brief and concise</h3>\n<p>Avoid information overload by focusing on essential information.</p>\n</li>\n<li>\n<h3 id=\"tip_2\">Avoid leading questions</h3>\n<p>Maintain neutrality in your question phrasing to prevent bias.</p>\n</li>\n<li>\n<h3 id=\"tip_3\">Eliminate ambiguities and unnecessary technical terms</h3>\n<p>Use clear language that all respondents can understand.</p>\n</li>\n<li>\n<h3 id=\"tip_4\">Avoid double negations</h3>\n<p>Example of what to avoid: \"What are you trying to avoid in your diet? - Not eating meat.\"</p>\n</li>\n<li>\n<h3 id=\"tip_5\">Ask one question at a time</h3>\n<p>Split complex questions into separate, focused inquiries. For example, instead of asking about long-distance travel and short trips in one question, create two separate questions.</p>\n</li>\n<li>\n<h3 id=\"tip_6\">Ensure consistent interpretation</h3>\n<p>Design questions so that all respondents understand them in the same way.</p>\n</li>\n<li>\n<h3 id=\"tip_7\">Create complete and non-overlapping answer categories</h3>\n<p>For closed questions, provide exhaustive and mutually exclusive response options.</p>\n</li>\n<li>\n<h3 id=\"tip_8\">Provide clear instructions</h3>\n<p>Give respondents explicit guidance on how to answer each question.</p>\n</li>\n<li>\n<h3 id=\"tip_9\">Stay within respondents' knowledge base</h3>\n<p>Avoid asking questions about topics that participants may not be familiar with.</p>\n</li>\n</ol>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_1\">Why is it important to consider technical aspects when creating an online survey?</h3>\n<p>Considering technical aspects ensures that no participants are excluded from taking the survey due to technical limitations. It helps maintain accessibility, usability, and data integrity across various devices and internet connections.</p>\n<h3 id=\"faq_2\">How can I avoid leading questions in my survey?</h3>\n<p>To avoid leading questions, maintain a neutral tone and phrasing. Present all options equally and avoid using language that might influence the respondent's answer. Have others review your questions to check for potential bias.</p>\n<h3 id=\"faq_3\">What should I do if I need to ask about multiple related topics?</h3>\n<p>If you need to ask about multiple related topics, break them down into separate questions. This approach ensures clarity and prevents confusion, allowing respondents to provide more accurate and focused answers for each topic.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}