{
    "id": 20230575554194,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230575554194.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230575554194-Why-the-length-and-the-order-of-the-questions-in-your-survey-are-important",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:27:06Z",
    "updated_at": "2024-08-19T19:14:15Z",
    "name": "Why the length and the order of the questions in your survey are important",
    "title": "Why the length and the order of the questions in your survey are important",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T08:28:50Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article discusses the importance of survey length and question order in creating effective questionnaires. It provides insights into how these factors can impact response rates and the quality of data collected.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Understanding the impact of survey length and question order is crucial for designing surveys that yield valuable insights while maintaining respondent engagement.</p>\n<ul>\n<li><a href=\"#length_of_questionnaire\">Length of questionnaire</a></li>\n<li><a href=\"#order_of_questions\">The order of the questions is not random</a></li>\n</ul>\n<p> </p>\n<h2 id=\"length_of_questionnaire\">Length of questionnaire</h2>\n<p>The appropriate length of a survey depends on its purpose and target group. Key considerations include:</p>\n<ul>\n<li>Relationship between the respondent and the organization</li>\n<li>Purpose of the survey</li>\n<li>Internal vs. external surveys</li>\n<li>Focusing on essential questions</li>\n<li>Frequency of surveys</li>\n<li>Using background information to reduce questionnaire length</li>\n</ul>\n<p>It is recommended to conduct short, frequent surveys linked to concrete events (process-based) rather than comprehensive and less frequent surveys. This approach helps maintain respondent engagement and improves the quality of responses.</p>\n<p> </p>\n<h2 id=\"order_of_questions\">The order of the questions is not random</h2>\n<p>The sequence of questions in a survey is crucial for maintaining respondent engagement and obtaining quality responses. Here's a recommended structure:</p>\n<ol>\n<li>Start with simple questions about the respondent (e.g., demographics)</li>\n<li>Progress to questions related to the survey's key purpose</li>\n<li>Place sensitive or potentially controversial questions towards the end of the main section</li>\n<li>Conclude with summary questions or open-ended feedback opportunities</li>\n</ol>\n<p>Ensure that questions follow a logical sequence and avoid redundancy. This structure provides a good flow and rhythm to the questionnaire, increasing the likelihood of obtaining answers to sensitive or demanding questions.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_1\">Why is survey length important?</h3>\n<p>Survey length is important because it affects response rates and the quality of data collected. Shorter surveys are more likely to be completed, while longer surveys may lead to respondent fatigue and incomplete or inaccurate responses.</p>\n<h3 id=\"faq_2\">How can I reduce the length of my survey?</h3>\n<p>You can reduce survey length by focusing on essential questions, using pre-existing background information, and conducting more frequent, shorter surveys instead of long, comprehensive ones.</p>\n<h3 id=\"faq_3\">Why does question order matter in a survey?</h3>\n<p>Question order matters because it affects the respondent's experience and willingness to complete the survey. A well-structured survey with a logical flow of questions can improve response rates and data quality.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}