{
    "id": 20230463089810,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230463089810.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230463089810-Does-Tivian-save-survey-respondents-IP-addresses-together-with-survey-results",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20271541513746,
    "created_at": "2024-07-18T12:23:07Z",
    "updated_at": "2024-08-19T19:10:07Z",
    "name": "Does Tivian save survey respondents’ IP addresses together with survey results?",
    "title": "Does Tivian save survey respondents’ IP addresses together with survey results?",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-20T15:52:51Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article addresses the question of whether Tivian saves survey respondents' IP addresses together with survey results. It provides information on Tivian's standard configuration, special rights, and data logging practices.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>This article focuses on Tivian's handling of IP addresses in relation to survey results, explaining the standard practices and exceptions.</p>\n<ul>\n<li><a href=\"#standard_configuration\">Standard Configuration</a></li>\n<li><a href=\"#special_rights\">Special Rights</a></li>\n<li><a href=\"#data_logging\">Data Logging</a></li>\n<li><a href=\"#data_linking\">Data Linking</a></li>\n</ul>\n<p> </p>\n<h2 id=\"standard_configuration\">Standard Configuration</h2>\n<p>In the standard configuration of EFS (Enterprise Feedback Suite), Tivian does not save IP addresses together with survey results. This ensures a basic level of privacy for survey respondents.</p>\n<p> </p>\n<h2 id=\"special_rights\">Special Rights</h2>\n<p>There is an exception to the standard configuration. If special rights have been activated, it becomes possible to manually enable the saving of IP addresses on a project-by-project basis. This feature is not enabled by default and requires specific authorization.</p>\n<p> </p>\n<h2 id=\"data_logging\">Data Logging</h2>\n<p>IP addresses are logged in a separate database for troubleshooting and IT-Security purposes. This database log is only accessible to Tivian administrators and is not directly linked to survey results.</p>\n<p> </p>\n<h2 id=\"data_linking\">Data Linking</h2>\n<p>While it is theoretically possible to link an IP address from the database log to a specific survey answer, this process requires considerable effort and is only available for a limited period of time. Due to the significant resources required, this is offered as an additional chargeable service and is exclusively used for prosecuting criminal offenses.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_1\">Does Tivian save IP addresses with survey results by default?</h3>\n<p>No, in the standard configuration, Tivian does not save IP addresses together with survey results.</p>\n<h3 id=\"faq_2\">Can IP addresses be saved with survey results under any circumstances?</h3>\n<p>Yes, but only if special rights have been activated, allowing manual enablement on a project-by-project basis.</p>\n<h3 id=\"faq_3\">Who has access to the database log containing IP addresses?</h3>\n<p>Only Tivian administrators have access to the database log used for troubleshooting and IT-Security purposes.</p>\n<h3 id=\"faq_4\">Is it possible to link IP addresses to specific survey answers?</h3>\n<p>While theoretically possible, this requires considerable effort, is time-limited, and is only offered as a chargeable service for criminal prosecution purposes.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}