{
    "id": 20230489980946,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230489980946.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230489980946-Tips-and-tricks-on-exporting-data-in-EFS",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:25:04Z",
    "updated_at": "2024-08-19T19:10:44Z",
    "name": "Tips and tricks on exporting data in EFS",
    "title": "Tips and tricks on exporting data in EFS",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T10:08:18Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides tips and tricks for exporting data in EFS (Enterprise Financial System). It covers important aspects such as export duration, file handling, and character limitations in exports.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>This guide focuses on best practices for exporting data from EFS, with an emphasis on using CSV format for high-volume exports and efficient file management.</p>\n<ul>\n<li><a href=\"#export_duration\">Export Duration</a></li>\n<li><a href=\"#file_handling\">File Handling</a></li>\n<li><a href=\"#character_limitations\">Character Limitations in Exports</a></li>\n</ul>\n<p> </p>\n<h2 id=\"export_duration\">Export Duration</h2>\n<p>When exporting data from EFS, it's important to note that the exported data is not created in advance. Instead, it is generated based on your settings at the moment you click the Export button. The duration of the export process can vary significantly depending on factors such as:</p>\n<ul>\n<li>The desired content</li>\n<li>Selected format (CSV is preferred for high-volume exports)</li>\n<li>Number of records</li>\n</ul>\n<p>Due to these factors, some exports may take a considerable amount of time to complete.</p>\n<p> </p>\n<h2 id=\"file_handling\">File Handling</h2>\n<p>After initiating an export, you'll be presented with a dialog window offering options to save the file locally or open it directly. It is strongly recommended to always save the file to your local PC first.</p>\n<h3 id=\"h_01J3CY46AZ57R1R8RFTVVGTSWN\">Benefits of Saving Locally:</h3>\n<ul>\n<li>Reduces server load by creating the file only once</li>\n<li>Avoids potential issues with browser file type recognition</li>\n<li>Ensures you have a local copy of the exported data</li>\n</ul>\n<p> </p>\n<h2 id=\"character_limitations\">Character Limitations in Exports</h2>\n<p>To ensure effective exporting across various formats, some minor modifications are made to the result data:</p>\n<ul>\n<li>Backslashes are removed</li>\n<li>Special characters \\n (Newline), \\t (Horizontal tab), \\r (Carriage return), and \" (Double quote) are removed</li>\n<li>NULL values are replaced with an empty string</li>\n</ul>\n<p>These modifications apply to all result data exports, including panel exports.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_1\">Why is CSV export preferred over Excel for high-volume data?</h3>\n<p>CSV export is preferred for high-volume data exports because it offers better performance and faster processing times compared to Excel format, especially when dealing with large datasets.</p>\n<h3 id=\"faq_2\">Can I open the exported file directly in my browser?</h3>\n<p>While it's possible to open the file directly, it's not recommended. Saving the file locally first ensures proper file type recognition and avoids potential errors that may occur due to browser limitations in handling certain file types.</p>\n<h3 id=\"faq_3\">How do character limitations affect my exported data?</h3>\n<p>Character limitations ensure compatibility across different export formats. While some special characters are removed or modified, these changes are minimal and shouldn't significantly impact the integrity of your exported data.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}