{
    "id": 20230529454098,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230529454098.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230529454098-All-you-need-to-know-about-survey-respondents",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:26:47Z",
    "updated_at": "2024-08-19T19:14:02Z",
    "name": "All you need to know about survey respondents",
    "title": "All you need to know about survey respondents",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T08:22:46Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides comprehensive information about survey respondents, including how to select them, maximize response rates, and choose the appropriate invitation method. It covers key aspects of conducting effective surveys and ensuring representative results.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>This guide focuses on the essential aspects of managing survey respondents, from selection to invitation methods, to help you conduct successful surveys and obtain meaningful results.</p>\n<ul>\n<li><a href=\"#h_01HGKSMPRT0YJQCQ3JXBP5XNZM\">Selections of respondents</a></li>\n<li><a href=\"#h_01HGKSMPRT8YJXQXQJ3QKXP8ZN\">Largest possible number of responses to the survey</a></li>\n<li><a href=\"#h_01HGKSMPRTNXJZ0QJXQKXP8ZN9\">Selecting the method of invitation</a></li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT0YJQCQ3JXBP5XNZM\">Selections of respondents</h2>\n<p>Respondents are selected from a population, such as all of a company's customers. To ensure representative results:</p>\n<ul>\n<li>Select a random sample from the population if not inviting everyone</li>\n<li>Aim for a sample that represents the entire population</li>\n<li>Be aware of potential systematic biases, such as overrepresentation of certain demographics</li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT8YJXQXQJ3QKXP8ZN\">Largest possible number of responses to the survey</h2>\n<p>Maximizing the response rate is crucial for survey success. Consider the following factors:</p>\n<ul>\n<li>Response rates vary depending on the target group and survey type</li>\n<li>Close relationships and relevant questions generally lead to better response rates</li>\n<li>Incentives, such as gifts or charitable donations, can motivate participation</li>\n<li>Implement changes based on previous survey results to encourage future participation</li>\n<li>Conduct a drop-out analysis if concerned about low response rates</li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRTNXJZ0QJXQKXP8ZN9\">Selecting the method of invitation</h2>\n<p>Choose the appropriate invitation method based on your target audience and available contact information:</p>\n<h3 id=\"h_01HGKSMPRTZ8K3QJ3QKXP8ZN9X\">Email Invitations</h3>\n<p>Recommended that you have email addresses for all potential respondents. Advantages include:</p>\n<ul>\n<li>Full control over who can respond to the survey</li>\n<li>Ability to send targeted reminders</li>\n<li>Option to upload respondent information beforehand</li>\n</ul>\n<h3 id=\"h_01HGKSMPRVBZ8K3QJ3QKXP8ZN9\">URL Link Method</h3>\n<p>Useful when email addresses are not available. This method involves:</p>\n<ul>\n<li>Placing a survey link on a website</li>\n<li>Informing participants via SMS, letter, or other means</li>\n<li>Option to complete responses on hard copies and later capture via URL link</li>\n</ul>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRV7Z8K3QJ3QKXP8ZN9\">What is a drop-out analysis?</h3>\n<p>A drop-out analysis is used to identify if those who answered the survey have the same characteristics as those who did not answer. This helps to eliminate systematic biases between the two groups. Characteristics could include age, customer type, region, etc.</p>\n<h3 id=\"h_01HGKSMPRV9Z8K3QJ3QKXP8ZN9\">How can I improve response rates for my surveys?</h3>\n<p>To improve response rates, consider the following strategies:</p>\n<ul>\n<li>Ensure questions are relevant to the respondents</li>\n<li>Highlight the direct benefits of participating in the survey</li>\n<li>Offer incentives or donate to charity for each response</li>\n<li>Provide feedback on changes implemented from previous surveys</li>\n<li>Maintain a close relationship with your target audience</li>\n</ul>\n<h3 id=\"h_01HGKSMPRVCZ8K3QJ3QKXP8ZN9\">What are the advantages of web-based survey tools?</h3>\n<p>Web-based survey tools offer several advantages:</p>\n<ul>\n<li>They can replace traditional survey methods like telephone or postal surveys</li>\n<li>They allow for easy distribution and data collection</li>\n<li>They provide options for both email invitations and URL link methods</li>\n<li>They often include features for data analysis and reporting</li>\n</ul>\n</article>",
    "user_segment_ids": []
}