{
    "id": 20230581146514,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230581146514.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230581146514-How-to-write-the-perfect-introductory-text-for-your-survey",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:28:14Z",
    "updated_at": "2024-08-19T19:14:48Z",
    "name": "How to write the perfect introductory text for your survey",
    "title": "How to write the perfect introductory text for your survey",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T08:14:29Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides guidance on creating effective introductory text for surveys, including email invitations and survey introductions. It covers visual design, content structure, and best practices for engaging respondents.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Learn how to craft compelling survey introductions that encourage participation and provide clear information to respondents.</p>\n<ul>\n<li><a href=\"#visual_design\">Visual design of the survey – layout and logo</a></li>\n<li><a href=\"#email_invitation\">Text for the email invitation</a></li>\n<li><a href=\"#introductory_text\">Introductory text</a></li>\n</ul>\n<p> </p>\n<h2 id=\"visual_design\">Visual design of the survey – layout and logo</h2>\n<p>Enhance your survey's appearance and professionalism by:</p>\n<ul>\n<li>Using an attractive background to make the survey more inviting</li>\n<li>Aligning the visual design with your organization's profile</li>\n<li>Including your organization's logo to establish a clear connection with the sender</li>\n</ul>\n<p> </p>\n<h2 id=\"email_invitation\">Text for the email invitation</h2>\n<p>The email invitation is crucial for engaging respondents. Keep these points in mind:</p>\n<ul>\n<li>Keep it brief</li>\n<li>Describe the survey's purpose</li>\n<li>State the estimated time to complete the survey</li>\n<li>Mention any incentives for participation</li>\n</ul>\n<h3 id=\"email_example\">Example text for email invitation:</h3>\n<p>DEAR CUSTOMER,<br><br>We see that you have been in contact with our customer services center in the past six weeks. In this regard, we would like your feedback in terms of this enquiry, so that we can improve the customer service we offer. The survey only takes 3-4 minutes to complete.<br><br>Product supplier AS takes your feedback seriously! Please click the link below to answer the questionnaire.<br><br>Best regards<br>Per Hansen<br>Customer services manager<br>Product supplier AS<br>per@productsupplier.com<br>Tel.: 98 76 54 32</p>\n<p> </p>\n<h2 id=\"introductory_text\">Introductory text</h2>\n<p>The survey introduction should address the following:</p>\n<ul>\n<li>Type of survey</li>\n<li>Background and purpose</li>\n<li>Reason for selecting the recipient</li>\n<li>Importance of participation and benefits</li>\n<li>Intended use of results</li>\n<li>Estimated completion time</li>\n<li>Data confidentiality and treatment</li>\n<li>Sender information</li>\n</ul>\n<h3 id=\"intro_example_1\">Example of introduction I:</h3>\n<p>Thank you for agreeing to give us your views and feedback on our customer service through this survey. You have received this invitation to participate in our customer survey because you have recently been in contact with our customer services department.<br><br>The survey will provide Product supplier with valuable information on how our customer service is experienced, and will help us improve and develop it even further. This means that you and other customers will get even better service from us in the future!<br><br>It takes only 3 - 4 minutes to answer the questionnaire. We guarantee that your responses will be treated confidentially.<br><br>Best regards<br>John Doe<br>Customer services manager<br>Product supplier AS<br>john@productsupplier.com<br>Tel.: 98 76 54 32</p>\n<h3 id=\"intro_example_2\">Example of introduction II:</h3>\n<p>Thank you very much for your feedback, the results will be used to improve our customer service!</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_1\">Why is the visual design of a survey important?</h3>\n<p>A well-designed survey with an attractive background and your organization's logo creates a professional image and helps establish a clear connection with the respondents, potentially increasing participation rates.</p>\n<h3 id=\"faq_2\">What should be included in the email invitation for a survey?</h3>\n<p>The email invitation should be brief, describe the survey's purpose, state the estimated completion time, and mention any incentives for participation. It serves as a \"teaser\" to encourage recipients to take the survey.</p>\n<h3 id=\"faq_3\">What information should be included in the survey's introductory text?</h3>\n<p>The introductory text should cover the type of survey, its background and purpose, why the recipient was selected, the importance of participation, how results will be used, estimated completion time, data confidentiality, and sender information.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}