{
    "id": 20230637823506,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230637823506.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230637823506-What-you-should-keep-in-mind-when-you-plan-your-survey",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 1,
    "vote_count": 1,
    "section_id": 20278886810002,
    "created_at": "2024-07-18T12:33:40Z",
    "updated_at": "2024-08-19T19:19:01Z",
    "name": "What you should keep in mind when you plan your survey",
    "title": "What you should keep in mind when you plan your survey",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T09:05:58Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides guidance on planning and executing effective surveys. It covers key aspects such as scheduling, process-based surveys, and defining the purpose and target group for your survey.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Learn how to plan and conduct successful surveys by considering important factors such as timing, target audience, and survey objectives.</p>\n<ul>\n<li><a href=\"#planning_schedule\">Planning a schedule</a></li>\n<li><a href=\"#process_event_surveys\">Process or event-based surveys</a></li>\n<li><a href=\"#define_purpose\">Define purpose, information requirements and target group</a></li>\n</ul>\n<h2 id=\"planning_schedule\">Planning a schedule</h2>\n<p>Before sending a survey, it's crucial to plan a schedule for obtaining results at the right time. Your schedule should include time for:</p>\n<ul>\n<li>Defining the survey's purpose</li>\n<li>Identifying responsible parties for implementing measures based on results</li>\n<li>Determining the target group</li>\n<li>Constructing questions and response options</li>\n<li>Gathering input from colleagues and partners</li>\n<li>Proofreading</li>\n<li>Testing and quality assurance</li>\n<li>Data collection and reminders</li>\n<li>Data interpretation and analysis</li>\n<li>Report preparation and presentation</li>\n<li>Action plan development</li>\n</ul>\n<p>It's important to allocate sufficient time for clarifying the survey's purpose and intended use of results to ensure you ask the right questions and capture the necessary information.</p>\n<p> </p>\n<h2 id=\"process_event_surveys\">Process or event-based surveys</h2>\n<p>Tivian recommends conducting smaller, process or event-based surveys instead of comprehensive annual surveys. Advantages of this approach include:</p>\n<ul>\n<li>Fresh experiences in respondents' minds</li>\n<li>Increased relevance for respondents</li>\n<li>More frequent opportunities for improvement</li>\n</ul>\n<p>Examples of situations ideal for process-based surveys:</p>\n<ul>\n<li>Course evaluations</li>\n<li>Customer service experience</li>\n<li>Employee exit interviews</li>\n</ul>\n<p> </p>\n<h2 id=\"define_purpose\">Define purpose, information requirements and target group</h2>\n<p>Defining the survey's purpose is crucial for its success. Consider these three important questions:</p>\n<ol>\n<li>\n<p><strong>What is being investigated?</strong> Determine what you want to know and how you'll use the results. This may influence the nature of your questions.</p>\n</li>\n<li>\n<p><strong>Who is the target group?</strong> Clearly define your target audience to ensure relevant questions and accurate results.</p>\n</li>\n<li>\n<p><strong>What will you ask about?</strong> Focus on specific questions that will provide the answers you're seeking.</p>\n</li>\n</ol>\n<p>Answering these questions provides a solid foundation for creating an effective survey, regardless of its type (e.g., meeting evaluations, customer satisfaction surveys, or employee surveys).</p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_1\">Why is defining the survey's purpose important?</h3>\n<p>Defining the survey's purpose is crucial because it affects the choice of method, respondent selection, question formulation, and overall survey design. An unclear purpose can lead to asking the wrong questions and failing to capture the desired information.</p>\n<h3 id=\"faq_2\">What are the advantages of process-based surveys?</h3>\n<p>Process-based surveys offer several advantages: respondents have fresh experiences in mind, the survey feels more relevant to them, and you have more frequent opportunities to make improvements based on the results.</p>\n<h3 id=\"faq_3\">How can I ensure my survey captures the right information?</h3>\n<p>To ensure your survey captures the right information, focus on clearly defining its purpose, identifying the target group, and carefully constructing questions that align with your information requirements. Allocate sufficient time for planning and review to avoid common pitfalls.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}