{
    "id": 20230662387730,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230662387730.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230662387730-How-do-I-set-up-plausibility-checks-in-questionnaires",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20271541513746,
    "created_at": "2024-07-18T12:31:48Z",
    "updated_at": "2024-08-28T10:00:12Z",
    "name": "How do I set up plausibility checks in questionnaires?",
    "title": "How do I set up plausibility checks in questionnaires?",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-07T10:00:00Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01J4P4FWGR1YHRC0M696QZTWDW\">Overview</h1>\n<article>\n<p>This article explains how to set up plausibility checks in questionnaires, including their purpose, planning considerations, and implementation steps.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Plausibility checks are used in Internet surveys to ensure data quality by verifying the correctness of answers during entry. This guide covers the importance of plausibility checks, how to plan their use, and provides an example of implementing a plausibility check.</p>\n<ul>\n<li><a href=\"#Why-plausibility-checks?\">Why plausibility checks?</a></li>\n<li><a href=\"#Planning-the-Use-of-Plausibility\">Planning the Use of Plausibility</a></li>\n<li><a href=\"#Example:-Plausibility-Check\">Example: Plausibility Check</a></li>\n</ul>\n<p data-renderer-start-pos=\"30\">Internet surveys permit quality checks and data checks as early as during entry. Minor errors and missing information can thus be noted immediately during entry. The respondent will receive a short message indicating that they may have overlooked something. You will not have to ask follow-up questions afterward but can correct the incorrect information immediately during entry instead. Checks for the correctness of answers are commonly referred to as “plausibility checks”.</p>\n<div class=\"fabric-editor-block-mark fabric-editor-alignment cc-5inqjd\" data-align=\"center\">\n<h2 id=\"Why-plausibility-checks?\" data-renderer-start-pos=\"511\">Why plausibility checks?</h2>\n</div>\n<p data-renderer-start-pos=\"538\">Plausibility checks are used to ensure a certain level of data quality. Sometimes, respondents will overlook a question or commit minor errors when setting an answer. Sometimes, questions are also answered incompletely, if the respondent for example wants to get an overview of the questionnaire first or completes the questionnaire without serious interest. The information given should be checked especially if branchings at later stages in the questionnaire are based on the answers to preceding questions. Plausibility checks are advisable in the following cases:</p>\n<ul class=\"ak-ul\" data-indent-level=\"1\">\n<li>\n<p data-renderer-start-pos=\"1108\">The answer to the question is taken up in later questions, either in a filter condition or in a display of dynamic questions.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"1237\">Assuring fill-in instructions, such as “Select the three most important properties of products xy”.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"1340\">Answers to a specific question are of particular interest for the evaluation.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"1421\">The internal consistency of the data is of particular importance for the evaluation.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"1509\">The data being queried already exists in participant administration.</p>\n</li>\n</ul>\n<div class=\"fabric-editor-block-mark fabric-editor-alignment cc-5inqjd\" data-align=\"center\">\n<h2 id=\"Planning-the-Use-of-Plausibility\" data-renderer-start-pos=\"1581\">Planning the Use of Plausibility</h2>\n</div>\n<p data-renderer-start-pos=\"1616\">Be aware of which answers are important for the routing of the survey and which data are central to the evaluation purpose. However, use plausibility checks with care. For the respondent, plausibility checks are, first and foremost, annoying and tiresome because their behavior is questioned and their progress through the survey is hindered. Too many plausibility checks will destroy the relationship of trust between you and the respondent. Also, take into consideration that respondents may not yet have formed an opinion on some questions. In such cases, you will often achieve better data quality by allowing incomplete information than by forcing the respondent to give an answer that might only be valid for the moment and not actually meant by the respondent.</p>\n<p data-renderer-start-pos=\"2386\">Think about aspects such as the following:</p>\n<ul class=\"ak-ul\" data-indent-level=\"1\">\n<li>\n<p data-renderer-start-pos=\"2432\">Which answers are indispensable for the routing of the survey?</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"2498\">To which questions do you want to obtain answers from as many respondents as possible?</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"2588\">How would you react if your answer to a question were rejected as incorrect by a survey system?</p>\n</li>\n</ul>\n<p data-renderer-start-pos=\"2687\">In addition to the psychological effects on the respondents, there are technical aspects as well:</p>\n<ul class=\"ak-ul\" data-indent-level=\"1\">\n<li>\n<p data-renderer-start-pos=\"2788\">On each questionnaire page, you can create as many plausibility checks as required. But plausibility checks require a lot of server resources, i.e. they affect the performance of the questionnaire, similar to other checks and dynamic features. Therefore, it is recommended to use not more than 50 plausibility checks per page.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"3118\">For plausibility checks, no dedicated sort order is implemented. I.e. while you may arrange the checks on a specific page in a specific sequence, this order may get lost especially if copying or importing the project.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"3339\">The conditions of plausibility checks should refer only to variables that have a defined value. If condition variables are not filled at all or contain missings (e.g. because a question or answer option has been hidden or if a respondent hasn’t filled an entry field) the checks can have unexpected or even wrong results.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"3665\">Try to avoid complex plausibility check conditions or to substitute them by multiple simple plausibility checks. This way it is easier to get an overview of the variables used in the plausibility check and to avoid unexpected results.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"3903\">If necessary, the pro editor allows to define complex conditions.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"3972\">In general, it is recommended to abstain from applying both hiding conditions and plausibility checks to the same variables.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"4100\">When dealing with question types whose variables have characteristics (e. g. single response list), please note: As soon as a single answer option of the question, i.e. one characteristic of the variable, is hidden, the variable will be defined as “missing” when used in a plausibility check. Therefore, in this case, the actual value of the variable cannot be determined by means of a plausibility check. If you cannot or do not want to work without the plausibility check, you might want to consider using a list instead of hiding conditions.</p>\n</li>\n<li>\n<p data-renderer-start-pos=\"4648\">If a plausibility check checks several variables, and only one or a few of these are affected by hiding conditions, it may make sense to deploy the option “Execute check if one or more items are blinded out?”. If this option is activated, the variables affected by the hiding condition will simply be skipped when executing the check. Mind that if all variables of the check are affected, it will not be executed, to prevent that participant get stuck on the page.</p>\n</li>\n</ul>\n<div class=\"fabric-editor-block-mark fabric-editor-alignment cc-5inqjd\" data-align=\"center\">\n<h2 id=\"Example:-Plausibility-Check\" data-renderer-start-pos=\"5118\">Example: Plausibility Check</h2>\n</div>\n<p data-renderer-start-pos=\"5148\">Let’s assume that you ask the participants of your survey to enter their year of birth into an open entry field. You want to ensure that they enter only reasonable values: The values should be four-digit numbers inside a reasonable range, e.g. between 1900 and 2000.</p>\n<p data-renderer-start-pos=\"5416\">To realize this with a plausibility check, please proceed as follows:</p>\n<ul>\n<li data-renderer-start-pos=\"5489\">In the questionnaire editor, choose the page on which you want to perform the plausibility check. Click on the title of that page. The page view will open.</li>\n<li>Click on the Plausibility checks menu.</li>\n</ul>\n<p class=\"wysiwyg-indent3\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015011205522\"></p>\n<ul>\n<li data-renderer-start-pos=\"5648\">The overview of plausibility checks is opened. No checks have been defined yet.</li>\n<li data-renderer-start-pos=\"5778\">Click on the + Plausibility check button.</li>\n<li data-renderer-start-pos=\"5823\">Enter the title.</li>\n<li data-renderer-start-pos=\"5843\">Select the “Range check” check type. For detailed explanations of the check types, please see this post.​</li>\n</ul>\n<p class=\"wysiwyg-indent3\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015011206162\"></p>\n<ul>\n<li data-renderer-start-pos=\"5843\">Confirm with Proceed.</li>\n<li data-renderer-start-pos=\"5982\">The entry dialog is opened.</li>\n<li>In the “User may ignore this check” field, the “No” option should be activated. This means that the person completing the questionnaire must correct any incorrect entry. Otherwise, the next survey page will not be displayed.</li>\n<li data-renderer-start-pos=\"6241\">Only in projects with classic system layout: In the “Systems to use for check” field, the “Client (JavaScript) AND Server (PHP)” option should be activated.</li>\n<li data-renderer-start-pos=\"6401\">Do not change the setting of the field „Execute check if one or more items are hidden??“. In the current example situation, it does not matter as there are no hidden items.</li>\n<li data-renderer-start-pos=\"6577\">When executing JavaScript plausibility checks you may choose to let the participant neglect the plausibility check. In this case, check Yes with the option offered.</li>\n<li data-renderer-start-pos=\"6744\">Choose which system you would like to check in the responsive layout: Client (JavaScript), Server (PHP), or Client (JavaScript) AND Server (PHP).</li>\n<li data-renderer-start-pos=\"6892\">In the following field, you can edit the message which is displayed if the check condition applies. Please replace the default message “An error occurred!” with “Please enter your year of birth as a four-digit number!”.</li>\n<li data-renderer-start-pos=\"7113\">Next, define the check condition itself: First, select the variable which you want to check.</li>\n<li data-renderer-start-pos=\"7209\">Then, enter the range within which the values are to be valid. In the example shown, “1900” is the minimum, “2000” is the maximum.</li>\n<li data-renderer-start-pos=\"7340\">Click on the Save button.</li>\n<li data-renderer-start-pos=\"7369\">To see the pop-up that will be displayed to the respondents, open the Page Preview tab and enter an erroneous value to trigger the check. </li>\n<li data-renderer-start-pos=\"7512\">The new check is listed in the overview.</li>\n</ul>\n<p> </p>\n<h1 id=\"h_01HGKSMPRW28YJQM5SXLBP4XNZV\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRWA8YJQN6TXMBP5XNZW\">What are the benefits of using plausibility checks?</h3>\n<p>Plausibility checks help ensure data quality, reduce errors, and minimize the need for follow-up questions by catching issues during data entry.</p>\n<h3 id=\"h_01HGKSMPRWJ8YJQO7UXNBP6XNZX\">How many plausibility checks should I use per page?</h3>\n<p>It is recommended to use no more than 50 plausibility checks per page to maintain good performance.</p>\n<h3 id=\"h_01HGKSMPRWR8YJQP8VXOBP7XNZY\">Can I use complex conditions in plausibility checks?</h3>\n<p>While possible, it's better to use multiple simple plausibility checks instead of complex ones to avoid unexpected results and maintain clarity.</p>\n</article>",
    "user_segment_ids": []
}