{
    "id": 20230466891922,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230466891922.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230466891922-Will-the-data-collected-be-shared-with-third-parties-for-advertising-purposes",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20271541513746,
    "created_at": "2024-07-18T12:24:04Z",
    "updated_at": "2024-08-19T19:10:30Z",
    "name": "Will the data collected be shared with third parties for advertising purposes?",
    "title": "Will the data collected be shared with third parties for advertising purposes?",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-20T15:55:06Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article addresses concerns about data sharing practices at Tivian, specifically focusing on whether collected data is shared with third parties for advertising purposes.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>We'll explore Tivian's data handling policies and their commitment to data privacy and ownership.</p>\n<ul>\n<li><a href=\"#data_sharing_policy\">Tivian's Data Sharing Policy</a></li>\n<li><a href=\"#data_ownership\">Data Ownership and Control</a></li>\n<li><a href=\"#third_party_tools\">Use of Third-Party Tools</a></li>\n</ul>\n<p> </p>\n<h2 id=\"data_sharing_policy\">Tivian's Data Sharing Policy</h2>\n<p>Tivian has a strict policy against sharing data with third parties. The company does not pass on data to external entities in any way, shape, or form. This policy ensures that your information remains confidential and is used solely for the purposes you've agreed to.</p>\n<p> </p>\n<h2 id=\"data_ownership\">Data Ownership and Control</h2>\n<p>Tivian operates on the principle that you, the client, remain the owner of your data at all times. The company only processes your data at your request, giving you complete control over the extent, nature, and purpose of data collection. This approach empowers you to maintain full ownership and decision-making authority over your information.</p>\n<p> </p>\n<h2 id=\"third_party_tools\">Use of Third-Party Tools</h2>\n<p>In line with its commitment to data privacy, Tivian does not use third-party analytics tools such as Google Analytics in its surveys. This further ensures that your data is not exposed to external parties and remains within the controlled environment of Tivian's systems.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_data_sharing\">Will the data collected be shared with third parties for advertising purposes?</h3>\n<p>No. Tivian does not share any collected data with third parties for advertising purposes or any other reason. Your data remains under your control and is processed only as per your instructions.</p>\n<h3 id=\"faq_data_control\">How much control do I have over my data with Tivian?</h3>\n<p>You have complete control over your data. Tivian only processes data at your request, and you determine the extent, nature, and purpose of data collection.</p>\n<h3 id=\"faq_analytics_tools\">Does Tivian use tools like Google Analytics in surveys?</h3>\n<p>No, Tivian does not use third-party analytics tools like Google Analytics in their surveys. This ensures that your survey data remains private and is not exposed to external platforms.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}