{
    "id": 20230804545554,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230804545554.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230804545554-What-data-protection-measures-does-Tivian-take",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20271541513746,
    "created_at": "2024-07-18T12:37:51Z",
    "updated_at": "2024-08-19T19:20:49Z",
    "name": "What data protection measures does Tivian take?",
    "title": "What data protection measures does Tivian take?",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-20T15:47:32Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article outlines the data protection measures implemented by Tivian to ensure the security and privacy of personal data.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Tivian takes several steps to protect personal data and maintain compliance with data protection regulations. These measures cover various aspects of data handling, from access control to data processing and storage.</p>\n<p> </p>\n<ul>\n<li><a href=\"#data_access_control\">Data Access Control</a></li>\n<li><a href=\"#data_transmission_security\">Data Transmission Security</a></li>\n<li><a href=\"#data_processing_monitoring\">Data Processing Monitoring</a></li>\n<li><a href=\"#data_protection_and_integrity\">Data Protection and Integrity</a></li>\n</ul>\n<p> </p>\n<h2 id=\"data_access_control\">Data Access Control</h2>\n<p>Tivian implements strict access control measures to protect personal data:</p>\n<ul>\n<li>Data processing systems are secured against unauthorized use.</li>\n<li>Only authorized individuals can access data on the systems they are permitted to use.</li>\n<li>Personal data cannot be read, copied, altered, or removed without proper authorization.</li>\n</ul>\n<p> </p>\n<h2 id=\"data_transmission_security\">Data Transmission Security</h2>\n<p>To ensure the security of personal data during transmission and storage:</p>\n<ul>\n<li>Personal data is protected from unauthorized reading, copying, alteration, or removal during electronic transmission.</li>\n<li>Similar protections are in place during data transportation and when stored on data storage media.</li>\n</ul>\n<p> </p>\n<h2 id=\"data_processing_monitoring\">Data Processing Monitoring</h2>\n<p>Tivian maintains transparency and accountability in data processing:</p>\n<ul>\n<li>It is possible to monitor and identify whether personal data has been entered into data protection systems, altered, or removed.</li>\n<li>The system can track who performed these actions.</li>\n<li>Personal data processed on request is only handled in accordance with the customer's instructions.</li>\n</ul>\n<p> </p>\n<h2 id=\"data_protection_and_integrity\">Data Protection and Integrity</h2>\n<p>To maintain data integrity and prevent loss:</p>\n<ul>\n<li>Personal data is protected against accidental loss and destruction.</li>\n</ul>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_unauthorized_access\">How does Tivian prevent unauthorized access to data processing systems?</h3>\n<p>Tivian implements security measures to ensure that data processing systems cannot be used by unauthorized individuals. Only those with proper authorization can access the data on the systems they are permitted to use.</p>\n<h3 id=\"faq_data_transmission\">How is personal data protected during transmission?</h3>\n<p>Tivian has measures in place to prevent personal data from being read, copied, altered, or removed without authorization during electronic transmission, transportation, or when stored on data storage media.</p>\n<h3 id=\"faq_data_monitoring\">Can Tivian track changes made to personal data?</h3>\n<p>Yes, Tivian's systems allow for subsequent monitoring and identification of whether personal data has been entered, altered, or removed from data protection systems, and by whom these actions were performed.</p>\n<h3 id=\"faq_data_processing\">How does Tivian ensure proper handling of customer data?</h3>\n<p>Personal data processed on request is only handled in accordance with the customer's instructions, ensuring compliance with data protection regulations and customer requirements.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}