{
    "id": 20231634628626,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20231634628626.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231634628626-How-to-Keeping-Track-of-my-Panel",
    "author_id": 377518684840,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234774909202,
    "created_at": "2024-07-18T13:08:10Z",
    "updated_at": "2024-08-28T09:53:05Z",
    "name": "How-to: Keeping Track of my Panel",
    "title": "How-to: Keeping Track of my Panel",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-31T09:06:28Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides a comprehensive guide on how to keep track of your panel using the Statistics menu in the People module. It covers two main topics: Panel Statistics and Quotas, offering step-by-step instructions on how to create detailed panel statistics and set up quotas to monitor your panel population.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Learn how to efficiently manage and analyze your panel using Questback's People module. This guide focuses on creating panel statistics and setting up quotas to ensure your panel meets specific demographic requirements.</p>\n<ul>\n<li><a href=\"#h_01HGKSMPRT0QQXQX3YJXQX8ZGM\">Panel Statistics</a></li>\n<li><a href=\"#h_01HGKSMPRT4YJQJY0QJXQX8ZGN\">Quotas</a></li>\n</ul>\n<h2 id=\"h_01HGKSMPRT0QQXQX3YJXQX8ZGM\">Panel Statistics</h2>\n<p>Panel statistics allow you to analyze various aspects of your panel, including demographic information, entry methods, and performance data. This section guides you through the process of creating and interpreting panel statistics.</p>\n<h3 id=\"h_01HGKSMPRTCYJQJY0QJXQX8ZGQ\">Create Panel Statistics</h3>\n<p>Follow these steps to create panel statistics:</p>\n<ol>\n<li>Navigate to People &gt; Statistics &gt; Panel statistics</li>\n<li>Configure your desired settings in the Base, Split variables, Panel status, and Performance data areas</li>\n<li>Click on \"Create statistics\" to generate your report</li>\n</ol>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812848786\"></p>\n<h3 id=\"h_01HGKSMPRTGYJQJY0QJXQX8ZGR\">Example 1: Invitations and Completed Surveys by Gender</h3>\n<p><strong>Example 1: Configuration</strong><br>In our first example, we want to generate statistics on how many invitations the panelists in a particular group have received and how many surveys they have completed. We also want to break down the results by gender. This could then indicate, for example, whether your surveys are more interesting for men or women. To do this, follow the steps below:</p>\n<ul>\n<li>In the Base area, select the corresponding panel group category for the Panel group category. In our case, this is \"default\".</li>\n<li>Then, under the Panel group, select the desired panel group to which you would like to restrict the results. In our case, this is the \"Statistics test\" panel group.</li>\n<li>Under Split variables, select the variable u_gender: Gender.</li>\n<li>Retain the default setting Active in the Panel status area.</li>\n<li>\n<img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812855314\"><br>Under Performance data, select the variable track_num_completed. This stands for the number of completed surveys.</li>\n<li>Then select the variable track_num_invited. This stands for the number of invitations.</li>\n<li>Click on Create statistics at the bottom right of the page.</li>\n<li>This example demonstrates how to create statistics on invitations and completed surveys, broken down by gender.</li>\n</ul>\n<p><strong>Example 1 – Results</strong><br>After clicking on Create Statistics, your statistics will be displayed immediately. At the top you will find a summary of the base:</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859800850\"><br>Then, the number of completed surveys is displayed, broken down by gender:<img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812851858\"></p>\n<ul>\n<li>1 panelist (male) from the Statistics test group has not completed any survey.</li>\n<li>1 panelist (male) from the Statistics test group has completed 2 surveys.</li>\n<li>2 panelists (female) from the Statistics test group have completed 3 surveys.</li>\n</ul>\n<p>Then, you can see the number of invitations broken down by gender:</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812858898\"></p>\n<ul>\n<li>Two male and two female panelists have each received 3 invitations.</li>\n</ul>\n<h3 id=\"h_01HGKSMPRTK0QJXQX3YJXQX8ZGS\">Example 2: Panel Entry Methods by Age</h3>\n<p>This example shows how to generate statistics on panel entry methods, filtered by a specific entry period and broken down by age.</p>\n<p><strong>Example 2 – Configuration</strong><br>In our second example, we want to create statistics on how many panelists entered the panel via a specific way of entry. The results should be broken down by age and filtered according to a specific entry period. To do this, proceed as follows:</p>\n<ul>\n<li>In the Base area, select the variable md_age: Age for Split variables. The age of panelists is recorded in this master data variable. Information on creating and managing master data can be found <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229153131026-Master-Data\">here.</a>\n</li>\n<li>Under Entered panel from and Entered panel until select the start and end time for the period you want to filter by.</li>\n<li>We would like to create statistics for all panelists – regardless of their status. Therefore, activate the checkbox for Select All in the Panel status area.</li>\n<li>\n<img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859802258\"><br>In the Performance data area, select the variable input, which records the mode of entry of panelists.</li>\n<li>In the Performance data area, select the variable reg_code, which records the way of entry of panelists.</li>\n<li>Click on Create statistics at the bottom right of the page.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812854290\"></p>\n<p> </p>\n<p><strong>Example 2 – Results</strong><br>Your statistics are created and you will find a summary of the base in the upper area:</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812860434\"><br>Further down, the statistics on the mode of entry of panelists are displayed:</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812862354\"></p>\n<ul>\n<li>You can see, for example, how many panelists have been imported, entered by the admin, or invited to the panel, and you have a direct overview of the distribution of panelists' ages. In our example, the majority of panelists were imported.</li>\n</ul>\n<p>The statistics on the way of entry of panelists are displayed below:</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859799442\"></p>\n<ul>\n<li>In our example, you can see that the majority of panelists entered the panel via the standard way of entry \"Default\". No information on the age of these panelists is available. If the age or other panelist characteristics are of interest to you, it is advisable to ask about them as part of a master data survey.</li>\n<li>A small proportion is also registered via Portals. Here you can also see the age distribution of panelists.</li>\n</ul>\n<h2 id=\"h_01HGKSMPRT4YJQJY0QJXQX8ZGN\">Quotas</h2>\n<p>Quotas help ensure that your panel population meets specific demographic requirements. This section explains how to create and manage quotas.</p>\n<h3 id=\"h_01HGKSMPRTPYJQJY0QJXQX8ZGT\">Preparations</h3>\n<p>We will take up the above example and create a quota with the variables \"age\" and \"gender\" in the next step. Our target values: 150 females and 150 males between 20-30, 150 females and 150 males between 30-40, and 150 females and 150 males between 40-50.</p>\n<p>In the first step, we need to create a grouping filter that will determine the actuals of our panel. To do this, proceed as follows:</p>\n<ul>\n<li>In the People module, select the Groups menu item on the left-hand side.</li>\n<li>Then select the Grouping Filters menu item on the left-hand side.</li>\n<li>Click on the Create filter condition.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859816466\"></p>\n<ul>\n<li>Enter a name for the filter. In our case: \"Age_gender\".</li>\n<li>Enter a filter description if required. For the age of panelists, we have the master data variable \"md_age\" with the response categories \"1 (20-30 years)\", \"2 (30-40 years)\" and \"3 (40-50 years)\". Our filter should include all panelists in these age ranges. Proceed as follows to configure the filter criteria:</li>\n<li>Under Variable, select the master data variable md_age, under Condition the option equal, and under Value the number 1.</li>\n<li>Click on Save.</li>\n<li>In the next line, select OR as the conjunction, the master data variable md_age under Variable, the option equal under Condition, and the number 2 under Value.</li>\n<li>Click on Save.</li>\n<li>In the next line, select OR as the conjunction, the master data variable md_age under Variable, the option equal under Condition, and the number 3 under Value.</li>\n<li>Click on Save.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859816850\"></p>\n<p>=&gt; Your filter now includes all panelists between the ages of 20 and 50.</p>\n<h3 id=\"h_01HGKSMPRTTKQJXQX3YJXQX8ZGV\">Create Quota</h3>\n<p>We can now create the quota. To do this, follow the steps below:</p>\n<ul>\n<li>In the People module, select the Statistics menu item on the left-hand side.</li>\n<li>Then select the menu item Panel quotas on the left-hand side.</li>\n<li>\n<img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859806610\"><br>Click on Create Quota.</li>\n<li>Enter the name for your quota under the Quota name. In our case \"Age_Gender\".</li>\n<li>Under the Grouping filter to use when calculating actuals, select the filter you created in the previous step.</li>\n<li>Select the variable md_age: Age under Quota variable 1.</li>\n<li>Under Quota variable 2, select the variable u_gender: Gender.</li>\n<li>Click on Save.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859808658\"></p>\n<h3 id=\"h_01HGKSMPRTXKQJXQX3YJXQX8ZGW\">Upload Target Values</h3>\n<p>The last step is to upload the target values for the quota. To do this, proceed as follows:</p>\n<ul>\n<li>Click on the upload symbol in the line with your newly created quota.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812867346\"></p>\n<ul>\n<li>Click on the Download import template button, fill in the template and save it. The template already contains the variables that you selected when creating the quota. We want 150 participants as the target value for all three age ranges – \"1 (20-30 years)\", \"2 (30-40 years)\" and \"3 (40-50 years)\". Our import file therefore contains the following data:</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812868114\"></p>\n<ul>\n<li>Click on Choose file and select your saved import template.</li>\n<li>Click on Import.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812869010\"></p>\n<h3 id=\"h_01HGKSMPRV1KQJXQX3YJXQX8ZGX\">Show Cell Values</h3>\n<p>You can now display the quota allocation for the quota you have created and compare the target values with the actual values.</p>\n<ul>\n<li>In the line with the quota you have created, click on the symbol Show cell values.</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812870418\"><br>The quota allocation is displayed immediately. Cells for which the quota has been met are displayed in green. If the quota has not been met, the corresponding cell is displayed in red. In the example below, you can see at a glance that you need to recruit both female and male participants for the age range 30-40, male participants for the age range 40-50, and female participants for the age range 20-30. The other segments are sufficiently staffed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859818642\"></p>\n<p>For more information on the Statistics menu and the People module, consider exploring these resources:</p>\n<ul>\n<li>Complete documentation for the <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/sections/20234532074386-People\">EFS People module</a>\n</li>\n<li>Detailed information on the <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371116204818-Statistics\">Statistics menu</a>\n</li>\n<li>Step-by-step guides on <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231587536786-How-to-Efficient-Panelist-Management-in-the-People-Module\">Efficient Panelist Management</a> and <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231611755026-How-to-Automating-Processes-in-the-People-Module\">Automating Processes in the People Module</a>\n</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRV5KQJXQX3YJXQX8ZGY\">How often are the actuals in quotas updated?</h3>\n<p>The actuals in quotas are not updated in real-time. The last update time is displayed, and you can update the values manually if necessary.</p>\n<h3 id=\"h_01HGKSMPRV9KQJXQX3YJXQX8ZGZ\">Can I create custom variables for panel statistics?</h3>\n<p>Yes, you can use custom master data variables and tracking variables to create more specific panel statistics tailored to your needs.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}