{
    "id": 20230616827410,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20230616827410.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20230616827410-How-do-I-archive-a-survey-project",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20271541513746,
    "created_at": "2024-07-18T12:29:00Z",
    "updated_at": "2024-08-28T11:22:39Z",
    "name": "How do I archive a survey project?",
    "title": "How do I archive a survey project?",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-21T07:43:34Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article explains how to archive survey projects in EFS (Enterprise Feedback Suite). It covers the process of archiving single and multiple projects, as well as important information about the archiving functionality.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>Archiving survey projects helps to reduce database load by compressing result data into zip files and storing them in a protected area. This guide will walk you through the archiving process and provide essential details about the feature.</p>\n<p> </p>\n<ul>\n<li><a href=\"#h_01HGKSMPRT0YJQCQ3QXDJ8XBWM\">Understanding Project Archiving</a></li>\n<li><a href=\"#h_01HGKSMPRT8YJXQXQJ0JXCX8WN\">Archiving a Single Project</a></li>\n<li><a href=\"#h_01HGKSMPRTG0YJXQXQJ0JXCX8WP\">Archiving Multiple Projects</a></li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT0YJQCQ3QXDJ8XBWM\">Understanding Project Archiving</h2>\n<p class=\"wysiwyg-text-align-justify\">Survey projects can be archived to reduce database load by compressing the project result data into a zip file, which is then stored in a protected area of the hard disk. This process occurs once a day during low traffic periods, and you will be notified by email after successful archiving. The reactivation function allows you to transfer the project, with or without result data, back to the project list for editing and placement. If you need to delete the result data but want to keep a backup, you can download the zip file and store it locally. As long as the project remains in the EFS installation archive, you can upload the zip file to reactivate the project with its data. Note that the zip file only stores data locally and cannot be used to open or view data outside the EFS installation or to restore a completely deleted project.</p>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT8YJXQXQJ0JXCX8WN\">Archiving a Single Project</h2>\n<h3 id=\"h_01HGKSMPRTMR0YJXQXQJ0JXCX8WQ\">Step 1</h3>\n<p>Find the project to be archived in the project list and click on the title to access the Survey menu.</p>\n<h3 id=\"h_01HGKSMPRTSR0YJXQXQJ0JXCX8WR\">Step 2</h3>\n<p>Click on the links in the To-do field until the Archive link is displayed.</p>\n<h3 id=\"h_01HGKSMPRTYR0YJXQXQJ0JXCX8WS\">Step 3</h3>\n<p>Click on the Archive link.</p>\n<h3 id=\"h_01HGKSMPRV4R0YJXQXQJ0JXCX8WT\">Step 4</h3>\n<p>In the next low traffic period, all data for the project will be backed up from the database, compressed into the downloadable zip file, and then deleted from the database. The archived project with the zip file will be listed in the Archive submenu.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017142450578\"></p>\n<p> </p>\n<h2 id=\"h_01HGKSMPRTG0YJXQXQJ0JXCX8WP\">Archiving Multiple Projects</h2>\n<h3 id=\"h_01HGKSMPRVAR0YJXQXQJ0JXCX8WV\">Step 1</h3>\n<p>Search for the appropriate projects in the project list and use the \"Actions\" checkboxes to mark them.</p>\n<h3 id=\"h_01HGKSMPRVER0YJXQXQJ0JXCX8WW\">Step 2</h3>\n<p>Select the action \"Archive projects\" from the dropdown menu.</p>\n<h3 id=\"h_01HGKSMPRVM0YJXQXQJ0JXCX8WX\">Step 3</h3>\n<p>Click on the Execute button.</p>\n<h3 id=\"h_01HGKSMPRVSZ0YJXQXQJ0JXCX8WY\">Step 4</h3>\n<p>After a confirmation window, all data for the selected projects will be backed up from the database, compressed into downloadable zip files, and then deleted from the database. The archived projects with their zip files will be listed in the Projects - Archive menu.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017142451858\"></p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRVY0YJXQXQJ0JXCX8WZ\">What permissions do I need to archive projects?</h3>\n<p>The archiving functionality is protected by the ACL right \"archive_project\". You need read rights to archive projects and use the archive.</p>\n<h3 id=\"h_01HGKSMPRW40YJXQXQJ0JXCX8X0\">Can I archive projects in any status?</h3>\n<p>Yes, you can archive quantitative survey projects independent of their status, using the \"Actions\" drop-down list in the project list.</p>\n<h3 id=\"h_01HGKSMPRWA0YJXQXQJ0JXCX8X1\">Can I reactivate an archived project?</h3>\n<p>Yes, using the reactivation function, you have the option of transferring the project with or without result data back to the project list, so that it can be edited and placed again in the field.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}