{
    "id": 20231346702866,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20231346702866.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231346702866-Compatible-Authenticator-Apps-for-use-with-EFS-2FA",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20259399705746,
    "created_at": "2024-07-18T12:59:05Z",
    "updated_at": "2024-08-19T19:35:52Z",
    "name": "Compatible Authenticator Apps for use with EFS 2FA",
    "title": "Compatible Authenticator Apps for use with EFS 2FA",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-22T11:04:16Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article provides information about compatible authenticator apps for use with EFS 2FA (Two-Factor Authentication). It explains what an authenticator app is, how it works, and lists several recommended apps for both iOS and Android platforms.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>This guide focuses on the use of authenticator apps for enhanced security with EFS accounts, explaining their functionality and providing a list of compatible options.</p>\n<ul>\n<li><a href=\"#what_is_authenticator_app\">What is an authenticator app?</a></li>\n<li><a href=\"#how_authenticator_app_works\">How does an authenticator app work?</a></li>\n<li><a href=\"#compatible_apps\">Compatible authenticator apps for use with EFS</a></li>\n</ul>\n<p> </p>\n<h2 id=\"what_is_authenticator_app\">What is an authenticator app?</h2>\n<p>An authenticator app is a security tool that goes beyond passwords and traditional SMS/email-based two-factor authentication (2FA) for your EFS account. It uses an automatically generated secret key and the current time to create unique codes using the TOTP (Time-based One-Time Password) algorithm. This method is more secure than ordinary 2FA because it doesn't rely on messages that could be intercepted in a man-in-the-middle attack.</p>\n<p> </p>\n<h2 id=\"how_authenticator_app_works\">How does an authenticator app work?</h2>\n<p>The authenticator app works by storing a secret key generated by EFS. When you log in to EFS, you'll be prompted to provide a one-time code from the app. The app uses the stored key and the current time to generate this code. After entering the code, EFS validates it against the stored key on their end. If the code is correct, your identity is confirmed, and you're logged into EFS. This method is highly secure because the codes are generated independently and are difficult to steal. EFS also provides replay protection, ensuring that even if a code hasn't expired, it can't be used again after a successful login.</p>\n<p> </p>\n<h2 id=\"compatible_apps\">Compatible authenticator apps for use with EFS</h2>\n<p>The following authenticator apps have been tested and are compatible with EFS 2FA. While other apps implementing the TOTP algorithm can be used, it's important to consider the app's author, download count, and user feedback to ensure it's trustworthy and safe to use.</p>\n<h3 id=\"google_authenticator\">Google Authenticator App</h3>\n<p>One of the first authenticator apps, Google Authenticator is simple and easy to use. It doesn't use cloud storage for backups, which can be both an advantage and disadvantage.</p>\n<ul>\n<li><a href=\"https://apps.apple.com/us/app/google-authenticator/id388497605\">Download for iOS</a></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.authenticator2\">Download for Android</a></li>\n</ul>\n<h3 id=\"microsoft_authenticator\">Microsoft Authenticator App</h3>\n<p>This app includes a password manager and offers cloud sync for account backups.</p>\n<ul>\n<li><a href=\"https://apps.apple.com/us/app/microsoft-authenticator/id983156458\">Download for iOS</a></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=com.azure.authenticator\">Download for Android</a></li>\n</ul>\n<h3 id=\"2fa_authenticator\">2FA Authenticator (2FAS)</h3>\n<p>A fast authenticator app similar to Google Authenticator, with added features like cloud backup and account organization.</p>\n<ul>\n<li><a href=\"https://apps.apple.com/us/app/2fa-authenticator-2fas/id1217793794\">Download for iOS</a></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=com.twofasapp\">Download for Android</a></li>\n</ul>\n<h3 id=\"authy\">Authy</h3>\n<p>A popular authenticator app with cloud backups and multi-device features.</p>\n<ul>\n<li><a href=\"https://apps.apple.com/us/app/twilio-authy/id494168017\">Download for iOS</a></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=com.authy.authy\">Download for Android</a></li>\n</ul>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_what_if_lose_phone\">What happens if I lose my phone with the authenticator app?</h3>\n<p>If you lose your phone, the process depends on the app you're using. Some apps, like Microsoft Authenticator and Authy, offer cloud backups that allow you to recover your accounts on a new device. However, apps like Google Authenticator don't have this feature, so you'd need to use backup codes or contact EFS support to regain access to your account.</p>\n<h3 id=\"faq_multiple_devices\">Can I use an authenticator app on multiple devices?</h3>\n<p>Some authenticator apps, like Authy, support multiple devices. Others, like Google Authenticator, are designed for use on a single device. Check the features of your chosen app to see if it supports multiple devices.</p>\n<h3 id=\"faq_browser_addons\">Are there browser add-ons for TOTP authentication?</h3>\n<p>Yes, there are browser add-ons and extensions that can perform TOTP authentication without requiring a mobile phone. These can be convenient alternatives to mobile apps, especially when using a computer.</p>\n<p> </p>\n</article>",
    "user_segment_ids": []
}