{
    "id": 20317486456210,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20317486456210.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20317486456210-Timezone-Handling-in-EFS",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20034388560530,
    "created_at": "2024-07-23T08:46:15Z",
    "updated_at": "2024-08-28T10:01:53Z",
    "name": "Timezone Handling in EFS",
    "title": "Timezone Handling in EFS",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T10:04:17Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><span style=\"font-size: 2.1em;\">Overview</span></p>\n<article>\n<p>This article explains the difference between local time and UTC/GMT in the EFS admin interface and general Timezone handling. It covers how time zones are displayed in various sections of the system and how to configure personal time zone settings.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>EFS displays time information in different parts of the system. This guide clarifies which time zone is used in each section and how to customize the display of time.</p>\n<ul>\n<li><a href=\"#local_time\">Local Time</a></li>\n<li><a href=\"#gmt_utc\">GMT/UTC</a></li>\n<li><a href=\"#h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</a></li>\n</ul>\n<h2 id=\"local_time\">Local Time</h2>\n<p>\"Local Time\" in EFS refers to the time zone set for the EFS Admin Account. This can be configured in the system settings.</p>\n<h3 id=\"setting_local_time\">Setting Local Time</h3>\n<p>To set your local time zone:</p>\n<ol>\n<li>Go to <strong>System &gt; Users &gt; Own User Account &gt; Personal Preferences &gt; Common Settings</strong>\n</li>\n<li>Look for the \"Time Zone\" option</li>\n<li>Select your preferred time zone</li>\n</ol>\n<p>You can view the current local time at all times by clicking on \"System Info\" in the left menu of the EFS Admin area.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069133074\" width=\"567\" height=\"285\"></p>\n<h3 id=\"admin_log\">Admin Log</h3>\n<p>The Admin Log and Administration displays times in LOCAL TIME, according to the admin's personal settings.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039111442\" width=\"504\" height=\"137\"></p>\n<h3 id=\"statistics_detailed_view\">Statistics Detailed View</h3>\n<p>The Detailed View in Statistics displays times in LOCAL TIME as well.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039113746\" width=\"510\" height=\"153\"></p>\n<p>It's important to note that all date and time information in the EFS Admin area is converted to the corresponding local time. However, the <strong>default setting</strong> is UTC/GMT, so if not changed, it may appear that GMT is being used throughout the system.</p>\n<h2 id=\"gmt_utc\">GMT/UTC</h2>\n<p>While UTC (Coordinated Universal Time) is the more correct term, EFS uses GMT (Greenwich Mean Time) in its interface. For practical purposes in EFS, <strong>GMT and UTC can be considered equivalent.</strong></p>\n<h3 id=\"job_list_export\">Job List/Result Export</h3>\n<p>In Exports, fields such as datetime, date_of_last_access, and date_of_first_mail are displayed in GMT/UTC.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_default_time\">What is the default time zone in EFS?</h3>\n<p>The default time zone in EFS is UTC/GMT. If you haven't changed your personal settings, all times will appear in UTC/GMT.</p>\n<h3 id=\"faq_change_time\">How can I change the displayed time zone in EFS?</h3>\n<p>You can change the displayed time zone by updating your personal settings in the EFS Admin area. Go to <strong>System &gt; Users &gt; Own User Account &gt; Personal Preferences &gt; Common Settings</strong> and select your preferred time zone.</p>\n<h3 id=\"faq_utc_gmt\">What's the difference between UTC and GMT in EFS?</h3>\n<p>For practical purposes in EFS, there is no difference between UTC and GMT. Although UTC is the more technically correct term, EFS uses GMT in its interface.</p>\n<h3 id=\"h_01J3Q7CXMWD20SMRB0W50PRJWM\">If no time zone is stored for the recipient and the checkbox \"Send from\" uses the recipient's time zone\" is not checked, what time timezone will be used?</h3>\n<p>All participants are always assigned to a time zone. If nothing was defined during import, the time zone is Universal Time (UTC/GMT).</p>\n<h3 id=\"h_01J3Q7EQQ9EV4M5S335NE0Z2CA\">If I schedule an email for delivery, will it be sent according to UTC or my local time?</h3>\n<p>All times within EFS are based on the time zone set by the admin user, unless GMT/UTC is explicitly specified mentioned. So, if you already have a timezone setup, it will be your local time.</p>\n<h3 id=\"h_01J3Q7MNQCTNVPKMZPR0Z3K0HZ\">What time zone is used in filters?</h3>\n<p>For example, if you set a grouping filter that refers to the system variables like #PREVIOUS_DAY_END# and #CURRENT_DAY_END# and put it in context with a stored date  (e.g. an imported date in a master date), UTC will be used. The current values can be found under the \"(?)\". This is because the rules are executed on the server which needs UTC times.</p>\n<h3 id=\"h_01J3Q7TV8NC7YEHNZ57ZNZWKCX\">Until now, we have not had to take summer and winter time into account. So we have some jobs that always start at the same time according to CET. time. For example, 11 p.m. CET. How does that work?</h3>\n<p>The crons are created by the admins in UTC and are then executed at the appropriate time. No Summer or winter time is taken into account.</p>\n<p>So if you request a cron during winter time (CET) that should run at 00:00 CET (corresponds to UTC+1 at this time), then this will be executed in the cron at \"23:00 UTC\" because we are at UTC+1.</p>\n<p>During summer time (CEST) we are UTC+2 and the cron would be created with \"22:00 UTC\". </p>\n<h3 id=\"h_01J3Q7XFVC5BN3QYNGFESD38VG\">If an automatic cron is executed, for example, for sending mail, the actual time of sending in the mail admin is in UTC or that of my account?</h3>\n<p>All times in EFS are displayed in the time zone of the EFS account you are logged in with.</p>\n</article>",
    "user_segment_ids": []
}