{
    "id": 20371008404242,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371008404242.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371008404242-Base",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:45:57Z",
    "updated_at": "2024-08-21T12:32:42Z",
    "name": "Base",
    "title": "Base",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T14:44:40Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers the concept of Base in EFS Reporting+, including how to define and limit the base, use test data, anonymize results, and create contingency tables.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">EFS Reporting+ allows users to specify the number of persons included in the evaluation (base) and limit this number to certain sections of the report. This guide explains how to control the base size, use filters, and create contingency tables for data analysis.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#defining-the-base\">Defining the Base</a></li>\n<li><a href=\"#using-test-data-instead-of-live-data\">Using Test Data Instead of Live Data</a></li>\n<li><a href=\"#creating-contingency-tables\">Creating contingency tables</a></li>\n</ul>\n<p> </p>\n<p class=\"wysiwyg-text-align-justify\">Reports can be divided into chapters. In the completed report, these chapters will be displayed differently depending on the specified format:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>HTML reports: The chapters will be shown in the navigation bar of the report. The contents of a chapter will be summarized on one HTML page.</p>\n</li>\n<li>\n<p>Excel reports: The contents of a chapter will be summarized on one Excel sheet.</p>\n</li>\n<li>\n<p>PPT reports and PDFs generated from PowerPoint reports: An additional PPT slide with an inside title will be inserted at the beginning of each chapter.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Every report automatically contains a first chapter with the default title “First chapter”. It is possible to drag and drop the first chapter. If you wish to rename it, open the chapter editor by clicking on the Edit icon in the structure toolbar.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In order to create another chapter, click on the <strong>Create chapter</strong> icon and enter the title and description in the chapter editor. The new chapter will be automatically inserted at the end of the report: If necessary, you can drag it to another position. Afterward, you drag all required source data and structural elements into this new chapter.</p>\n</li>\n<li>\n<p>If you wish to subsequently edit, delete, or copy an already existing chapter, you need to mark it and then select the respective function in the structure toolbar. Please note that - just as in the questionnaire editor - you will delete or copy the entire branch below that chapter.</p>\n</li>\n<li>\n<p>In order to make sure that your chapter structure will be displayed correctly in the completed report, please note the following: The chapters in the completed report will be arranged in linear sequence. It is not possible to create subchapters. All chapters should therefore be at the topmost level in the report structure. If you move a chapter into the branch of another chapter, it will still be interpreted as the regular next chapter at the base level, i.e., there will be a break in the completed report.</p>\n</li>\n</ul>\n<h2 id=\"defining-the-base\" class=\"wysiwyg-text-align-justify\"><strong>Defining the Base</strong></h2>\n<p class=\"wysiwyg-text-align-justify\"><em>EFS Reporting+</em> enables you to specify the number of persons to be included in the evaluation (“base”) and to further limit this number for certain sections of your report if required. You can control the size of your base using special filters.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The restricting conditions are formulated using the condition editor that you are already familiar with from the questionnaire and which you also use to define questionnaire filters, triggers, and hiding conditions.</p>\n</li>\n<li>\n<p>The frequently-used restrictions by disposition code and date of participation can be activated with a few clicks via separate fields.</p>\n</li>\n<li>\n<p>To protect the anonymity of the participants, you can define anonymity limits both for the entire report and for particular sections.</p>\n</li>\n<li>\n<p>Displaying test data instead of real result data will speed up your work.</p>\n</li>\n</ul>\n<h3 id=\"overview-of-limiting-the-base\" class=\"wysiwyg-text-align-justify\"><strong>Overview of limiting the base</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Using the filters familiar from the questionnaire editor, you can restrict the base either for the entire report or just for a particular section. </p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The base for the entire report is defined via the <strong>Report filter</strong> in the<strong> Report</strong> menu.</p>\n</li>\n<li>\n<p>Furthermore, you can create separate filters to limit the base within a specific section of the report.</p>\n</li>\n<li>\n<p>In the filter section of the sources window, you will find the filters from your questionnaire. You can create additional filters via the toolbar the way you are familiar with from the chapters.</p>\n</li>\n<li>\n<p>Place the defined filters in the appropriate positions of your report structure. Then drag all those elements into this filter to which a filter shall be applied or in which the base shall be limited using the filter.</p>\n</li>\n</ul>\n<h3 id=\"defining-restricting-conditions\" class=\"wysiwyg-text-align-justify\"><strong>Defining restricting conditions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The report filter menu and filter dialog share largely the same structure.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 221.0px;\"> <col style=\"width: 539.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Option</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Name</p>\n</td>\n<td>\n<p>In standard configuration, the header sections of all tables and charts of the report will show the respective base. In this field, you can change the default label.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Condition editor</p>\n</td>\n<td>\n<p>The condition editor is familiar with the questionnaire editor. The condition will be applied to the entire report or - in the case of filters - to the respective report section.</p>\n<p>Please note that<em> EFS Reporting+</em> does not support all operators that are available in the questionnaire editor.</p>\n<ul>\n<li>\n<p>The following operators are available: equal, greater, greater equal, less equal, less, unequal, contains, and matches regex.</p>\n</li>\n<li>\n<p>The following operators are not available: contains any, in, in, or below, in the branch.</p>\n</li>\n</ul>\n<p>If a questionnaire filter contains one of these unsupported operators, the condition will be blank after transfer into <em>EFS Reporting+</em>.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Only in the report filter: Use test data in the workpad</p>\n</td>\n<td>\n<p>In order to speed up the work process, you may optionally display predefined test data in the workplace instead of the actual live data.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Anonymity limit</p>\n</td>\n<td>\n<p>Optionally, you can define an anonymity limit for the entire report or - in the case of filters - for a specific report section.</p>\n<ul>\n<li>\n<p>By default, the drag-and-drop list is preset at “0”, i.e., all results will be displayed.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Disposition codes</p>\n</td>\n<td>\n<p>The base can be limited via the disposition code.</p>\n<ul>\n<li>\n<p>Usually, only data from participants who completed the questionnaire are used. Therefore, only the disposition codes 31 and 32 are activated.</p>\n</li>\n<li>\n<p>To display rarely used disposition codes as e.g. 15 = not available, use the more icon.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Date of participation</p>\n</td>\n<td>\n<p>The base can be limited to participants who participated within a particular period.</p>\n<p>The feature can be used to restrict the base for the complete report as well.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"using-test-data-instead-of-live-data\" class=\"wysiwyg-text-align-justify\"><strong>Using Test Data Instead of Live Data</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Optionally, you can have predefined test data displayed instead of the real result data when working in the workpad. This means:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>For all values in the tables and charts, predefined default values will be displayed. Total and base will likewise only be the sums of those predefined test data.</p>\n</li>\n<li>\n<p>The test data are totally unrelated to the test and result data of the survey. Data<br>from tester accounts are generally ignored in <em>EFS Reporting+</em>.</p>\n</li>\n<li>\n<p>The preview always contains predefined test data.</p>\n</li>\n<li>\n<p>As soon as you generate an export file, the system will automatically refer to the real result data, perform live calculations, and display real results.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Using test data will eliminate the resource-intensive calculations that take place whenever you open a table or a chart. Thus you can work more efficiently, especially in the following situations:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Preparing complex reports for large projects: With the resource-intensive live calculations eliminated, you can work faster - and you can still check the plausibility of your table configuration based on the test data.</p>\n</li>\n<li>\n<p>Preparing a report for a project with no data available yet: The test data provides orientation when configuring the report. Test data need not be generated manually anymore.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you wish to work with test data, tick the option “Use test data in the workpad” in the <strong>Report</strong> →<strong> Report filter</strong> menu.</p>\n<h3 id=\"anonymizing-results\" class=\"wysiwyg-text-align-justify\"><strong>Anonymizing Results</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Occasionally, there are survey situations where the number of answers to certain questions will become so small, due to filtering or quotation, as to compromise the respondents’ anonymity. Also, when using the evaluation functions of <em>EFS Reporting+</em>, such as filters or crossbreaks, it may allow for inferences to be made about particular participants or groups of participants. This can be avoided by setting an anonymity limit for your report. Anonymity limits are limit values stating the minimum number of answers required for a result to be displayed in the report. If the number of answers does not exceed this limit, the result will be hidden. This is necessary to ensure the participants’ anonymity.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Anonymity limits can be defined both for the entire report and for specific sections.</p>\n</li>\n<li>\n<p>The anonymity limits are applied to all question types available in <em>EFS Reporting+</em>, including open-ended questions.</p>\n</li>\n<li>\n<p>The anonymity limits refer to “Total” for single response lists and matrices. For multiple response lists, they refer to the number of participants who have selected the respective answer option.</p>\n</li>\n<li>\n<p>Anonymized data are marked:</p>\n<ul>\n<li>\n<p>You can tell anonymized tables and charts by the comment “*) Some values have been anonymized”.</p>\n</li>\n<li>\n<p>Columns containing anonymized values are marked with a *.</p>\n</li>\n<li>\n<p>In tables, anonymized values are replaced with a dash (-). In charts, “0” is displayed for the corresponding answer options.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>By default, no limit is preset, i.e., all results are displayed.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you wish to anonymize your reports or a section thereof, enter the desired value into the field “Anonymity limit” in the <strong>Report</strong> → <strong>Report filter</strong> menu or in the filter dialog.</p>\n<h3 id=\"effects-of-anonymization-in-detail\" class=\"wysiwyg-text-align-justify\"><strong>Effects of anonymization in detail</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The anonymity limits in EFS Reporting+ always refer to “Total” for single response lists and matrices. For multiple response lists, they refer to the number of participants who have selected the respective answer option. The use of filters allows for anonymity limits to be nested. Please note that anonymity limits at subordinate levels may only become increasingly restrictive.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Therefore, a filter will only raise the limit defined for the entire report.</p>\n</li>\n<li>\n<p>A filter located in another filter branch will likewise only raise the limit of the superordinated filter branch and the limit for the entire report.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Examples</strong></p>\n<p class=\"wysiwyg-text-align-justify\">While the anonymity limit for the entire report is set to “5”, it is set to “10” within a particular filter. →  Before and after the filter the anonymity limit is “5”. Within the filter branch, it is “10”.</p>\n<p class=\"wysiwyg-text-align-justify\">While the anonymity limit for the entire report is set to “10”, it is lowered to “5” within a particular filter. → For the entire report including the filter branch, the anonymity limit is “10”: You cannot override the limit for the entire report with a filter.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Anonymization of crossbreaks</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Contingency tables are anonymized as well. In the case of contingency tables with “Total” column, please note: Once a column has been anonymized, the “Total column” will be completely anonymized as well. This is necessary to prevent anybody from calculating the missing values on the basis of the remaining data and total values.</p>\n<h2 id=\"creating-contingency-tables\" class=\"wysiwyg-text-align-justify\"><strong>Creating contingency tables</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Contingency tables come into play when you want to examine whether and how the participants’ answers correlate with a certain attribute or a combination of attributes. In these tables, the participants’ answers are split up according to the attribute combinations to be examined, and listed side-by-side, thus allowing for their direct comparison.</p>\n<p class=\"wysiwyg-text-align-justify\">In the contingency table shown, the details regarding the use of maps are split up based on the respondents’ sex and preferred sports. Additionally, the right-hand column “Total” displays the marginal totals.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The split dimensions (table headers) do not have to be configured for each contingency table individually. Like filters, they are prepared in the sources window and then placed at the desired position in the report.</p>\n</li>\n<li>\n<p>The structure of split dimensions can be defined easily via drag-and-drop.</p>\n</li>\n<li>\n<p>Contingency tables can be up to three dimensions deep (i.e., a maximum of three variables can be nested within one split dimension) and contain a maximum of twenty five (25) columns.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The first of these 25 columns already contains the answer option. So you can only create 24 categories (or codes or dimensions).</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Please note that the choice of chart types available for contingency tables is limited to column charts.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">It is currently not possible to split open answers. Please use filters instead: they allow you to clearly arrange the texts in several tables.</p>\n<h3 id=\"overview-of-contingency-table-configuration\" class=\"wysiwyg-text-align-justify\"><strong>Overview of contingency table configuration</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">All the split dimensions required for the report are prepared in the sources window, similar to the filters.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The prepared split dimensions are placed at the appropriate positions in the report structure. Then you drag all those elements for which you want to create contingency tables into the corresponding split dimension, creating separate branches.</p>\n</li>\n</ul>\n<h3 id=\"defining-split-dimensions\" class=\"wysiwyg-text-align-justify\"><strong>Defining split dimensions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The exact structure of the table headers for the contingency tables is defined in a separate drag-and-drop editor. You open this editor by clicking on the <strong>Create split dimension</strong> icon, or by selecting an existing split dimension and then clicking on <strong>Edit</strong>.</p>\n<ul>\n<li class=\"wysiwyg-text-align-justify\">\n<p>Drag the variables used for splitting from the sources window onto the drawing board. All source data and recoding variables are available.</p>\n</li>\n<li class=\"wysiwyg-text-align-justify\">\n<p>Arrange the variables on the drawing board in the same order and hierarchy as you want them to appear in the table header. It is possible to nest up to three variables.</p>\n</li>\n<li class=\"wysiwyg-text-align-justify\">\n<p>Via the “Total” drop-down list you can add a “Total” column.</p>\n</li>\n<li class=\"wysiwyg-text-align-justify\">\n<p>Via the <strong>Compact mode</strong> and <strong>Detail mode</strong> tabs, you can change the view: In Compact mode, only the variables will be displayed. In detail mode, you can also see the answer options.</p>\n</li>\n<li class=\"wysiwyg-text-align-justify\">\n<p>If you want to change the order of the answer options for a variable, click on the <strong>Arrow</strong> icon. The opened dialog allows to rearrangement of the options, similar to the table editor.</p>\n</li>\n<li class=\"wysiwyg-text-align-justify\">\n<p>To change the labeling of a variable or an answer option, click on the respective element: the text will be opened in the input field above the drawing board.</p>\n</li>\n<li>\n<p class=\"wysiwyg-text-align-justify\">In the “Name” field of the header section, you can change the internal label of the split dimension.</p>\n</li>\n</ul>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRVM0QJXQXQJ8QXQJ8R6\">What is the maximum depth and number of columns for contingency tables?</h3>\n<p>Contingency tables can be up to three dimensions deep and contain a maximum of 25 columns, with the first column reserved for answer options.</p>\n<h3 id=\"h_01HGKSMPRVRQJXQXQJ8QXQJ8R7\">Can open answers be split in contingency tables?</h3>\n<p>No, it is currently not possible to split open answers in contingency tables. It is recommended to use filters instead to arrange the texts in several tables.</p>",
    "user_segment_ids": []
}