{
    "id": 20371126622482,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371126622482.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371126622482-Export",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:55:29Z",
    "updated_at": "2024-08-28T09:14:26Z",
    "name": "Export",
    "title": "Export",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T11:47:41Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information on exporting data from EFS Survey projects. It covers various export formats, options, and best practices for handling survey data.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on the export functionality in the EFS Survey, including different export types, data cleaning, quality correction, and tips for effective data management.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#detailed-description-of-result-master-and-address-data-export\">Detailed Description of Result, Master, and Address Data Export</a></li>\n<li><a href=\"#exporting-participant-and-status-codes\">Exporting Participant and Status Codes</a></li>\n<li><a href=\"#exporting-answers-to-open-questions-for-quantum\">Exporting Answers to Open Questions for Quantum</a></li>\n<li><a href=\"#special-functions-for-sas-export\">Special Functions for SAS Export</a></li>\n<li><a href=\"#special-functions-for-fixed-format-export\">Special Functions for Fixed Format Export</a></li>\n<li><a href=\"#what-do-the-exported-result-data-reveal\">What does the Exported Result Data Reveal?</a></li>\n<li><a href=\"#efs-survey-variables\">EFS Survey Variables</a></li>\n<li><a href=\"#defining-export-templates\">Defining Export Templates</a></li>\n<li><a href=\"#data-cleaning\">Data Cleaning</a></li>\n<li><a href=\"#quality-correction\">Quality Correction</a></li>\n<li><a href=\"#general-tips-and-tricks-on-exporting-data\">General Tips and Tricks on Exporting Data</a></li>\n</ul>\n<p> </p>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Projects </strong>module, various options for exporting project-related records can be found under the <strong>Export </strong>menu item of each project. If you export result data from a project with loops, you can check the status of your export job or download the complete file in the <strong>Export Tasks </strong>menu. In <em>EFS People</em> installations, the <strong>Export </strong>menu item in the <strong>People </strong>module allows you to additionally export people-specific data (e.g. master data or address data of panelists).</p>\n<p class=\"wysiwyg-text-align-justify\">Before exporting, you should consider exactly which data you need and which programs are to be used for further evaluation.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example: Exporting result data for evaluation in SPSS</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The example below illustrates the export of project result data. The following requirements should be met:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Only the results of closed-ended questions should be exported.</p>\n</li>\n<li>\n<p>Only survey data of respondents who have completed the survey should be exported.</p>\n</li>\n<li>\n<p>Further evaluation is conducted using SPSS.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>Start the export process under <strong>Projects</strong> → {<strong>Selected project</strong>} → <strong>Export </strong>by selecting the data type “Result data”, and confirm by clicking on <strong>Next</strong>.</p>\n</li>\n<li>\n<p>In the list which then appears for selecting the export template, format, and extensive fine-tuning adjustments, you can make the desired restrictions. In the “Export settings” area, choose “SPSS” as the file format and “Project, closed-ended questions only” as the export template. Leave the default settings for data compression (“No compression”) and language (“English (default)”) unchanged.</p>\n</li>\n<li>\n<p>Open the “Restrict export to disposition codes” section and deactiveate all disposition codes except 31 (Completed) and 32 (Completed after break) according to the requirement defined above.</p>\n</li>\n<li>\n<p>Then, click on the <strong>Export </strong>button and reconfirm the export by clicking on <strong>Copy file to local PC </strong>on the following page.</p>\n</li>\n<li>\n<p>The download will begin. A pop-up window will open, in which you can choose to either open or save the file. Click on the <strong>Save button</strong>.</p>\n</li>\n<li>\n<p>A further dialog window will open, in which you can choose the folder you wish to save the file to. You can also rename the file. Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Once the download has been completed you can close the window by clicking on <strong>Close window</strong>.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">On several large collective installations, which are used by a number of our customers, the export orders will not be processed immediately but queued and processed one after the other.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the <strong>Projects</strong> → {<strong>Selected projects</strong>} → <strong>Export</strong> → <strong>Export tasks </strong>menu, you can check the status of your export orders.</p>\n</li>\n<li>\n<p>After completion of the export, you will be notified automatically by e-mail. Clicking on the link contained in the notification mail will take you directly to the download page.</p>\n</li>\n</ul>\n<h2 id=\"detailed-description-of-result-master-and-address-data-export\" class=\"wysiwyg-text-align-justify\"><strong>Detailed Description of Result, Master, and Address Data Export</strong></h2>\n<h3 id=\"selecting-the-appropriate-file-format\" class=\"wysiwyg-text-align-justify\"><strong>Selecting the Appropriate File Format</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The following formats are available:</p>\n<table class=\"wysiwyg-text-align-justify\" style=\"height: 1946px;\" border=\"1\" width=\"759\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr style=\"height: 29px;\">\n<th style=\"width: 327.674px; height: 29px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Format</strong></p>\n</th>\n<th style=\"width: 424.028px; height: 29px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Properties</strong></p>\n</th>\n</tr>\n<tr style=\"height: 88px;\">\n<td style=\"width: 319.653px; height: 88px;\">\n<p>CSV</p>\n</td>\n<td style=\"width: 416.007px; height: 88px;\">\n<p>CSV (Character Separated Values) is an exchange format that is mainly used for exchanging data between different computer programs.</p>\n</td>\n</tr>\n<tr style=\"height: 410px;\">\n<td style=\"width: 319.653px; height: 410px;\">\n<p>XLS (MS Excel 2003)</p>\n<p>XLSX (MS Excel 2007)</p>\n</td>\n<td style=\"width: 416.007px; height: 410px;\">\n<p>The data can be directly exported to a file in the XLS or XLSX format used by <em>Microsoft Excel</em>. As a maximum of 256 columns can be inserted into an <em>Excel</em> worksheet, the exported data are automatically distributed on several worksheets, as necessary.</p>\n<p>Please note: If you allow only numerical entries in an open answer (e.g. by using corresponding plausibility checks or input formats), these details will be exported nevertheless as strings. For evaluation purposes it occasionally makes sense to format these answers as numbers instead, Excel does not automatically make this format though. Please proceed as follows:</p>\n<ul>\n<li>\n<p>In older versions of <em>Excel,</em> you mark the corresponding cells first. Then choose in the <strong>Format</strong> → <strong>Cells </strong>menu the option “number” on the <strong>Numbers </strong>tab and confirm with <strong>OK</strong>.</p>\n</li>\n<li>\n<p>In newer versions of <em>Excel,</em> the function for changing the cell format is hidden under the exclamation mark which you find beside the cells.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr style=\"height: 285px;\">\n<td style=\"width: 319.653px; height: 285px;\">\n<p>Triple-S</p>\n</td>\n<td style=\"width: 416.007px; height: 285px;\">\n<p>For exports in Triple-S, an XML description file and a record file are generated. These files are always output in compressed format, by default as a zip file, unless other specifications were made.</p>\n<p>Please note: As Triple-S only supports character set ISO-8859-1, Triple-S exports are always in character set ISO-8859-1 even if another character set has been specified. As a result, problems may arise if non-ASCII characters are used. Should this occur, export the closed-ended question results as a workaround with Triple-S and select another format for open-ended answers.</p>\n</td>\n</tr>\n<tr style=\"height: 154px;\">\n<td style=\"width: 319.653px; height: 154px;\">\n<p>topStud</p>\n</td>\n<td style=\"width: 416.007px; height: 154px;\">\n<p>This export format provides an interface to TopCom’s offline evaluation software TopStud.</p>\n<p>Please contact TopCom directly at <a href=\"http://www.topcom.de\">http://www.topcom.de</a> if you have any questions about the TopStud format and the export interface.</p>\n</td>\n</tr>\n<tr style=\"height: 60px;\">\n<td style=\"width: 319.653px; height: 60px;\">\n<p>XML</p>\n</td>\n<td style=\"width: 416.007px; height: 60px;\">\n<p>XML files can be converted into any other format, or displayed using self-written XSLT-style sheets.</p>\n</td>\n</tr>\n<tr style=\"height: 145px;\">\n<td style=\"width: 319.653px; height: 145px;\">\n<p>HTML</p>\n</td>\n<td style=\"width: 416.007px; height: 145px;\">\n<p>Address or result data exported as an HTML file have the advantage that they can be immediately opened and viewed in the browser. If you wish to forward survey data, this format has the advantage that it can be opened with an Internet browser without requiring a special program.</p>\n</td>\n</tr>\n<tr style=\"height: 31px;\">\n<td style=\"width: 319.653px; height: 31px;\">\n<p>SPSS</p>\n</td>\n<td style=\"width: 416.007px; height: 31px;\">\n<p>File format for the SPSS evaluation program.</p>\n</td>\n</tr>\n<tr style=\"height: 88px;\">\n<td style=\"width: 319.653px; height: 88px;\">\n<p>SPSS Portable file format</p>\n</td>\n<td style=\"width: 416.007px; height: 88px;\">\n<p>Files in this format can be opened by SPSS and other statistics programs, such as Statistica. You can use it if you are editing the exported files in a statistics program other than SPSS.</p>\n</td>\n</tr>\n<tr style=\"height: 31px;\">\n<td style=\"width: 319.653px; height: 31px;\">\n<p>SAS</p>\n</td>\n<td style=\"width: 416.007px; height: 31px;\">\n<p>File format for the SAS evaluation program.</p>\n</td>\n</tr>\n<tr style=\"height: 88px;\">\n<td style=\"width: 319.653px; height: 88px;\">\n<p>Fixed Format</p>\n</td>\n<td style=\"width: 416.007px; height: 88px;\">\n<p>In this format, the columns are separated by blank spaces. Fixed Format is employed, for example, if the Quantum program is being used for evaluation.</p>\n</td>\n</tr>\n<tr style=\"height: 537px;\">\n<td style=\"width: 319.653px; height: 537px;\">\n<p>Quantum</p>\n</td>\n<td style=\"width: 416.007px; height: 537px;\">\n<p>Data files for further evaluation in Quantum. The exported zip folder contains the actual result data and additionally the basic, tab, and axis files.</p>\n<p>To supplement this feature, the following optional settings are available:</p>\n<ul>\n<li>\n<p>You can optionally adjust column widths or have them automatically expanded.</p>\n</li>\n<li>\n<p>The sys missings in the Quantum axis file can optionally be output.</p>\n</li>\n<li>\n<p>The text values can in be output in the Quantum data.</p>\n</li>\n<li>\n<p>The Quantum table names are automatically generated from the internal variable names.</p>\n</li>\n</ul>\n<p>Please note: Quantum has limitations regarding the number of axes. If an exported file contains too many axes, you should edit them manually in Quantum.</p>\n<p>In the case of questions with multiple response lists, note the following: Quantum can only determine a name for the axis if the variable names for the items of a question begin with the same characters. (For example, Quantum can generate the name “f1” from the variable names “f1_1”, “f1_2” and “f1_3”).</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\">EFS can generate export files with up to 2 GB.</p>\n<p class=\"wysiwyg-text-align-justify\">Please take into consideration that, due to manufacturers’ specifications, some export formats are subject to certain restrictions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A maximum of 256 columns can be inserted into an MS Excel worksheet. If you open an exported CSV file in <em>Microsoft Excel</em>, all further columns will be cut off by <em>Microsoft Excel</em>. You can alternatively use the<em> Excel</em> export function integrated into <em>EFS Survey</em>, which automatically distributes the exported data on several worksheets.</p>\n</li>\n<li>\n<p>If an <em>Excel </em>file is opened on a computer running with <em>Windows 7</em> and <em>Excel 2007</em>, depending on the circumstances, a message may be displayed that notifies you that the file is corrupted. This problem is caused by an extension provided by a third-party supplier. Until further notice, please proceed as follows: Save the file locally. Then, open the saved file, allowing <em>Excel</em> to repair it. Finally, save the file again.</p>\n</li>\n<li>\n<p>SPSS export (based on PSPP) truncates string variables after 254 characters until EFS 10.0. Until EFS 10.0, it is therefore recommended that you export the answers separately to open-ended questions in another format (e.g. XLS, CSV) and use a different program for viewing the answers. From EFS 10.1 the new PSPP version 0.8.1 is used. Therefore, when exporting for <em>SPSS from version 14 onwards </em>it is now optionally possible to work without this restriction. To do so, deactivate the new option “Cut text field entries after 254 characters for SPSS export”. Please note that without restriction on the text length, the overall size of the export file can grow significantly, depending on the number of text fields in the questionnaire and the number of participants.</p>\n</li>\n<li>\n<p>SPSS will only transfer user-defined missing values for text variables if the variables’ field is no more than eight characters wide.</p>\n</li>\n<li>\n<p>SPSS and special features for SPSS evaluation do not support several question types, especially question type 911 and question type 912 (which is available only in the context of special programming).</p>\n</li>\n<li>\n<p>Both in <em>Microsoft Excel</em> as well as in SPSS, the file size is restricted by the amount of available RAM.</p>\n</li>\n<li>\n<p>Up to Excel 2000, the maximum size of a <em>Microsoft Excel </em>file is 64 MB. As of <em>Excel</em> 2002 the maximum file size is 128 MB.</p>\n</li>\n<li>\n<p>The size of editable files is also restricted by the amount of RAM available on the computer in use.</p>\n</li>\n<li>\n<p><em>Microsoft Excel</em> as well as OpenOffice are known to not correctly render or process very long cell contents.</p>\n</li>\n<li>\n<p>All columns in Fixed Format export files have at least the size of the missing defined for the data type (e. g. size of 3 for the missing value “-77”).</p>\n</li>\n<li>\n<p>When working with the English user interface of Microsoft Excel, errors may occur on opening the CSV files as columns may not be processed automatically. In this case, check <strong>Use commas instead of semicolons in CSV exports.</strong></p>\n</li>\n</ul>\n<h3 id=\"compressing-files\" class=\"wysiwyg-text-align-justify\"><strong>Compressing Files</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The following options are available for exporting a file in compressed format:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>No compression</p>\n</li>\n<li>\n<p>Zip format: commonly used format on <em>Windows</em> machines</p>\n</li>\n<li>\n<p>Tape archive (.tar.gz): commonly used format on UNIX machines. The default setting is “No compression”.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Compression is automatically performed for exports of result data in Triple-S format. If you have made no settings yourself, a zip file will be created.</p>\n<h3 id=\"selecting-an-export-template\" class=\"wysiwyg-text-align-justify\"><strong>Selecting an Export Template</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The following export templates are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Complete project: All project result data will be exported, including time variables, which provide information on survey processing time.</p>\n</li>\n<li>\n<p>Project without timestamps: All project result data will be exported, except time variables.</p>\n</li>\n<li>\n<p>Project, open-ended questions only: Only questions with “varchar” type open-ended text fields will be exported.</p>\n</li>\n<li>\n<p>Project, closed-ended questions only: Only closed-ended questions (“int” type) will be exported.</p>\n</li>\n<li>\n<p>In personalized projects:</p>\n<ul>\n<li>\n<p>Participant data for the current project: Only the address data of the participants assigned to the project will be exported.</p>\n</li>\n<li>\n<p>Only if you have the required additional access rights, you can access the combined participant data and result in data export.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For panel surveys in <em>EFS People</em> installations, you have the additional option of exporting Master data for project: Only the master data of the participants assigned to the project will be exported.</p>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Export templates </strong>menu (until EFS 10.3: <strong>Template editor</strong>), you can create and save your export templates. This is particularly recommendable if you frequently only export data for a selection of variables: Selective export saves you from having to repeatedly choose variables.</p>\n<h3 id=\"restricting-export-to-individual-panel-groups\" class=\"wysiwyg-text-align-justify\"><strong>Restricting Export to Individual Panel Groups</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">For panel surveys in <em>EFS People</em> installations, you have the additional option of either exporting data from the entire panel or restricting the export to individual panel groups by choosing the respective option from the drop-down list in the “Restrict export to” field.</p>\n<h3 id=\"selecting-the-language-and-charset\" class=\"wysiwyg-text-align-justify\"><strong>Selecting the Language and Charset</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">For multilingual projects, you can choose the language in which questionnaire texts are to be exported in the “Language” field. This setting <em>only </em>affects the language of text elements (e.g. questions texts, answer options) that are included in the SPSS export as labels and does not affect exported survey data.</p>\n<p class=\"wysiwyg-text-align-justify\">Set the character set of the exported data record in the field “Character set”. This setting affects the <em>entire export data record</em>, i.e. for both the questionnaire texts and any existing open-ended questions.</p>\n<h3 id=\"user-defined-missing-values-in-exported-data\" class=\"wysiwyg-text-align-justify\"><strong>User-Defined Missing Values in Exported Data</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can define missing values for strings, numbers, calendar data, and timestamps for further processing in SPSS. Here, the following applies:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>SPSS accepts user-defined missing values for calendar data and timestamps.</p>\n</li>\n<li>\n<p>Missing values for number fields can be numeric or empty. However, SPSS only accepts numeric values.</p>\n</li>\n<li>\n<p>In the case of numeric values, SPSS accepts a maximum of three variables per field. Missing values defined in the questionnaire editor are included in the process.</p>\n</li>\n<li>\n<p>SPSS does not accept user-defined missing values for string variables.</p>\n</li>\n<li>\n<p>For text fields, different missing values can be entered, depending on whether the fields were not seen (default value: –66) or were seen, but not edited (-99).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You should ensure that no values defined elsewhere in the questionnaire as characteristics for alternative answers are used as missing values.</p>\n<h3 id=\"removing-line-breaks\" class=\"wysiwyg-text-align-justify\"><strong>Removing Line Breaks</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Excel and OpenOffice are not able to process and display CSV files containing line breaks properly. If you activate the field “Remove line breaks in values from export file” the line breaks will be removed.</p>\n<p class=\"wysiwyg-text-align-justify\">In EFS 8.2 and more recent versions, this feature does not exist anymore, because from EFS 8.2 onwards, export data do not contain line breaks anymore in principle.</p>\n<h3 id=\"replacing-codes-with-labels-in-excel-files\" class=\"wysiwyg-text-align-justify\"><strong>Replacing Codes with Labels in Excel Files</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you export result data in XLS or XLSX format (MS Excel), you have the option of replacing numeric codes with labels. To do so, navigate to the “Advanced options” section of the export dialog, and tick the checkbox labeled “Replace numeric codes with their labels”.</p>\n<h3 id=\"exporting-open-answers-completely-for-new-spss-versions\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Open Answers Completely for New SPSS Versions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Until EFS 10.0, SPSS export (based on PSPP) truncated string variables after 254 characters. Until EFS 10.0, it is therefore recommended that you export the answers separately to open-ended questions in another format (e.g. XLS, CSV) and use a different program for viewing the answers.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>From EFS 10.1, when exporting for SPSS from version 14 onwards, it is optionally possible to work without this restriction. To do so, deactivate the new option “Cut text field entries after 254 characters for SPSS export”. Please note that without restriction on the text length, the overall size of the export file can grow significantly, depending on the number of text fields in the questionnaire and the number of participants.</p>\n</li>\n<li>\n<p>For SPSS versions below 14, the text length restriction must be used to ensure downward compatibility.</p>\n</li>\n</ul>\n<h3 id=\"restricting-the-range-of-exported-data\" class=\"wysiwyg-text-align-justify\"><strong>Restricting the Range of Exported Data</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><strong>Restricting the range of data to a specific period</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can restrict the range of data collected during a certain period by making the respective selection in the “Last change from/until” fields.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Restricting the range of data using consecutive participant numbering</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By making a respective entry in the “Lowest / Highest consecutive number” fields, you can restrict the range to survey data of a specific block of respondents who have successively completed the questionnaire.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Restricting the range of data to certain disposition codes</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you are authorized to access disposition codes (read right for <em>show_dispcode</em>), you can restrict the export to survey data of respondents with a certain disposition code.</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, untick all disposition checkboxes in the “Restrict export to disposition codes” field, for which no survey data are to be exported.</p>\n<p class=\"wysiwyg-text-align-justify\">Available are the disposition codes greater than/equal to 20. No result data exist for disposition codes &lt; 20, therefore a result data export for such codes is not advisable. By default, the data of all participants with disposition codes between 21 and 42 will be exported.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting protected questions</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If your project contains questions that are marked as “protected” and you have read rights for <em>protect_questions</em>, you can choose between various options when exporting result data:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Export all questions</p>\n</li>\n<li>\n<p>Export “protected” questions only</p>\n</li>\n<li>\n<p>Export “unprotected” questions only</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Restricting to participant groups</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In personalized projects, you can limit the export to specific participant groups, defined by the characteristics of the participant variable <em>u_group</em>.</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, when exporting result data, select the appropriate group in the “Restrict to participant groups” field of the “Restrict range of exported data” section.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Selective export</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you have ticked the checkbox for the “Selective export (Please click here, if you want to specify which variable shall be exported)” field, you have the option of performing a <em>selective export</em>, i.e. you can choose from the range of available variables.</p>\n<p class=\"wysiwyg-text-align-justify\">Once you have confirmed the selection by clicking on the <strong>Export </strong>button, the list of possible variables will be displayed and you can choose those desired.</p>\n<h3 id=\"excel-export-with-external-variable-names-and-meta-information\" class=\"wysiwyg-text-align-justify\"><strong>Excel Export with External Variable Names and Meta Information</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you export result data in XLS or XLSX format (MS Excel), you have the option of adding meta information. In this case, additional columns with the following information will be inserted in the export file header:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>1. Line: Question text</p>\n</li>\n<li>\n<p>2. Line: Plain text description of the variable. Depending on the question type, this is In the case of questions with multiple response lists, the respective answer option is specified.</p>\n</li>\n<li>\n<p>3. Line: external variable name If you want to use this option, tick the checkbox “Display meta information as additional column heading (excel export only)” in the “Advanced options” section.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">This feature supports only the default language.</p>\n<h2 id=\"exporting-participant-and-status-codes\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Participant and Status Codes</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The export type “Participant and status codes”, which is available for personalized projects, enables you to determine the disposition code and last access for each survey participant.</p>\n<p class=\"wysiwyg-text-align-justify\">The export file contains the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Participant code: The code used to access the survey.</p>\n</li>\n<li>\n<p>Disposition code: The selected disposition codes.</p>\n</li>\n<li>\n<p>“Tester” variable: Does the participant have tester status?</p>\n</li>\n<li>\n<p>Only with access right for combined participant data and result data export: Last accessed: Date and time of when the survey was last accessed.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The exported data record contains only the participant codes but does not contain respondent-specific information or result data. This will guarantee the participants’ anonymity if, for example, you pass this data record on to the customer who commissioned the project.</p>\n<h2 id=\"exporting-answers-to-open-questions-for-quantum\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Answers to Open Questions for Quantum</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Some evaluation programs, such as Quantum, place special demands on export records for open-ended questions: Answers should not only be separated from the answers to closed-ended questions, but their display should also be different. Whereas in the case of normal export records, consecutive numbers and result variables of a respondent are displayed side by side in the columns of a single row, the individual<em> </em>answers of a respondent should be displayed in <em>rows one above the other</em>.</p>\n<p class=\"wysiwyg-text-align-justify\">The “Data (open-end answers only; optimized for column display in Quantum)” data type is available under <strong>Projects</strong> → {<strong>Selected project</strong>} → <strong>Export</strong>, and can be used to create such a record. When downloading, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>Select the “Data (open-ended answers only; formats e.g. SPSS, CSV, Fixed Format, Quantum, MS Excel...)” data type.</p>\n</li>\n<li>\n<p>After that, you can choose the format and make further settings as usual.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Export</strong>, and download the file as usual.</p>\n</li>\n<li>\n<p>Then open the record in the appropriate evaluation program. The exported record contains three columns:</p>\n<ul>\n<li>\n<p>fun: the respondent’s consecutive number</p>\n</li>\n<li>\n<p>var name: the variable of the open text field</p>\n</li>\n<li>\n<p>value: the entry made by the respondent</p>\n</li>\n</ul>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21013850458898\" alt=\"2ce21d9c-0d20-46aa-967b-ace631e99883\"></p>\n<p class=\"wysiwyg-text-align-justify\">The above figure shows an example of a record exported in CSV format and opened in Excel.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note that the consecutive number is displayed right-aligned. Depending on the program used to open the record, the consecutive number will be positioned right next to the variable name.</p>\n<h2 id=\"special-functions-for-sas-export\" class=\"wysiwyg-text-align-justify\"><strong>Special Functions for SAS Export</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The SAS export generates an SPSS Portable file, a text file with labels, and a macro that can be executed in SAS. The macro can be used to label the SPSS Portable file and convert it into an SAS data table.</p>\n<p class=\"wysiwyg-text-align-justify\">You only need SAS to edit the export files, SPSS is not required.</p>\n<h3 id=\"notes-on-sas\" class=\"wysiwyg-text-align-justify\"><strong>Notes on SAS</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Since the SAS export is performed using an SPSS Portable file, it is subject to the technical default settings and restrictions of SPSS.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Character set</strong></p>\n<p class=\"wysiwyg-text-align-justify\">From EFS 8.2, the SPSS export supports UTF-8 and all other character sets that can be selected in EFS, with the single exception of UTF-16.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Missings</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The default settings for missing values are interpreted as follows during SAS export:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>“-77” is defined as a missing in both SPSS and SAS. Therefore, it is represented with a period (“.”) in SAS.</p>\n</li>\n<li>\n<p>“-66”, “-99” and “0” are not defined as missings in SAS. Accordingly, they are interpreted and displayed as number values.</p>\n</li>\n</ul>\n<h3 id=\"making-default-settings-for-the-further-processing-of-the-sas-files\" class=\"wysiwyg-text-align-justify\"><strong>Making Default Settings for the Further Processing of the SAS Files</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To apply the macro to the other files without any further configuration after the SAS export, you must make the following default settings in the <strong>Options</strong> → <strong>Personal preferences </strong>menu on the <strong>Common settings </strong>tab before exporting the data:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Standard directory for SAS exports on your computer: This directory path is copied into the SAS macro generated by the EFS Survey. Therefore, the compressed file must be located in this directory for you to apply the macro to it successfully. Default setting: c:\\Documents and Settings\\user name\\Desktop\\</p>\n</li>\n<li>\n<p>SAS library in which the SAS macro generated by EFS Survey is to store the converted data: The SAS macro will store the data temporarily in this library. You can access and then save the data from there. Default setting: work. export, where “work” is the name of the library and “export” is the user-defined name of the file.</p>\n</li>\n</ul>\n<h3 id=\"exporting-and-opening-sas-files\" class=\"wysiwyg-text-align-justify\"><strong>Exporting and Opening SAS Files</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>In the <strong>Export </strong>menu, set the desired export options as usual, including the desired file compression (zip or tar). Also, please observe the above note on selecting the character set. After that, initiate the export process.</p>\n</li>\n<li>\n<p>Save the compressed file locally in the directory that you chose under <strong>Options</strong> → <strong>Personal preferences</strong>.</p>\n</li>\n<li>\n<p>Open the compressed file. It contains the three files export.por (SPSS Portable file containing the data), export.txt (text file with labels), and macro.sas (Macro).</p>\n</li>\n<li>\n<p>Open the macro by double-clicking it.</p>\n</li>\n<li>\n<p>To execute the macro, click on the <strong>Execute </strong>icon.</p>\n</li>\n<li>\n<p>The data table will now automatically be stored in the library you specified under <strong>Personal preferences</strong>.</p>\n</li>\n<li>\n<p>Navigate to the library and open the file.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">If the macro is not executed correctly, check whether the right directory path has been set in the macro and whether the export files are located in the right directory</p>\n<h2 id=\"special-functions-for-fixed-format-export\" class=\"wysiwyg-text-align-justify\"><strong>Special Functions for Fixed Format Export</strong></h2>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adjusting Column Widths</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The export dialog (<strong>Projects</strong> → {<strong>Selected project</strong>} → <strong>Export</strong> → {<strong>Selected data type</strong>}) provides two special options in the “Export settings“ area specifically for Fixed Format export, which particularly facilitate further processing of the data in Quantum:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Adjust column widths to effective size of data: The columns are made as narrow as possible.</p>\n</li>\n<li>\n<p>Automatically adjust column widths if missing values are longer than column widths defined in the export template: The export dialog allows you to define missing values yourself or use the default values (-77, -66, 0). If these missing values require more digits than provided for in the respective column, ticking this checkbox will widen the column. If the checkbox is not ticked, the value “-77” will be exported only as “-“, for example.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you tick the new special checkbox “Show field positions in export template” in the codebook and select the suitable export template, the codebook will show the width, beginning, and end of the columns.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Downloading the Export Template</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Another option that was set up specifically for Fixed Format export allows you to download the export template, including the information on the column width you configured yourself, as a CSV file.</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, you must first perform export selection as usual. The dialog shown in the figure, in which you can finally download the file, also contains a green bar displaying the <strong>here </strong>link you can click on to download the CSV file.</p>\n<p class=\"wysiwyg-text-align-justify\">If, for a Fixed Format export, you additionally choose to compress the data into a zip file, this zip file will automatically also contain the export template in CSV format.</p>\n<h3 id=\"excursion-merging-records-in-spss-matching\" class=\"wysiwyg-text-align-justify\"><strong>Excursion: Merging Records in SPSS (Matching)</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Under certain conditions, various system files can be merged to create one system file. There are two possible ways of merging:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Merging cases where variables are identical or almost identical (Add Files).</p>\n</li>\n<li>\n<p>Merging variables where cases are identical or almost identical (Match Files).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For the 'add files' command, cases are added from one or more records to an existing record (vertical conjunction). For identical variables, syntax in SPSS is as follows:</p>\n\n<p class=\"wysiwyg-text-align-justify\">For the 'match file' command, several records can be merged using a key variable (horizontal conjunction).</p>\n<p class=\"wysiwyg-text-align-justify\">The prerequisites for successful matching are:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>All files must contain the same number of cases.</p>\n</li>\n<li>\n<p>All files must contain a key variable with an identification number (e.g. lfdn).</p>\n</li>\n<li>\n<p>Each case must be assigned to a different identification number.</p>\n</li>\n<li>\n<p>A certain case must always have the same number in different files.</p>\n</li>\n<li>\n<p>All files must be sorted by identification number.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In this case, the consecutive number 'Lfdn' is chosen as a key variable, and the records must be sorted by this variable. For an identical number of cases, syntax in SPSS is as follows:</p>\n\n<p class=\"wysiwyg-text-align-justify\">Should problems occur when matching two EFS Survey data files in SPSS format, save the records in POR format (Portable Document) and repeat matching.</p>\n<h2 id=\"what-do-the-exported-result-data-reveal\" class=\"wysiwyg-text-align-justify\"><strong>What do the Exported Result Data Reveal?</strong></h2>\n<h3 id=\"overview-of-variables\" class=\"wysiwyg-text-align-justify\"><strong>Overview of Variables</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Depending on project, project properties, choice of export options and authorization of the user who executes the export, the result data record may contain the following variables:</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 194.0px;\"> <col style=\"width: 182.0px;\"> <col style=\"width: 163.0px;\"> <col style=\"width: 221.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Internal variable name</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>External variable name</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Description</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>lfdn</p>\n</td>\n<td>\n<p>lfdn</p>\n</td>\n<td>\n<p>number</p>\n</td>\n<td>\n<p>Every participant in the questionnaire will be assigned a consecutive number.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>external_lfdn</p>\n</td>\n<td>\n<p>external_lfdn</p>\n</td>\n<td>\n<p>external lfdn</p>\n</td>\n<td>\n<p>If an external survey start is used, external_lfdn is used in the secondary project to store the participants’ ldfn from the primary project. You can download a dedicated documentation for external survey starting in the customer center.</p>\n<p>If several surveys are linked by external survey start, the variable <em>external_lfdn</em> will contain the lfdn of the primary project in all following surveys.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>tester</p>\n</td>\n<td>\n<p>tester</p>\n</td>\n<td>\n<p>tester</p>\n</td>\n<td>\n<p>Indicates whether the participant in question is a tester (not for anonymous projects), “1” being for a tester and “0” for a normal participant.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>status</p>\n</td>\n<td>\n<p>disco de</p>\n</td>\n<td>\n<p>disposition code</p>\n</td>\n<td>\n<p>The participants’ disposition code. Please mind that the disposition code is only part of the export file if the exporting user has read rights for <em>show_dispcode</em>.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>last_page</p>\n</td>\n<td>\n<p>lastpage</p>\n</td>\n<td>\n<p>last page</p>\n</td>\n<td>\n<p>Indicates the last page sent by the server. I.e. if participants dropped out of a survey, this is usually the last page presented to them.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>quality</p>\n</td>\n<td>\n<p>quality</p>\n</td>\n<td>\n<p>quality</p>\n</td>\n<td>\n<p>The respondents’ quality index.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>time_to_complete_survey</p>\n</td>\n<td>\n<p>duration</p>\n</td>\n<td>\n<p>time to complete the survey</p>\n</td>\n<td>\n<p>The duration of survey completion (in seconds), i.e. the time elapsed between the respondent’s first and last accessing of the questionnaire.</p>\n<p>The duration is computed as follows: A record is made of when the respondent first and last accessed the survey. These values can be found in the export record as the variables datetime (SPSS label: datetime of survey start) and lastaccs (SPSS label: date of last access). The difference of these two values is the time the participant took to complete the survey (duration = lastaccs - datetime).</p>\n<p>If a respondent resumes the questionnaire after a break (disposition codes 23, 32), the duration is = “-1” because a meaningful calculation is not possible.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>p_000n</p>\n</td>\n<td>\n<p>p_000n</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>URL parameter</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>c_000n</p>\n</td>\n<td>\n<p>c_000n</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>User-defined variables</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>v_000n</p>\n</td>\n<td>\n<p>v_000n</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Project variables. The project variables are sequentially numbered for each project, beginning with v_1.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>md_000n</p>\n<p>(Only in EFS Panel installations)</p>\n</td>\n<td>\n<p>md_000n</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Master data variables.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>remote_host</p>\n</td>\n<td>\n<p>ext_host</p>\n</td>\n<td>\n<p>external host</p>\n</td>\n<td>\n<p>Indicates the domain of the computer via which the participant is connected to the Internet if it has a domain.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>remote_addr</p>\n</td>\n<td>\n<p>ip_addr</p>\n</td>\n<td>\n<p>remote address</p>\n</td>\n<td>\n<p>Indicates the IP address of the computer via which the participant is connected to the Internet.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>user_agent</p>\n</td>\n<td>\n<p>browser</p>\n</td>\n<td>\n<p>browser-id</p>\n</td>\n<td>\n<p>Indicates the name of the browser in the form in which it was transferred to the EFS server. Examples can be found at http:// <a href=\"http://de.wikipedia.org/wiki/User_Agent\">de.wikipedia.org/wiki/User_Agent</a>.</p>\n<p>When filtering is done via browser types, it is advisable to use the “matches regex” condition, which is also new.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>http_referer</p>\n</td>\n<td>\n<p>referer</p>\n</td>\n<td>\n<p>http-referer</p>\n</td>\n<td>\n<p>Indicates the Internet page from which the survey was invoked.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>device_type</p>\n<p>(From EFS 10.0 in “Responsive Layout” projects)</p>\n</td>\n<td>\n<p>device_type</p>\n</td>\n<td>\n<p>device type</p>\n</td>\n<td>\n<p>Contains the result of the check for device type, which can optionally be performed at the beginning of the survey:</p>\n<p>Activated</p>\n<ul>\n<li>\n<p>0 = Desktop</p>\n</li>\n<li>\n<p>1 = mobile</p>\n</li>\n</ul>\n<p>Not activated: 0</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_browser</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_browser</p>\n</td>\n<td>\n<p>participant browser</p>\n</td>\n<td>\n<p>States the browser used by the participant, e. g. Internet Explorer</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_browser_version</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_browser_version</p>\n</td>\n<td>\n<p>participant browser version</p>\n</td>\n<td>\n<p>States the participant‘s browser version, e. g. 9.0</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_os</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_os</p>\n</td>\n<td>\n<p>participant operating system</p>\n</td>\n<td>\n<p>states the participant‘s computer‘s operating system, e.g. Windows.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_device</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_device</p>\n</td>\n<td>\n<p>participant device</p>\n</td>\n<td>\n<p>contains the result of the device type check (optional, may be performed at the start of the survey), e.g. smartphone. Refer directly to the software‘s user interface for a list of all identifiable devices.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_brand</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_brand</p>\n</td>\n<td>\n<p>participant brand</p>\n</td>\n<td>\n<p>states the brand of device used, e. g. Apple.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_model</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_model</p>\n</td>\n<td>\n<p>participant model</p>\n</td>\n<td>\n<p>stathe tes model of the device used, e. g. iPhone 6.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_isbot</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_isbot</p>\n</td>\n<td>\n<p>participant is (ro)bot</p>\n</td>\n<td>\n<p>states whether the participant is a robot or a crawler. Regular participants are assigned the value 0.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_continent</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_continent</p>\n</td>\n<td>\n<p>participant continent</p>\n</td>\n<td>\n<p>states the participant‘s current location (continent), e. g. Europe</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_country</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_country</p>\n</td>\n<td>\n<p>participant country</p>\n</td>\n<td>\n<p>states the participant‘s current location (country, e.g. Great Britain</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_region</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_region</p>\n</td>\n<td>\n<p>participant region</p>\n</td>\n<td>\n<p>states the participant‘s current location (region), e.g. Lancashire</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>participant_city</p>\n<p>(For EFS 10.7 and later versions)</p>\n</td>\n<td>\n<p>participant_city</p>\n</td>\n<td>\n<p>participant city</p>\n</td>\n<td>\n<p>states the participant‘s current location (city), e. g. Lancaster</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>quota</p>\n</td>\n<td>\n<p>quota</p>\n</td>\n<td>\n<p>quota</p>\n</td>\n<td>\n<p>Contains the ID of the allocated quota (i.e. the quota selected via allocation mode).</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>quota_assignment</p>\n</td>\n<td>\n<p>quota_assignment</p>\n</td>\n<td>\n<p>quota_assignment</p>\n</td>\n<td>\n<p>Contains the IDs of all quotas in which the respective participant has been counted.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>page_history</p>\n</td>\n<td>\n<p>page_history</p>\n</td>\n<td>\n<p>page history</p>\n</td>\n<td>\n<p>Indicates the sequence of invoked pages. The page ID (pgid) displayed in the questionnaire editor beside the individual pages is used.</p>\n<p>The current state of questionnaire processing is minutely recorded in the page history, i.e. the variable <em>page_history</em> will show you the movements of the participants within the questionnaire up to the last viewed page.</p>\n<p>Please note: If a real Back button is activated in the form, and a participant leaves a page using this Back button, this page will be removed from page history.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>hflip</p>\n</td>\n<td>\n<p>hflip</p>\n</td>\n<td>\n<p>hflip</p>\n</td>\n<td>\n<p>Variable for horizontal flipping:</p>\n<ul>\n<li>\n<p>0 = not flipped</p>\n</li>\n<li>\n<p>1 = flipped</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>vflip</p>\n</td>\n<td>\n<p>vflip</p>\n</td>\n<td>\n<p>vflip</p>\n</td>\n<td>\n<p>Variable for vertical flipping:</p>\n<ul>\n<li>\n<p>0 = not flipped</p>\n</li>\n<li>\n<p>1 = flipped</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>javascript</p>\n</td>\n<td>\n<p>javascript</p>\n</td>\n<td>\n<p>jscript</p>\n</td>\n<td>\n<p>Contains the result of the check for JavaScript, which can optionally be performed at the beginning of the survey:</p>\n<ul>\n<li>\n<p>0 = JavaScript switched off</p>\n</li>\n<li>\n<p>Other = Version number (e.g. jscript = “10” for JavaScript 1.0, jscript = “15” for JavaScript 1.5)</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>flash</p>\n</td>\n<td>\n<p>flash</p>\n</td>\n<td>\n<p>flash</p>\n</td>\n<td>\n<p>Contains the result of the check for the Adobe Flash plugin, which can optionally be performed at the beginning of the survey and is required for the Flash question types:</p>\n<ul>\n<li>\n<p>0 = Flash plugin, not available</p>\n</li>\n<li>\n<p>Other=Versionnumber(e.g.flash=“800”forFlashplugin8.0, flash = “900” for Flash plugin 9.0)</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>seesion_id</p>\n</td>\n<td>\n<p>session_id</p>\n</td>\n<td>\n<p>session id</p>\n</td>\n<td>\n<p>Indicates the session ID the participant received during the survey.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>language</p>\n</td>\n<td>\n<p>language</p>\n</td>\n<td>\n<p>language</p>\n</td>\n<td>\n<p>The language in which the respondent has seen the questionnaire.</p>\n<p>The numbers correspond to the language ID (identification number) of the languages used in the project.</p>\n<p>With the wildcard #language# you can display the language ID in the questionnaire or templates. This is particularly important for language-dependent layouts and special programming.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>datacleaning</p>\n</td>\n<td>\n<p>cleaned</p>\n</td>\n<td>\n<p>datacleaning</p>\n</td>\n<td>\n<p>Indicates if the individual record has been cleaned:</p>\n<ul>\n<li>\n<p>0= uncleaned data records and records of incomplete interviews which are excluded from the cleaning process</p>\n</li>\n<li>\n<p>1 = cleaned</p>\n</li>\n<li>\n<p>2 = checked but did not require cleaning</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>dt_begin</p>\n</td>\n<td>\n<p>ats</p>\n</td>\n<td>\n<p>absolute timestamp</p>\n</td>\n<td>\n<p>Indicates the time in seconds elapsed since 01/01/1970 until the request of the first page of the questionnaire).</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>dt_begin</p>\n</td>\n<td>\n<p>datetime</p>\n</td>\n<td>\n<p>datetime of survey start</p>\n</td>\n<td>\n<p>Date and time of survey start, i.e. the invoking of the first page of the questionnaire.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>date_of_last_access</p>\n</td>\n<td>\n<p>date_of_last_access</p>\n</td>\n<td>\n<p>date of last access</p>\n</td>\n<td>\n<p>Date and time of the last access to the survey.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>date_of_first_mail</p>\n</td>\n<td>\n<p>date_of_first_mail</p>\n</td>\n<td>\n<p>date of first mail</p>\n</td>\n<td>\n<p>Date and time of the first invitation mail sent to the participant. The variable is used for all project types which include invitation processes, i.e. personalized projects, panel surveys, and master data surveys. In anonymous projects, it is not filled.</p>\n<p>Please mind: <em>date_of_first_access</em> is updated upon resumption.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>sid</p>\n</td>\n<td>\n<p>sample_id</p>\n</td>\n<td>\n<p>sid</p>\n</td>\n<td>\n<p>Only in panel and master data surveys : ID of the sample that the panelists belong in.</p>\n<p>For the SPSS export, the codes are labeled with the sample titles.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>dt_send_pag_000n</p>\n</td>\n<td>\n<p>rts_000n</p>\n<p>For pgid &gt; 99999: ts_000n</p>\n</td>\n<td>\n<p>relative timestamp for page xxxx</p>\n</td>\n<td>\n<p>Time variables of standard pages and mixed-external pages. These indicate the time in seconds elapsed from the ats until submission of the respective page.</p>\n<p>If the PGID (page ID = installation-specific ID of a questionnaire page or a dynamic element) is bigger than 99.999, the name of the variable is changed to ts_xxx, to prevent problems caused by the length of the variable name when exporting for SPSS.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>rnd_pg_PGID</p>\n</td>\n<td>\n<p>rnd_pg_PGID</p>\n</td>\n<td>\n<p>random page selection order</p>\n</td>\n<td>\n<p>Random selection.</p>\n<p>For each random selection block in the questionnaire, a variable rndPGID is created. PGID is the ID of the random selection element.</p>\n<p>In this variable, the PGIDs of the selected pages are stored, separated by commas.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>rnd_pg_PGID_x</p>\n</td>\n<td>\n<p>rnd_pg_PGID_x</p>\n</td>\n<td>\n<p>random rotation selection order</p>\n</td>\n<td>\n<p>Random order.</p>\n<p>For each random order block in the questionnaire, variables <em>rnd_pg_PGID_NR</em> are created. PGID is the ID of the random order element, NR is the number of randomized subpages.</p>\n<p>Each of these variables contains the PGID of that subpage which has been placed on the respective position in the current cycle.</p>\n<p>Example: The PGID of the random order element is 123, and the sub-pages have PGID 124, 125, and 126. In the questionnaire, they are displayed to a participant in the following order: 126, 124, 125. Then, you will find the following data in the export file: r123_1 = 126, r123_2 = 124, r123_3 = 125</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>tic</p>\n</td>\n<td>\n<p>tic</p>\n</td>\n<td>\n<p>survey ticket id</p>\n</td>\n<td>\n<p>tic variable used in external survey start. The tic variable is always 32 characters long. This cannot be configured.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>s_000n</p>\n<p>(From EFS 10.5)</p>\n</td>\n<td>\n<p>s_000n</p>\n</td>\n<td>\n<p>s_000n</p>\n</td>\n<td>\n<p>Scoring variables.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"overview-of-variable-preallocations\" class=\"wysiwyg-text-align-justify\"><strong>Overview of Variable Preallocations</strong></h3>\n<table class=\"wysiwyg-text-align-justify\" style=\"height: 519px;\" border=\"1\" width=\"777\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 231.562px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Preallocation value</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 538.142px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td style=\"width: 223.542px;\">\n<p>-77</p>\n</td>\n<td style=\"width: 530.122px;\">\n<ul>\n<li>\n<p>Project variables of the v_000 type, with the exception of variables that refer to text fields: The participant did not see the question, for example, because they dropped out or because the relevant page or question was not displayed due to routing.</p>\n</li>\n<li>\n<p>Master data for EFS People installations: Preallocation for master data of the md_xxx and m_xxx type.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 223.542px;\">\n<p>0</p>\n</td>\n<td style=\"width: 530.122px;\">\n<ul>\n<li>\n<p>Project variables of the v_000 type, with the exception of variables that refer to text fields: The participant saw the respective question, but did not respond to it.</p>\n</li>\n<li>\n<p>Participant administration variables of the “text field” type: Preallocation if the variable was not filled.</p>\n</li>\n<li>\n<p>Participantadministrationvariablesofthe“selectbox”type:Preallocationof those variables that are available per default and set to “Please select”. For example, the standard variables <em>u_gender</em>, <em>u_language</em> and <em>u_group</em>.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 223.542px;\">\n<p>-66</p>\n</td>\n<td style=\"width: 530.122px;\">\n<ul>\n<li>\n<p>Project variables of the v_000 type that refer to text fields: The participant did not see the respective question, because it was hidden.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 223.542px;\">\n<p>-99</p>\n</td>\n<td style=\"width: 530.122px;\">\n<ul>\n<li>\n<p>Project variables of the v_000 type that refer to text fields: The participant saw the respective question, but did not respond to it.</p>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\">You can specify the missing values in the export data records yourself.</p>\n<h2 id=\"efs-survey-variables\" class=\"wysiwyg-text-align-justify\"><strong>EFS Survey Variables</strong></h2>\n<h3 id=\"overview-of-the-various-variable-types\" class=\"wysiwyg-text-align-justify\">Overview of the Various Variable Types</h3>\n<p class=\"wysiwyg-text-align-justify\">The locations in the database, in which answers given by the respondents, participant administration data or system information regarding the course of the survey are saved, are identified using variables. In defining routing, e.g. via a filter or when importing saved contents via wildcards you can access the database contents via these variables. A range of variable types are used in EFS surveys:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Project variables (v_000n): The results of the survey are saved in these variables. They are automatically created when new questions are created.</p>\n</li>\n<li>\n<p>URL parameters (p_000n): These variables allow you to pass variables to a survey from outside. They are created and configured manually.</p>\n</li>\n<li>\n<p>User-defined variables c_000n: These variables are used to store interim results. They are created and configured manually.</p>\n</li>\n<li>\n<p>Participant variables (u_000n): Information regarding survey participants is stored in these variables. A set of frequently used variables is available by default and additional variables may also be created.</p>\n</li>\n<li>\n<p>System variables: The variables are used to store meta-information regarding participants and the course of the interviewing process. System variables are automatically generated when a project is created.</p>\n</li>\n<li>\n<p>For <em>EFS People</em> installations only: Participant data of the panelists (u_000n). These variables are preset by the <em>EFS People</em> and are not configurable.</p>\n</li>\n<li>\n<p>For <em>EFS People</em> installations only: Master data (m_000n). Fundamental panelist properties determined by the panel administrator, which are stored independently of the specific project and which are permanently available.</p>\n</li>\n<li>\n<p>For <em>EFS People</em> installations only: Panel system data. The variables are used to store meta-information regarding the panelists.</p>\n</li>\n</ul>\n<h3 id=\"maximum-available-number-of-variables\" class=\"wysiwyg-text-align-justify\"><strong>Maximum Available Number of Variables</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Up to 7,000 variables are available per project.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This value is the sum of all<em> </em>variables in the project, not only the sum of the project variables.</p>\n</li>\n<li>\n<p>The maximum number of variables that are available in a <em>specific </em>project depends on various factors, such as e.g. type and size of the variables created, and may be lower than 7,000.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In an EFS People installation, up to at most 2,800 master data variables can be used.</p>\n<p class=\"wysiwyg-text-align-justify\">The complexity of a project affects its performance. For example, the more complex the routing structures, number of participants, or number of variables, the more the project will be slowed down.</p>\n<p class=\"wysiwyg-text-align-justify\">Tip: Compile the project as usual before taking it into the field and delete any redundant variables.</p>\n<h3 id=\"generating-and-editing-project-variables-and-codes\" class=\"wysiwyg-text-align-justify\"><strong>Generating and Editing Project Variables and Codes</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Project variables (v_000n) will be created automatically when you create a question.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the case of single response questions, only one variable per question is required for each and the various answer options are allocated codes.</p>\n</li>\n<li>\n<p>In the case of multiple response questions, one variable is created for each answer option. Whether the respondent has selected an option is recorded via the coding: 0 = not specified, 1 = specified.</p>\n</li>\n<li>\n<p>For matrix questions, one variable matches each answer option, and the scale characteristics are encoded (exception: question type 362 with checkboxes and question type 363 with text fields).</p>\n</li>\n<li>\n<p>Entries in open text fields are similarly recorded in a variable.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The variable names are assigned automatically for each project, beginning with v_1 and names cannot be edited. If required, however, you can allocate an external variable name. You can see the internal project variable names when working in the questionnaire editor depending on the question type</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>in the “Answer options” area in the “Variable name” columns</p>\n</li>\n<li>\n<p>in the case of questions with an open entry field in the “Question options” area.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The codes are also assigned automatically but can be edited in the case of single response and matrix questions. You can view and edit the codings in the questionnaire editor</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>for single response questions in the “Code” column in the “Answer options” section.</p>\n</li>\n<li>\n<p>for matrix questions in the “Code” column in the “Scale options” section.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">All project variables and their codings are listed in the codebook.</p>\n<p class=\"wysiwyg-text-align-justify\">In a live questionnaire, please never delete a page, question or answer option, or change a code retroactively. Otherwise already stored information will be lost or it will no longer be possible to interpret it correctly. Filters and other features that reference variables and codes might also be damaged. Please do the clean-up before launching the survey, then compile and check again if all questionnaire features are working properly.</p>\n<h3 id=\"preset-and-user-defined-names-for-project-variables\" class=\"wysiwyg-text-align-justify\"><strong>Preset and User-Defined Names for Project Variables</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If variable names are displayed within the <em>EFS Survey</em> the automatically preset, so-called internal variables are used. You can of course allocate alternative names which will be used on export instead of the internal names and then be available for external evaluation.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Internal variable names: These are the variable names that are automatically allocated by the system when creating a question and are used within EFS. These have the format v_000n and cannot be changed.</p>\n</li>\n<li>\n<p>External variable names: These names can be changed optionally by the user and are then used on export instead of the internal variable names.</p>\n<ul>\n<li>\n<p>External variable names may have up to 64 characters.</p>\n</li>\n<li>\n<p>The term “comment” should not be used as an external variable name (“comment” is a key term in PSPP, the program used for the SPSS export).</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note that the user-defined name type is used for data export only. Control functions such as filter and trigger definitions cannot be addressed using the external variable names and wildcard use is not an option either.</p>\n<h3 id=\"viewing-and-editing-user-defined-variable-names-in-the-questionnaire-editor\" class=\"wysiwyg-text-align-justify\"><strong>Viewing and Editing User-Defined Variable Names in the Questionnaire Editor</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Internal variable names are always displayed in the question view. In addition, you can also display and edit external variable names, if required. Depending on the question type you will find the respective field</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>in the “Question options” area for questions with a single response list or open entry field.</p>\n</li>\n<li>\n<p>in the “Answer options” area in a table column that is usually hidden in the case of multiple response and matrix questions. Click on the <strong>arrow </strong>icon in the “Variable name” column to display the “External varname” column.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you cannot find the field described above click the <strong>Question options </strong>icon and enable “External varname”.</p>\n<h3 id=\"options-for-centralized-editing-of-variable-names\" class=\"wysiwyg-text-align-justify\"><strong>Options for Centralized Editing of Variable Names</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The codebook contains a range of functions that enable effective centralized editing of user-defined variable names in the “Edit variable names” section.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing variable names</strong></p>\n<p class=\"wysiwyg-text-align-justify\">When the option “ Edit variable names directly in this form” is selected and then confirmed with the <strong>Save settings </strong>button, entry fields are displayed in which you can edit the external variable names. After entering the new names, click on the <strong>Save variable names </strong>button.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing variable names according to a preset algorithm</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can allocate a unique label to the external variable names of a project by a predefined scheme.</p>\n<p class=\"wysiwyg-text-align-justify\">Available options are:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Consecutive internal variable name (v_x): Default in new projects</p>\n</li>\n<li>\n<p>User-defined prefix consecutive item number</p>\n</li>\n<li>\n<p>User-defined prefix consecutive question number_consecutive item number (per question)</p>\n</li>\n<li>\n<p>User-defined prefix consecutive question number|consecutive item number (per question)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>In the codebook click the <strong>Select algorithm for creation of variable names </strong>link in the “Create new variable names by selected algorithm” field. This opens the <strong>Projects</strong> → {<strong>Selected project</strong>} → <strong>Project properties </strong>menu.</p>\n</li>\n<li>\n<p>Set the desired labeling option in the select box.</p>\n</li>\n<li>\n<p>Enter the desired prefix in the “Algorithm for creating the external variable names” field. The default preset is “v_”.</p>\n</li>\n<li>\n<p>Switch back to the <strong>Codebook</strong>.</p>\n</li>\n<li>\n<p>Activate “Create new variable names in accordance with selected algorithm”.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save settings</strong>.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Systematically naming variables in dynamic answer blocks</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The “Rename variables in dynamic answer blocks” option allows you to automatically change the names of variables, for example, in a list or a loop in such a way that the link to the original variable can be read from the name. If, for example, a dynamic list is incorporated into a question, all variables that were generated via the dynamic list will have the name <em>v_sourcevariablea</em> once renaming is complete. If the questionnaire contains a second question that draws on the same dynamic list, then the corresponding variables will be named<em> v_sourcevariableb</em>.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing variable names externally</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can export external variable names, edit them outside EFS, and then re-import them:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>The “Export variable names for external editing” will create a CSV file containing the variable's information, which you can load onto your workstation. You can specify which character set is to be used.</p>\n</li>\n<li>\n<p>When editing you enter the new external variable name in the “New varname” column.</p>\n</li>\n<li>\n<p>The “Import externally edited variable names” option allows you to re-import the externally edited list in CSV format into EFS Survey. Here, too, the correct character set must be specified.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Undoing changes</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Changes to external variable names can be undone applying the “Restore original variable names” options.</p>\n<h2 id=\"defining-export-templates\" class=\"wysiwyg-text-align-justify\"><strong>Defining Export Templates</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You can define your templates based on existing default export templates. This can be useful, for example, if you frequently need only specific excerpts from the result data.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note: When copying projects, user-defined export templates are not included.</p>\n<h3 id=\"overview-of-existing-export-templates\" class=\"wysiwyg-text-align-justify\"><strong>Overview of Existing Export Templates</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Export</strong> → <strong>Export templates </strong>menu (until EFS 10.3: <strong>Template editor</strong>) contains a list of the templates that have been set up for the respective project and the functions for creating new templates.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The default templates of the “Static template” type cannot be changed or deleted. Even though it is possible to download these templates, the modified templates must then be uploaded under a different name, in a newly created user-defined template.</p>\n</li>\n<li>\n<p>Templates of the “User-defined template” type can be edited and deleted.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following icons are in the “Action” column:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Upload definitions for template “...”</strong>: This function is only available for user-defined templates you have created. You can use it to upload an edited definition file.</p>\n</li>\n<li>\n<p><strong>Download template as CSV file</strong>: The downloaded file has the .csv file type.</p>\n</li>\n<li>\n<p><strong>Download template as Excel file</strong>: The downloaded file has the .xls or .xlsx file type</p>\n<p>and can be edited in MS Excel.</p>\n</li>\n<li>\n<p><strong>Save as a new template</strong>: You can save the selected template as a new template, allowing you to download and edit it afterward.</p>\n</li>\n<li>\n<p><strong>View template</strong>: The export template will open in a table.</p>\n</li>\n<li>\n<p><strong>Delete template</strong>.</p>\n</li>\n</ul>\n<h3 id=\"viewing-user-defined-templates-and-sorting-their-contents\" class=\"wysiwyg-text-align-justify\"><strong>Viewing User-defined Templates and Sorting Their Contents</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Clicking on the name of a template or the <strong>View template </strong>icon will display its content in a table that cannot be edited.</p>\n<p class=\"wysiwyg-text-align-justify\">It contains the following information for each variable of the template:</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Column</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Activated</p>\n</td>\n<td>\n<p>If the variable is activated (Yes = 1), it will be exported in the data record. If it is not activated (No = 0), it will not be exported.</p>\n<p>With the template shown above, you would only export those variables from the address record that contains the participants’ postal addresses (first name, name, street, zip code, city, and country).</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Position</p>\n</td>\n<td>\n<p>The position of the column in the exported data record.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Width</p>\n</td>\n<td>\n<p>The width of the column.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Alignment</p>\n</td>\n<td>\n<p>The alignment of the data for Fixed Format and Quantum export.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Ext. varname</p>\n</td>\n<td>\n<p>The SPSS label and header in Excel.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Description</p>\n</td>\n<td>\n<p>The description is used for XML and Triple-S export.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Quantum table name</p>\n</td>\n<td>\n<p>The table name used for Quantum export. This name is automatically generated and cannot be edited.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Question type</p>\n</td>\n<td>\n<p>The question type is displayed to improve editability and structure. It cannot be edited.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Int. varname</p>\n</td>\n<td>\n<p>The EFS Survey variable name.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Data type</p>\n</td>\n<td>\n<p>The type of data that can be entered into the respective database field.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\">For user-defined templates, you will find that there are two additional buttons:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Sort fields by position</strong>: Sort the rows by the content of the “Position” column.</p>\n</li>\n<li>\n<p><strong>Shrink column widths to width of actual data</strong>: This function is required for Fixed Format and Quantum exports.</p>\n</li>\n</ul>\n<h3 id=\"creating-a-user-defined-template\" class=\"wysiwyg-text-align-justify\"><strong>Creating a User-defined Template</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To define a new template, you must first select the appropriate basic template: This template should at least contain all of the data you wish to export later on. Select the basic template in the “Create a new template” section, and confirm by clicking on <strong>Create </strong>(alternatively, you can also click on the <strong>Save as new template </strong>icon).</p>\n<p class=\"wysiwyg-text-align-justify\">In the next window, enter the name of the template and confirm by clicking on <strong>Save as a new template</strong>. The new template of the “User-defined template” type will be created and displayed in the list of templates.</p>\n<h3 id=\"downloading-and-uploading-export-templates-and-editing-them-externally\" class=\"wysiwyg-text-align-justify\"><strong>Downloading and Uploading Export Templates and Editing Them Externally</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To edit an export template, you can download it and edit it externally. Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>Click on the <strong>Download template as CSV file </strong>or <strong>Download template as Excel file </strong>icon to download the template to your hard disk.</p>\n</li>\n<li>\n<p>Open the file in a suitable program, e.g. in MS Excel. Edit the file according to the rules presented below in the section titled “Editing a user-defined template”, and then save it. In the example shown, some variables are deactivated: “u_group”, “u_email” and “u_www” have already been deactivated.</p>\n</li>\n<li>\n<p>Click on the <strong>Upload definitions for template “...” </strong>icon. Locate the definition file on your hard disk, and then confirm by clicking on Upload. Open the export template, and check the result. In the example shown, all variables after “u_group” were deactivated. You can use the buttons labeled <strong>Sort fields by position </strong>and <strong>Shrink column widths </strong>to the width of actual data to edit the template further.</p>\n</li>\n</ol>\n<h3 id=\"editing-a-user-defined-template\" class=\"wysiwyg-text-align-justify\"><strong>Editing a User-defined Template</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">When editing the template definition, you should pay attention to the following rules:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A variable for export must be specified for each row, and each row must consist of seven values separated by tabs.</p>\n</li>\n<li>\n<p>You should not change the order of values.</p>\n</li>\n<li>\n<p>Deleting the variables from the list will not delete them from the export data record. The “active” column determines whether a variable is to be exported.</p>\n</li>\n<li>\n<p>It is not possible to add variables.</p>\n</li>\n<li>\n<p>Duplicate definitions of a variable are not permitted.</p>\n</li>\n<li>\n<p>Variable column positions (pos+width) may not overlap.</p>\n</li>\n<li>\n<p>The position and width of the columns for the individual variables must be such that they will not overlap.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can click on the <strong>Sort fields by position </strong>button to have the variables arranged by their position. This arrangement will be saved and can then only be changed by downloading the template again and editing it manually.</p>\n<p class=\"wysiwyg-text-align-justify\">Clicking on the <strong>Shrink column widths to the width of the actual data </strong>button allows you to optimize the export template for Fixed Format and Quantum exports.</p>\n<p class=\"wysiwyg-text-align-justify\">In personalized projects, you can change the sequence of participant data in the export dataset via participant administration.</p>\n<h2 id=\"data-cleaning\" class=\"wysiwyg-text-align-justify\"><strong>Data Cleaning</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If a respondent uses the “Back” button in the questionnaire or that of the browser while completing a questionnaire, it is possible that they will pass the same filter question more than once, giving different answers and then being routed into another filter branch, where they will answer different questions.</p>\n<p class=\"wysiwyg-text-align-justify\">Example: Somebody answers the question of whether they drive a car with “Yes” and is subsequently asked all car-related questions. Then, they go back to the questionnaire and state they do not drive a car. A filter lets them skip all car-related questions now. When the respondent completes the survey, they will have stated they do not drive a car. Nonetheless, all car-related variables will contain values.</p>\n<p class=\"wysiwyg-text-align-justify\">In the past, such irrelevant data had to be manually cleaned from the result data. With the “Data cleaning” function, this cleaning process has been automated.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Data cleaning only considers completed interviews, i.e. records with status 31 or 32.</p>\n</li>\n<li>\n<p>The following routing types are supported:</p>\n<ul>\n<li>\n<p>“Filter” and “Random rotation” branches.</p>\n</li>\n<li>\n<p>Trigger types that affect routing via changes in the survey results. The function should, however, not be used in projects involving page triggers: In this case, the routing that the respondent took erroneously or for test purposes cannot be unambiguously identified.</p>\n</li>\n<li>\n<p>Action pages.</p>\n</li>\n<li>\n<p>Depot questions.</p>\n</li>\n<li>\n<p>EFS-side <strong>Back </strong>buttons. Please note: that browser-side Back buttons are not fully supported. <em>If a respondent skips back several pages using the browser </em><strong>Back </strong><em>button first and then skips forward several pages using the browser </em><strong>Forward </strong><em>button ignoring the system warning, these steps cannot be tracked and stored correctly. </em>I.e. pages might be missing in page history, though valid data from these pages exist.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>“Random rotation” branches and loops are not supported.</p>\n</li>\n<li>\n<p>Data cleaning should not be applied to surveys that are prefilled with values. I.e. it should not be combined with the options “Transfer master data values to survey variables” → “Always pre-fill”, “Allow multiple participations, pre-fill with values of last participation” and import of specific answers from other projects.</p>\n</li>\n</ul>\n<h3 id=\"activating-automatic-data-cleaning\" class=\"wysiwyg-text-align-justify\"><strong>Activating Automatic Data Cleaning</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><strong>Activating data cleaning before the beginning of the field phase</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Projects </strong>module, click on the desired project, and then choose the <strong>Project Properties </strong>menu item. On the tab <strong>General Options</strong>, tick the checkbox in the “Enable data cleaning” field. Then, confirm by clicking on <strong>Submit</strong>. The <strong>Display </strong>link allows you to switch to the <strong>Data cleaning </strong>submenu.</p>\n<h3 id=\"triggering-data-cleaning-for-the-entire-project\" class=\"wysiwyg-text-align-justify\"><strong>Triggering Data Cleaning for the Entire Project</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The documentation of all changes to the data as well as functions for restoring all or part of the original data are located in the data cleaning log. There are two ways of accessing this:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Display </strong>link in the <strong>Project Properties </strong>menu.</p>\n</li>\n<li>\n<p>The second way is via the <strong>Statistics</strong> → <strong>Data cleaning </strong>menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You are automatically taken to the <strong>General </strong>tab.</p>\n<p class=\"wysiwyg-text-align-justify\">The “General Information” area shows whether data cleaning has already been performed and how many records were processed.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Status data cleaning in this project: Data cleaning is activated from the <strong>Project Properties </strong>menu.</p>\n</li>\n<li>\n<p>Number of cleaned records: The records that were changed during data cleaning.</p>\n</li>\n<li>\n<p>Number of data records that were checked but did not require cleaning: The records that would not be / are not affected in the event of data cleaning.</p>\n</li>\n<li>\n<p>Number of uncleaned records:</p>\n<ul>\n<li>\n<p>If data cleaning has not taken place, this value will contain the uncleaned records.</p>\n</li>\n<li>\n<p>After data cleaning has taken place, all records that could not be checked and cleaned because the interviews were not completed remain in this field.</p>\n</li>\n<li>\n<p>If further questionnaires were filled out after a manual data cleaning, this value will be the total of all uncleaned records, as well as all records that were not checked during the manual data cleaning because the interviews were not completed.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the “Data cleaning for the whole project” area, you can trigger or undo data cleaning:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you select “Clean all data” and then confirm by clicking on <strong>Execute</strong>, the cleaning operation will be triggered.</p>\n</li>\n<li>\n<p>If you select “Recover all data” and then confirm by clicking on <strong>Execute</strong>, the original state will be restored.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note that data cleaning only takes completed interviews into consideration, i.e. records with status 31 or 32.</p>\n<h3 id=\"viewing-details-and-editing-records-manually\" class=\"wysiwyg-text-align-justify\"><strong>Viewing Details and Editing Records Manually</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Extended </strong>tab provides detailed documentation of all changes to the data as well as functions for both editing individual records and restoring all or part of the original data.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Display Options</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Number of datasets per page: If you enter the corresponding value and then con- firm by clicking on <strong>Apply</strong>, you can change the number of records displayed on one page.</p>\n</li>\n<li>\n<p>Display only datasets with a particular variable: This search function identifies all records containing the given string. After entering the string, you can trigger the search by clicking on <strong>Apply</strong>.</p>\n</li>\n<li>\n<p>Display routemap: Ticking the checkbox and then clicking on <strong>Apply </strong>will show the so-called <em>routemap </em>in the log. The routemap is a comma-separated page list reflecting the participant’s <em>valid </em>route through the survey (see the “Example” section below). It is extracted from the <em>page history </em>(<em>phistory </em>is the variable used in the export record, <em>page history </em>is the label used in the SPSS export record).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Interpreting the entries in the data cleaning log</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The data cleaning log contains the following information and functions:</p>\n</li>\n<li>\n<p>Cons. no.: The respondent’s consecutive number in both the survey table and the export record. The table contains only the records of those respondents for whom data cleaning might be required.</p>\n</li>\n<li>\n<p>Cleaned data: Those data from the complete record that were / would be changed during cleaning.</p>\n</li>\n<li>\n<p>Original: The original state of those data from the complete record that were / would be changed by cleaning.</p>\n</li>\n<li>\n<p>Routemap: This can be shown and hidden using the “Display routemap” function in the “Display options” area.</p>\n</li>\n<li>\n<p>Cleaned: yes/no.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing individual records</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You have the option of targeting individual records for cleaning or for restoring the original state. To do so, tick the respective checkbox in the “Execute data cleaning” or “Recover data” column, and confirm by clicking on <strong>Save</strong>.</p>\n<h3 id=\"identifying-cleaned-data-in-the-export-record\" class=\"wysiwyg-text-align-justify\"><strong>Identifying Cleaned Data in the Export Record</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The export record provides information if an individual record was cleaned: It is stored in the variable <em>cleaned </em>(labeling in the SPSS export record: “datacleaning”) which can have the following properties:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>0 = uncleaned data records and records of incomplete interviews which are excluded from the cleaning process</p>\n</li>\n<li>\n<p>1 = cleaned</p>\n</li>\n<li>\n<p>2 = checked but did not require cleaning</p>\n</li>\n</ul>\n<h2 id=\"quality-correction\" class=\"wysiwyg-text-align-justify\"><strong>Quality Correction</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The conscientiousness with which survey participants fill in questionnaires is critical for the quality of the results of online surveys. The results from survey participants who merely click very quickly through the questionnaire, for example, to get a quick overview of the survey theme or on completion to participate in a prize draw, are of little value for further analysis in the end. The quality correction program helps you to recognize participants who simply “clicked through” by their answer behavior, to mark these data records, and if desired to delete them.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Response times as quality criterion</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The response times of a user are the key criteria needed for indexing the quality of survey participants. The time taken by each participant to complete a particular page of a survey can be calculated. First of all an index is formed for each participant that gives information on his mean processing time for a questionnaire page. Please note here: The time required by a participant to complete an entire survey is not a factor in the calculation. Depending on the direction of the questionnaire the number of pages that the participant sees can also vary tremendously.</p>\n<p class=\"wysiwyg-text-align-justify\">Subsequently, a separate calculation for each page is made, which shows where the survey participant is about the processing time of the media. The median survey time of 100 participants corresponds to the average survey duration of the 50th and the 51st survey participants when these have been sorted by survey time.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Determining the quality index for individual users</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To determine the “quality” of a participant in a survey, his processing time is set about the average processing time of the entire sample. The relationship can be expressed as a number that is stored in the variable “quality”. For example, a value of 0.5 signifies that the corresponding user required exactly the average time for processing the questionnaire pages. A value of 0.25 signifies that the respondent needed only half as long as the average processing time.</p>\n<h3 id=\"triggering-quality-correction\" class=\"wysiwyg-text-align-justify\"><strong>Triggering Quality Correction</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can start the program that calculates the quality index under <strong>Projects</strong> → {Selected project} → <strong>Statistics</strong> → <strong>Quality correction </strong>by clicking on the button <strong>Execute</strong>. It does not make any changes to the actual survey data, rather it expands the data record to include the variable “quality”.</p>\n<p class=\"wysiwyg-text-align-justify\">Quality correction should not be triggered when large surveys are being conducted simultaneously in the installation.</p>\n<h3 id=\"viewing-the-quality-index-in-the-export-data-record\" class=\"wysiwyg-text-align-justify\"><strong>Viewing the Quality Index in the Export Data Record</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The quality index of a participant will be stored in the variable “quality”. This is contained within the export data record, and therefore you can identify the data records of participants with critical values and where necessary delete them before making an evaluation.</p>\n<h2 id=\"general-tips-and-tricks-on-exporting-data\" class=\"wysiwyg-text-align-justify\"><strong>General Tips and Tricks on Exporting Data</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The following applies to all exports:</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Export duration</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The exported data are not created in advance, they are created according to the settings you made the moment you click on the <strong>Export </strong>button. Depending on the desired content, selected format, and number of records, the export can therefore take a considerable amount of time.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>First, save, then open the file!</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Once you create the file after having made all settings, a dialog window will open, in which you can choose whether you wish to save the file on your local PC or open it directly.</p>\n<p class=\"wysiwyg-text-align-justify\">Please always save the file on your local PC. This procedure has several advantages:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The file only needs to be created once. Newly creating the file each time would cause an unnecessary load on the server.</p>\n</li>\n<li>\n<p>Depending on the browser used, you may not be able to open the actual application and specify the file type when opening the file directly. Instead, the browser may attempt to automatically open the file itself. However, it may be the case that the browser’s file type recognition was incorrectly implemented, i.e. the browser does not identify the file type correctly, cannot open the file, and produces an error message.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Characters which cannot be exported</strong></p>\n<p class=\"wysiwyg-text-align-justify\">An effective export process into a variety of formats requires a few rather marginal modifications of the result data:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Backslashes are removed.</p>\n</li>\n<li>\n<p>The special characters \\n (Newline), \\t (Horizontal tab), \\r (Carriage return), and \" (Double quote) are removed as well.</p>\n</li>\n<li>\n<p>NULL values are replaced by an empty string.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">These modifications affect all result data exports including the panel exports.</p>\n<p class=\"wysiwyg-text-align-justify\">The CSV export is preffered to the Excel export in order to execute high volume data exports at a greater performance rate.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What is the maximum number of variables available per project?</h3>\n<p class=\"wysiwyg-text-align-justify\">Up to 7,000 variables are available per project. However, the actual number may be lower depending on various factors such as variable types and sizes.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I export data from incomplete surveys?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can export data from incomplete surveys. However, data cleaning only takes completed interviews (status 31 or 32) into consideration.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">How can I identify cleaned data in the export record?</h3>\n<p class=\"wysiwyg-text-align-justify\">Cleaned data is identified by the \"cleaned\" variable in the export record. It can have values of 0 (uncleaned), 1 (cleaned), or 2 (checked but did not require cleaning).</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>",
    "user_segment_ids": []
}