{
    "id": 20370904047250,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370904047250.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370904047250-Results-Import",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:38:58Z",
    "updated_at": "2024-08-28T11:22:40Z",
    "name": "Results Import",
    "title": "Results Import",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T11:27:21Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about the Results Import feature in EFS (Enterprise Feedback Suite). It covers the functional scope, step-by-step instructions for performing a data import, and detailed formatting guidelines for import files.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The Results Import tool allows users to import entire project data, primarily for evaluation purposes. This feature is available in personalized projects and employee surveys, but not in anonymous projects, panel surveys, or master data surveys. If you wish to prefill individual variables with data from another EFS project, the Variable data import in the <strong>Project properties</strong> menu might be the better option.</p>\n<ul>\n<li><a href=\"#functional-scope\">Functional Scope</a></li>\n<li><a href=\"#performing-a-data-import\">Performing a Data Import</a></li>\n<li><a href=\"#formatting-of-the-import-file-in-detail\">Formatting of the Import File in Detail</a></li>\n<li><a href=\"#further-information\">Further Information</a></li>\n</ul>\n<h2 id=\"functional-scope\" class=\"wysiwyg-text-align-justify\">Functional Scope</h2>\n<p class=\"wysiwyg-text-align-justify\">The functional scope of the results data import in brief:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This tool is available in personalized projects and employee surveys. The results data import is not implemented in anonymous projects, panel surveys, and master data surveys.</p>\n</li>\n<li>\n<p>You can import all project variables (v_x), URL parameters (p_x), user-defined variables (c_x), participant variables (u_x), various system data (tester, code, date_of_first_access, date_of_last_access) and the disposition code.</p>\n</li>\n<li>\n<p>Furthermore, in project type “employee survey”, the variables u_metaname (required for organizational mapping) and u_offline (used to mark data from paper-pencil questionnaires) can be imported.</p>\n</li>\n<li>\n<p>An import template is available in CSV format, which you merely have to download and fill in. Alternatively, you can import a result data file used in another <em>EFS</em> project: In this case, matching of the variables of the source and target project is done via the external variable names.#</p>\n</li>\n<li>\n<p>Read rights for <em>ct42partadm</em> are required to use the results data import.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"performing-a-data-import\" class=\"wysiwyg-text-align-justify\">Performing a Data Import</h2>\n<p class=\"wysiwyg-text-align-justify\">Data import can be found in the <strong>Projects</strong> → {Selected projects} → <strong>Participant administration → Results data import</strong> menu.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>First, download the ready-formatted import template.</p>\n</li>\n<li>\n<p>Open the template in an appropriate program (e.g. Excel) and enter the data. Then save the file in Excel or CSV.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017142483474\" alt=\"Bildschirmfoto 2021-10-19 um 09.42.00.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Afterwards, import the data into EFS. During the import, you can use the preview function to double-check and, if necessary, change the data.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"formatting-of-the-import-file-in-detail\" class=\"wysiwyg-text-align-justify\">Formatting of the Import File in Detail</h2>\n<p class=\"wysiwyg-text-align-justify\">When filling in the import template or creating your import file you have to consider various formatting rules.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The import file can be created in Excel or CSV.</p>\n</li>\n<li>\n<p>An individual column is created for each variable to be imported. You can import the following variables:</p>\n<ul>\n<li>\n<p>all project variables (v_x)</p>\n</li>\n<li>\n<p>all URL parameters (p_x) and user-defined variables (c_x)</p>\n</li>\n<li>\n<p>all participant variables (u_x)</p>\n</li>\n<li>\n<p>only in project type “Employee survey”: u_metaname</p>\n</li>\n<li>\n<p>various system data (tester, code, date_of_first_access, date of last access)</p>\n</li>\n<li>\n<p>only in project type “employee survey”: u_offline.</p>\n</li>\n<li>\n<p>disposition code</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The first line usually contains the column label, i.e. in this case the names of the respective variables. This has the advantage that the software will automatically identify and assign the columns to the appropriate database fields. If your import data are values exported from another EFS project, you may alternatively use the export file itself without re-formatting the column names: An option titled “Use external variable names for matching” is available for the import.</p>\n</li>\n<li>\n<p>As is the case with the normal participant import, the e-mail addresses must be unambiguous. Otherwise, please remember to activate the relevant option “Allow duplicate e-mail addresses”.</p>\n</li>\n<li>\n<p>If the participants do not have e-mail addresses, you have to create dummy accounts. You can use e-mail addresses on the @3uu.eu domain: these addresses are owned by TIVIAN, and emails sent to them are deleted automatically.</p>\n</li>\n<li>\n<p>Blank fields of the import file will be filled with default values:</p>\n<ul>\n<li>\n<p>participant variables: “text field” = blank, “selectbox” = 0</p>\n</li>\n<li>\n<p>project variables: Default missing values of EFS depending on data type</p>\n</li>\n<li>\n<p>default disposition code: completed = “31”</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"further-information\" class=\"wysiwyg-text-align-justify\">Further Information</h2>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The participant accounts for which you want to import data will be created automatically during the import process. They should not be created beforehand, otherwise the import will be impossible as the data records already exist. The results data import is not meant for overwriting existing data.</p>\n</li>\n<li>\n<p>The variables in which the imported data are to be stored have to be created in advance. It is not possible to create new variables via this import.</p>\n</li>\n<li>\n<p>New characteristics can be created via the import if this is permitted for the respective variable.</p>\n</li>\n<li>\n<p>It is not possible to upload externally collected loop data into <em>EFS</em> via results data import.</p>\n</li>\n<li>\n<p>A Microsoft <em>Excel</em> worksheet can have a maximum of 256 columns, i.e. it allows the import of a maximum of 256 variables. If your import exceeds this value, you should use another program instead of <em>Excel</em> for editing your import file, then save this file in CSV format and import it.</p>\n</li>\n<li>\n<p>In some cases, results data import fails due to the sheer file size of the <em>Excel</em> file. In this case, please save the file in CSV format and import it.</p>\n</li>\n<li>\n<p>Results data import is limited to 2,400 variables.</p>\n</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">Can I use Results Import for anonymous projects?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, the Results Import feature is not available for anonymous projects, panel surveys, or master data surveys. It is only available for personalized projects and employee surveys.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">What should I do if my import file exceeds 256 columns?</h3>\n<p class=\"wysiwyg-text-align-justify\">If your import file has more than 256 columns, which is the limit for Microsoft Excel worksheets, you should use another program to edit your file. Save the file in CSV format and then import it into EFS.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">Can I import externally collected loop data?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, it is not possible to upload externally collected loop data into EFS via the Results data import feature.</p>",
    "user_segment_ids": []
}