{
    "id": 20370780684178,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370780684178.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370780684178-Contact-Participant-Groups",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:28:47Z",
    "updated_at": "2024-08-28T08:16:19Z",
    "name": "Contact Participant Groups",
    "title": "Contact Participant Groups",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T10:39:52Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide on how to contact participant groups in a survey project. It covers various actions for sending emails, testing mail dispatch, and sending invitation emails.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The e-mail dispatch options, which are opened via the<strong> Contact Participant groups</strong> button, allow you to target emails to specific participant groups without performing a search in participant administration. This guide explains the available dispatch options and how to use them effectively.</p>\n<ul>\n<li><a href=\"#actions\">Actions</a></li>\n<li><a href=\"#testing-mail-dispatch\">Testing Mail Dispatch</a></li>\n<li><a href=\"#send-invitation-mails\">Send Invitation Mails</a></li>\n</ul>\n<h2 id=\"actions\" class=\"wysiwyg-text-align-justify\">Actions</h2>\n<p class=\"wysiwyg-text-align-justify\">You can trigger the following actions by clicking on the respective link:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Send a test e-mail to yourself</strong>: This enables you to send a test e-mail to a user-defined email address and optionally create a corresponding tester account at the same time.</p>\n</li>\n<li>\n<p><strong>Send invitation emails</strong>: Will automatically select all persons existing in participant administration, irrespective of their disposition code (except participants with disposition code 15). Clicking here will open the mail dispatch window, and you can either write an e-mail or select a mail template.</p>\n</li>\n<li>\n<p><strong>Send invitation emails (only those who haven’t gotten an invitation so far)</strong>: Will automatically select all persons who have not been invited yet (disposition code = 11). “Invitation mail” type templates are available in the mail dispatch window.</p>\n</li>\n<li>\n<p><strong>Send reminders</strong>: This will automatically select all persons who have not yet started the survey or who have not yet completed it. You can choose which participants are reminded: only those with disposition codes 11, and 12 or all participants with disposition codes 11, 12, 20, 21, 22, 23. In the mail dispatch window, you can then select the template for the reminder mail.</p>\n</li>\n<li>\n<p><strong>Inform successful participants</strong>: Will automatically select all participants who have finished the survey (disposition code 31, 32). Therefore, this function is particularly well suited for thank-you emails. “Invitation mail” type templates are available in the mail dispatch window.</p>\n</li>\n<li>\n<p><strong>E-mail to first page viewers</strong>: Will automatically select all persons who have viewed the first page of the survey but have not clicked on the Submit button (disposition code 20). These participants can then be sent a specific reminder mail.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"testing-mail-dispatch\" class=\"wysiwyg-text-align-justify\">Testing Mail Dispatch</h2>\n<p class=\"wysiwyg-text-align-justify\">With the <strong>Send test e-mail to yourself</strong> option you can send a test e-mail to a user-defined e-mail address and optionally create a corresponding tester account at the same time.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21012276395410\" alt=\"Send test mail.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can enter your own or any other e-mail address.</p>\n<ul>\n<li>\n<p>If the specified e-mail address already exists in the participant administration of the project, the e-mail will be sent to the respective participant.</p>\n</li>\n<li>\n<p>If there is no participant with the specified e-mail address, a new tester account will be created based on your input and the e-mail will be sent to this account.</p>\n</li>\n<li>\n<p>Please note that the specified e-mail address will be used both as recipient and sender recipient addresses, even if you select a mail template with other values.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>You can select the mail template (type: invitation mail). If you want the recipient of the test e-mail to log in and test the survey, the template should contain wildcards for the login data, i.e. survey link, code, and/or password. When sending the mail, these wildcards will be replaced with the corresponding data of the tester.</p>\n</li>\n<li>\n<p>If you are not using an already existing tester, you can, in addition to the e-mail address and mail template, also specify the first name and name of the new tester account to be created. If the mail template contains the wildcards #u_firstname# and #u_name#, these will be replaced with the respective details. Other wildcards will be replaced only if an appropriately prepared set of participant data is available.</p>\n</li>\n<li>\n<p>To try out the test function, click on the <strong>Contact Participant Groups</strong> button in the participant administration.</p>\n</li>\n<li>\n<p>Select the action <strong>Send a test e-mail to yourself</strong>.</p>\n</li>\n<li>\n<p>This will prompt a dialog where you can enter various basic data required for sending e-mail. Enter the tester data and select the mail template.</p>\n</li>\n<li>\n<p>Click on <strong>Send test mail</strong> to initiate the test.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want to test the complete mail process, i.e. receive the mail, you should only use either your e-mail addresses or the addresses of users who have given their consent.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"send-invitation-mails\" class=\"wysiwyg-text-align-justify\">Send Invitation Mails</h2>\n<p class=\"wysiwyg-text-align-justify\">You will go through the entire mail dispatch process, from selecting the recipients and filling in the form to checking that the mail has been sent success- fully.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Switch to the <strong>Contact Participant Groups </strong>tab in <strong>Participant Administration</strong>. It offers various options for contacting participants with a specific status.</p>\n</li>\n<li>\n<p>Click on the <strong>Send invitation mails </strong>link.</p>\n</li>\n<li>\n<p>Select the desired mail template, and confirm by clicking on <strong>Apply mail template</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please take into consideration that only those mail templates that fit the respective action area will be offered for selection. For example, if you are in the area of the “Send invitation emails” function, only the templates of the “Invitation” type and of the “Default” type, which can be used anywhere, will be offered.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Make sure that the proper mail format has been selected. Otherwise, change the mail format and confirm by clicking on <strong>Apply mail format</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">It is important to select the proper mail format <em>before </em>entering content: different input boxes are used for the various formats.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you wish to make use of the advanced mail settings, open this section and make the desired changes.</p>\n</li>\n<li>\n<p>Check the content and settings of the mail template.</p>\n</li>\n<li>\n<p>Tick the “Personalized dispatch” checkbox if you wish to use the recipient’s real name.</p>\n</li>\n<li>\n<p>Enter the subject.</p>\n</li>\n<li>\n<p>Select the sender. If the desired sender is not available, you can click on the <strong>Add mail sender </strong>link to open the menu for creating new senders (Chapter <em>12.4, p. 536</em>) in a new window.</p>\n</li>\n<li>\n<p>Formulate the content of the invitation mail. You can display an overview of the wildcards you can use by clicking on the <strong>question mark </strong>icon.</p>\n</li>\n<li>\n<p>If you wish to add an attachment, it should be uploaded in the “Add an attachment” field. Locate the desired file, and click on <strong>Attach file </strong>to add it.</p>\n</li>\n<li>\n<p>Click on the <strong>Preview mail </strong>button to check the result.</p>\n</li>\n<li>\n<p>In particular, check whether the wildcards are replaced correctly.</p>\n</li>\n<li>\n<p>If you want to save the mail for future use, tick the “Save as mail template (including wildcards)” checkbox and enter a title for the new template.</p>\n</li>\n<li>\n<p>If you are satisfied, click on <strong>Send</strong>.</p>\n</li>\n<li>\n<p>The <strong>Mail Transmission Report </strong>menu gives you an overview of the emails that have been sent.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note: The e-mails will not be sent immediately but, depending on the mail volume, will be placed in a queue and processed in groups in ten-minute intervals.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq1\" class=\"wysiwyg-text-align-justify\">What types of mail templates are available for different actions?</h3>\n<p class=\"wysiwyg-text-align-justify\">Mail templates are specific to each action. For example, \"Invitation\" type templates are available for sending invitation emails, while \"Default\" type templates can be used for any action.</p>\n<h3 id=\"faq2\" class=\"wysiwyg-text-align-justify\">How can I add a new mail sender?</h3>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Add mail sender</strong> link in the sender selection menu to open a new window for creating new senders.</p>\n<h3 id=\"faq3\" class=\"wysiwyg-text-align-justify\">When are the emails sent after clicking \"Send\"?</h3>\n<p class=\"wysiwyg-text-align-justify\">Emails are not sent immediately but are placed in a queue and processed in groups at ten-minute intervals, depending on the mail volume.</p>",
    "user_segment_ids": []
}