{
    "id": 20371037479442,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371037479442.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371037479442-System",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234757130258,
    "created_at": "2024-07-25T16:46:04Z",
    "updated_at": "2024-08-19T19:55:32Z",
    "name": "System",
    "title": "System",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T13:00:47Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\">Overview</h1>\n<p>This article provides information about the System menu in the admin area, which includes Users, Libraries, and Options. It explains the purpose of each menu item and provides links to more detailed information.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>The System menu is a crucial part of the admin area, allowing users to manage various aspects of the platform, including user accounts, content libraries, and system options.</p>\n<p> </p>\n<ul>\n<li><a href=\"#h_01HGKSMPRT1QJXZ3NQJD5XBPEM\">Users</a></li>\n<li><a href=\"#h_01HGKSMPRT2KFVQ0YJGQX3TNWH\">Libraries</a></li>\n<li><a href=\"#h_01HGKSMPRT3BXGJ8QNQMVP5WXD\">Options</a></li>\n</ul>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT1QJXZ3NQJD5XBPEM\">Users</h2>\n<p>The Users menu item allows administrators to manage user accounts for the admin area and control access rights. This section is essential for maintaining security and ensuring proper user management within the system.</p>\n<p>For more detailed information about managing users, please refer to the Users documentation.</p>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT2KFVQ0YJGQX3TNWH\">Libraries</h2>\n<p>The Libraries menu item enables the creation and management of reusable content such as surveys, media files, and mail templates. This feature helps streamline content creation and ensures consistency across the platform.</p>\n<p>To learn more about working with libraries, please check the Libraries documentation.</p>\n<p> </p>\n<h2 id=\"h_01HGKSMPRT3BXGJ8QNQMVP5WXD\">Options</h2>\n<p>The Options menu item provides access to various system settings and features, including:</p>\n<ul>\n<li>Platform cockpit</li>\n<li>Secure data exchange organization</li>\n<li>ACL (Access Control List) definition</li>\n</ul>\n<p>These options allow administrators to fine-tune the system's behavior and security settings.</p>\n<p>For more information about the available options and how to configure them, please refer to the <a href=\"#\">Options</a> documentation.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRT4QQNBP8JXCQXM1NM\">What is the purpose of the System menu?</h3>\n<p>The System menu provides access to essential administrative functions, including user management, content libraries, and system options, allowing administrators to configure and maintain the platform effectively.</p>\n<h3 id=\"h_01HGKSMPRT5HQXQXCJXF1XKQNP\">Can regular users access the System menu?</h3>\n<p>Access to the System menu is typically restricted to administrators or users with appropriate permissions. Regular users may not have access to these advanced settings.</p>\n<h3 id=\"h_01HGKSMPRT6WQXH4JXBQ1XKRNQ\">How do I grant access to the System menu for a new administrator?</h3>\n<p>To grant access to the System menu for a new administrator, you would use the Users section to create a new user account or modify an existing one, assigning the necessary administrative permissions.</p>",
    "user_segment_ids": []
}