{
    "id": 20370686994066,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370686994066.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370686994066-Codebook",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:18:38Z",
    "updated_at": "2024-08-21T12:51:06Z",
    "name": "Codebook",
    "title": "Codebook",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T09:07:02Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide to understanding and using the Codebook feature in the EFS Survey. The Codebook is an essential tool for managing variables, encodings, and project information in survey projects.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The <em>codebook </em>contains an overview of all variables and all encodings used in a project. I.e. it shows which memory locations have been created for your questions and how the answers have been encoded. The codebook is used, for example, whenever you want to incorporate control information into your survey, e.g. when setting filters or defining triggers, and when analyzing the survey results.</p>\n<ul>\n<li><a href=\"#viewing-the-codebook\">Viewing the Codebook</a></li>\n<li><a href=\"#data-types-of-variables\">Data types of variables</a></li>\n<li><a href=\"#displaying-additional-information\">Displaying Additional Information</a></li>\n<li><a href=\"#selecting-the-language-of-text-elements\">Selecting the Language of Text Elements</a></li>\n<li><a href=\"#editing-variable-names\">Editing Variable Names</a></li>\n<li><a href=\"#printing-and-exporting-codebook\">Printing and Exporting Codebook</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"viewing-the-codebook\" class=\"wysiwyg-text-align-justify\">Viewing the Codebook</h3>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Codebook </strong>menu item in the submenu for the respective function. This will open a new browser window, and the codebook will appear.</p>\n<p class=\"wysiwyg-text-align-justify\">It lists the question texts and answer options by page, along with the variable names (e.g. v_1) data type and the various characteristics (“codes”, e.g. 1-4). The final page doesn’t contain variables and is therefore not displayed.</p>\n<p class=\"wysiwyg-text-align-justify\">In the upper part of the codebook, you will find several fields containing additional options that allow you to show further information, change the language of text elements displayed, edit variables, and export the codebook. These fields can be displayed or hidden.</p>\n<h3 id=\"data-types-of-variables\" class=\"wysiwyg-text-align-justify\">Data types of variables</h3>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Data Type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>int</p>\n</td>\n<td>\n<p>The “int” column stands for “integer”, i.e. the variable will only accept integer values. In the example above, this would be the value 1 for the “Marketing” answer, etc.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>varchar</p>\n</td>\n<td>\n<p>Questions with open-ended text input fields use the “varchar” variable type in which strings can be saved.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"wysiwyg-text-align-justify\"> </h3>\n<h3 id=\"displaying-additional-information\" class=\"wysiwyg-text-align-justify\">Displaying Additional Information</h3>\n<p class=\"wysiwyg-text-align-justify\">In the “Display options“ section you have the option of displaying the following additional information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Show filters</p>\n</li>\n<li>\n<p>Show triggers</p>\n</li>\n<li>\n<p>Show plausibility checks</p>\n</li>\n<li>\n<p>Show hiding conditions: Hiding conditions for questions and answer options can be displayed. Please note: Hiding conditions for matrix columns cannot be displayed in the codebook.</p>\n</li>\n<li>\n<p>Show direct links to edit the questionnaire: Next to each question, an <strong>Edit question </strong>link and a link to the <strong>Language editor </strong>will be shown.</p>\n</li>\n<li>\n<p>Show fill-in instructions: When checking the box, fill-in instructions for questions will be displayed in the codebook.</p>\n</li>\n<li>\n<p>Show table of contents: The codebook will show a list of the questionnaire pages. You can click on the page titles, so even with very long questionnaires, you will easily find the respective page in the codebook.</p>\n</li>\n<li>\n<p>If you tick the special checkbox “Show field positions in export template” in the codebook and select the suitable export template, the codebook will show the width, beginning, and end of the columns.</p>\n</li>\n<li>\n<p>Adjust column widths to effective size of data (excluding missing values): If you tick both this checkbox and the preceding “Show field positions in export template” checkbox, the column widths displayed will be those that result when exporting in Fixed Format with adjusted column widths for further processing in Quantum.</p>\n</li>\n<li>\n<p>In the case of personalized projects, you can select “Show participant variables” to display these variables.</p>\n</li>\n<li>\n<p>Show survey variables: When checking this option, the survey variables will be displayed in the codebook. Depending on the variables used in the project, this may be e. g. language, disposition codes, date, or meta information such as location and device variables.</p>\n</li>\n<li>\n<p>With “Display groups and group assignment of items and groups” grouping information can be displayed in the codebook.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The most recently saved display options will be saved as default and will be used for future projects.</p>\n<h3 id=\"selecting-the-language-of-text-elements\" class=\"wysiwyg-text-align-justify\">Selecting the Language of Text Elements</h3>\n<p class=\"wysiwyg-text-align-justify\">In the case of multilingual projects, you can use the drop-down list under “Select language” to specify the language in which the question texts and answer categories are to be displayed in the codebook.</p>\n<h3 id=\"editing-variable-names\" class=\"wysiwyg-text-align-justify\">Editing Variable Names</h3>\n<p class=\"wysiwyg-text-align-justify\">The codebook contains a range of functions that enable effective centralized editing of user-defined variable names in the “Edit variable names” section.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing variable names</strong></p>\n<p class=\"wysiwyg-text-align-justify\">When the option “Edit variable names directly in this form” is selected and then confirmed with the <strong>Save settings </strong>button, entry fields are displayed in which you can edit the external variable names. After entering the new names, click on the <strong>Save variable names </strong>button.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing variable names according to a preset algorithm</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can allocate a unique label to the external variable names of a project by a predefined scheme.</p>\n<p class=\"wysiwyg-text-align-justify\">Available options are:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Consecutive internal variable name (v_x): Default in new projects</p>\n</li>\n<li>\n<p>User-defined prefix consecutive item number</p>\n</li>\n<li>\n<p>User-defined prefix consecutive question number_consecutive item number (per question)</p>\n</li>\n<li>\n<p>User-defined prefix consecutive question number|consecutive item number (per question)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>In the codebook click the <strong>Select algorithm for creation of variable names </strong>link in the “Create new variable names by selected algorithm” field. This opens the <strong>Projects</strong>-&gt;{<strong>Selected project</strong>}-&gt;<strong>Project properties </strong>menu.</p>\n</li>\n<li>\n<p>Set the desired labeling option in the select box.</p>\n</li>\n<li>\n<p>Enter the desired prefix in the “Algorithm for creating the external variable names” field. The default preset is “v_”.</p>\n</li>\n<li>\n<p>Switch back to the <strong>Codebook</strong>.</p>\n</li>\n<li>\n<p>Activate “Create new variable names by selected algorithm”.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save settings</strong>.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Systematically naming variables in dynamic answer blocks</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The “Rename variables in dynamic answer blocks” option allows you to automatically change the names of variables, for example, in a list or a loop in such a way that the link to the original variable can be read from the name. If, for example, a dynamic list is incorporated into a question, all variables that were generated via the dynamic list will have the name v_sourcevariablea once renaming is complete. If the questionnaire contains a second question that draws on the same dynamic list, then the corresponding variables will be named v_sourcevariableb.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing variable names externally</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can export external variable names, edit them outside EFS and then re-import them:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>The “Export variable names for external editing” will create a CSV file containing the variable's information, which you can load onto your workstation. You can specify which character set is to be used.</p>\n</li>\n<li>\n<p>When editing you enter the new external variable name in the “New varname” column.</p>\n</li>\n<li>\n<p>The “Import externally edited variable names” option allows you to re-import the externally edited list in CSV format into EFS Survey. Here, too, the correct character set must be specified.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Undoing changes</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Changes to external variable names can be undone by applying the “Restore original variable names” option.</p>\n<h3 id=\"printing-and-exporting-codebook\" class=\"wysiwyg-text-align-justify\">Printing and Exporting Codebook</h3>\n<p class=\"wysiwyg-text-align-justify\">The codebook can be printed out or exported as a whole:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>By clicking on the <strong>Print version </strong>icon in the codebook header you can call up your PC's print functions and print out the code book.</p>\n</li>\n<li>\n<p>In the “Export” section of the codebook, you can download the codebook to your workstation. First set the desired character set, then choose the format – either CSV or Excel (xlsx) – and confirm with the <strong>Export </strong>button.</p>\n</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What is the purpose of the Codebook?</h3>\n<p class=\"wysiwyg-text-align-justify\">The Codebook provides an overview of all variables and encodings used in a project, helping with control information, filters, triggers, and survey result analysis.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">How can I access the Codebook?</h3>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Codebook</strong> menu item in the submenu for the respective function to open the Codebook in a new browser window.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">Can I edit variable names in the Codebook?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can edit variable names directly in the Codebook, use preset algorithms, or export and import variable names for external editing.</p>\n<h3 id=\"faq_4\" class=\"wysiwyg-text-align-justify\">Is it possible to display additional information in the Codebook?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, the Codebook offers various display options to show additional information such as filters, triggers, plausibility checks, and more.</p>\n<h3 id=\"faq_5\" class=\"wysiwyg-text-align-justify\">Can I export the Codebook?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can export the Codebook as a CSV or Excel (xlsx) file, or print it using the Print version icon.</p>",
    "user_segment_ids": []
}