{
    "id": 20370986894354,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370986894354.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370986894354-Lists",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:44:51Z",
    "updated_at": "2024-08-19T19:54:40Z",
    "name": "Lists",
    "title": "Lists",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T09:49:09Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information on creating and managing lists in a questionnaire system. It covers both dynamic and static lists, explaining how to create, edit, and incorporate them into questionnaires.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Lists are powerful tools for organizing and presenting answer options in questionnaires. This guide focuses on the creation and management of dynamic and static lists, as well as their integration into various question types.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#dynamic-lists\">Dynamic lists</a></li>\n<li><a href=\"#static-lists\">Static lists</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"dynamic-lists\" class=\"wysiwyg-text-align-justify\">Dynamic lists</h2>\n<p class=\"wysiwyg-text-align-justify\">Usually, the steps will take you from the source question to the dialog for list creation. However, you can also choose <strong>Questionnaire Editor</strong> → <strong>Lists </strong>and then either select an existing list or click on one of the buttons labeled <strong>Create dynamic list</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">Question types that are inappropriate for lists, such as e.g. simple text fields (141, 142) and the semantic differential (340), cannot be used as a source or target questions.</p>\n<h3 id=\"creating-the-source-question\" class=\"wysiwyg-text-align-justify\">Creating the Source Question</h3>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a question, enter the question and item texts as usual, and then confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>After that, click on the <strong>Assign to List </strong>button.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">You will be taken to the lists editor.</p>\n<h3 id=\"creating-a-dynamic-list\" class=\"wysiwyg-text-align-justify\">Creating a Dynamic List</h3>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the drop-down list, select the list into which you wish to insert the question items as list elements. In this case, however, as there is no existing list yet, you must select “New list” and confirm by clicking on <strong>Next</strong>.</p>\n</li>\n<li>\n<p>Give the new list an internal name.</p>\n</li>\n<li>\n<p>Specify a wildcard, in this example “TVchannel”. This wildcard will be used if the list is later inserted into the questionnaire or integrated into a loop. The name must be unique. It should contain only the letters a-z and A-Z, numbers, and “_”.</p>\n</li>\n<li>\n<p>In the “Source questions” section you can specify from which questions and static lists the elements of the new list are to be drawn. In the example enter the question just created in the drop-down list. After saving you can also add further questions or lists, however.</p>\n</li>\n<li>\n<p>In the “Properties of items from source question” section, which is only available with dynamic lists, you can specify whether and which properties and contents of source question items should be included in the list.</p>\n</li>\n<li>\n<p>In the “Output whole list in questionnaire” section you can decide how the list elements are to be strung together if they are output in the questionnaire using wildcards.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The list will now be created, and the dialog in which you can specify inclusion conditions will appear.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">The variables of source questions for list elements are marked with the <strong>L</strong> icon in the question view to indicate that they are accessed by a list.</p>\n<h3 id=\"adopting-item-specific-properties-from-source-questions\" class=\"wysiwyg-text-align-justify\">Adopting item-specific properties from source questions</h3>\n<p class=\"wysiwyg-text-align-justify\">Optionally, various item properties from source questions can be automatically adopted in the list. They can then be displayed with target questions in the editor but cannot be edited. Automatic property and content adoption are enabled when creating a new list or manually on the <strong>General settings</strong> tab in the list editor.</p>\n<p class=\"wysiwyg-text-align-justify\">The table provides an overview of available options.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 304.0px;\"> <col style=\"width: 456.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Option</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Adopt grouping of source questions in target questions</p>\n</td>\n<td>\n<p>Grouping is automatically adopted</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Adopt randomization at the item level from the source question in target questions</p>\n</td>\n<td>\n<p>If randomization is enabled for an item in the source question this setting is also adopted in the target question. Randomization is however performed anew and the state is not adopted from the source question (unless “Adopt ...randomization state” is also been enabled</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Adopt source question randomization state for target questions</p>\n</td>\n<td>\n<p>Randomization status of source question items is automatically adopted in target questions – i.e. items from the source questions are displayed to the respondent in the order seen in the source question. Static elements or other static lists contained in the same dynamic list are likewise placed above, below, or in between, according to their numbering.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Adopt wording from the source question in target questions</p>\n</td>\n<td>\n<p>The wording of the source and target question is automatically synchronized. Any change to the source question is automatically adopted in target questions.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Adopt images from the source question in target questions</p>\n</td>\n<td>\n<p>The images of the source and target question are automatically synchronized. Any change to the source question is automatically adopted in target questions.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Adopt item sequence from the source question in target questions</p>\n</td>\n<td>\n<p>The sequence of items in the source and target question is automatically synchronized. Any change to the source question is automatically adopted in target questions.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Adopt DAC at item level from the source question in target questions</p>\n</td>\n<td>\n<p>If DAC is enabled for an item in the source question this setting is also adopted in the target question.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"h_01J3YY8HMQRZ7G7EMHP8G1PYVD\" class=\"wysiwyg-text-align-justify\"> </h3>\n<h3 id=\"specifying-properties-of-the-list-elements\" class=\"wysiwyg-text-align-justify\">Specifying properties of the list elements</h3>\n<p class=\"wysiwyg-text-align-justify\">After you have created a list and made the general settings, the<strong> Inclusion conditions</strong> tab will appear. It lists the following information and setting options for each list element:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Variable name: The variable and label of the respective option in the source question.</p>\n</li>\n<li>\n<p>Editable text field: List element no.</p>\n</li>\n<li>\n<p>Fixed number: The sort number of the option in the source question.</p>\n</li>\n<li>\n<p>Source variable: The label used for the source variable in the source question.</p>\n</li>\n<li>\n<p>Type</p>\n</li>\n<li>\n<p>Inclusion conditions: The conditions under which the element concerned is displayed in a target question. The following chapters explain how to specify in advance inclusion conditions individually, for the entire list or for elements yet to be added.</p>\n</li>\n<li>\n<p>Output text: The text that will be output in the questionnaire. (If you are using the list in a loop, you can use wildcards to incorporate the list elements into the questionnaire. In this case, you can click on the links in the “Output text” column to open a dialog that allows you to create additional wildcards with alternate text versions.)</p>\n</li>\n</ul>\n<h3 id=\"specifying-inclusion-conditions-for-individual-list-elements\" class=\"wysiwyg-text-align-justify\">Specifying inclusion conditions for individual list elements</h3>\n<p class=\"wysiwyg-text-align-justify\">By making the appropriate settings in the drop-down lists in the “Inclusion condition” column, you can choose between the following options, separately for each element:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>if selected, always in list: If the respondent has chosen the list element from the source question, it will always be displayed from that point on.</p>\n</li>\n<li>\n<p>if not selected, always list element: If the respondent has not chosen the list element from the source question, it will always be displayed from that point on.</p>\n</li>\n<li>\n<p>always in list: The list element will always be displayed, even if the respondent has not chosen it from the source question.</p>\n</li>\n<li>\n<p>never in list: The element will never be displayed. This setting can be used for elements which are to appear only in the source question.</p>\n</li>\n<li>\n<p>in the list if...: As soon as you set this inclusion condition, an <strong>Edit</strong> icon will appear, allowing you to open the condition editor and define a filter condition.</p>\n</li>\n<li>\n<p>always in random selection</p>\n</li>\n<li>\n<p>if selected, always in random selection</p>\n</li>\n<li>\n<p>if not selected, always in random selection</p>\n</li>\n<li>\n<p>in random selection if...: As soon as you set this inclusion condition, an <strong>Edit</strong> icon will appear, allowing you to open the condition editor and define a filter condition.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">By default, the “if selected, always in list” option is preset.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on <strong>Save</strong> after you have completed your settings. Clicking on the <strong>Back</strong> <strong>to Editor</strong> menu item will take you back to the question view of the source question.</p>\n<p class=\"wysiwyg-text-align-justify\">Once the above-mentioned inclusion conditions have been processed, the size of the list can be used for filtering (variable <em>list_size_listID</em>).</p>\n<h3 id=\"specifying-global-inclusion-conditions\" class=\"wysiwyg-text-align-justify\">Specifying global inclusion conditions</h3>\n<p class=\"wysiwyg-text-align-justify\">Alternatively, you can also define or change all inclusion conditions with a single click.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To do so, click the <strong>Define global inclusion conditions</strong> button.</p>\n</li>\n<li>\n<p>Select the desired condition in the pop-up that opens.</p>\n</li>\n<li>\n<p>When you select a condition that requires a detailed definition, the<strong> Edit</strong> icon is activated in the “Actions” column. Define the condition in the condition editor. You can use the #varname# and #code# wildcards to do so.</p>\n</li>\n<li>\n<p><strong>Save</strong> the settings. All list inclusion conditions are now changed accordingly.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">#varname#: Wildcard available for selection in the “Variables” selection field. It is respectively replaced in the various list elements by the name of the variable assigned to the list element in the source question.</p>\n<p class=\"wysiwyg-text-align-justify\">#code# Can be entered in the “Code” field. It is replaced in the various list elements by the code the list element has in the source question.</p>\n<h3 id=\"defining-the-default-setting-for-all-new-list-elements\" class=\"wysiwyg-text-align-justify\">Defining the default setting for all new list elements</h3>\n<p class=\"wysiwyg-text-align-justify\">You can define in advance which inclusion conditions newly created list elements shall have by default in dynamic lists. To do so, select the desired preset from the “Advanced options” section in the Inclusion Conditions tab and then Save. If you select a complex condition you can, as described above, open the condition editor and formulate the condition in generalized terms using the #varname# and #code# wildcards.</p>\n<p class=\"wysiwyg-text-align-justify\">The inclusion conditions are used to set the conditions under which elements are generally added to the list. Before outputting the list as a concrete question you can set up further restrictions and carry out sorting rules. Click the <strong>Options </strong>icon to find the appropriate setting options in the question view of the list of questions.</p>\n<p class=\"wysiwyg-text-align-justify\">The special options cannot be used in questions with groupings.</p>\n<h3 id=\"selecting-list-elements\" class=\"wysiwyg-text-align-justify\">Selecting List Elements</h3>\n<p class=\"wysiwyg-text-align-justify\">The following selection possibilities are available to you:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select [n] elements at random from the list: You can set the number of elements that can be selected.</p>\n<ul>\n<li>\n<p>Please mind: This random selection is applied only to elements with inclusion conditions “if selected, always in random selection”, “in random selection if ...” and “always in random selection”.</p>\n</li>\n<li>\n<p>Configure extended random selection: You can make the random selection dependent on the number of elements chosen by the participant.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Select only the [n] elements with the highest / lowest code value: These options apply to the code that you assigned to the items of each question. This option is only suitable for single-response questions or matrix questions. With a multiple response or a select box matrix, the code can only take on the values of 0 (not selected) and 1 (selected), therefore the use of this question type is senseless.</p>\n</li>\n</ul>\n<h3 id=\"sorting-the-remaining-list-elements\" class=\"wysiwyg-text-align-justify\">Sorting the remaining list of elements</h3>\n<p class=\"wysiwyg-text-align-justify\">The following sorting options are available to you, by default it is set to “unsorted”.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Unsorted (default setting)</p>\n</li>\n<li>\n<p>Sorted numerically according to answers in the source question (ascending/descending): Sorting is done based on entries made by respondents in source questions with text fields.</p>\n</li>\n<li>\n<p>Sorted alphabetically according to answers in the source question (ascending/descending): Sorting is done based on entries made by respondents in source questions with text fields.</p>\n</li>\n<li>\n<p>Sorted alphabetically by list element label (ascending/descending): It will be sorted by list element label.</p>\n</li>\n</ul>\n<h3 id=\"extended-random-selection-of-list-element\" class=\"wysiwyg-text-align-justify\">Extended Random Selection of List Element</h3>\n<p class=\"wysiwyg-text-align-justify\">You can make the random selection, which was introduced in the previous chapter, dependent on the number of elements chosen by the participant. </p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Extended random selection</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Extended random selection can only be used in combination with the following types of inclusion conditions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>if selected, always in a random selection</p>\n</li>\n<li>\n<p>in random selection if ...</p>\n</li>\n<li>\n<p>always in a random selection</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Configuring extended random selection</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Options </strong>button in the page view of the desired questionnaire page.</p>\n</li>\n<li>\n<p>Among the random selection options you already know, you will find the <strong>Configure extended random selection </strong>button. Clicking on the button will open the condition editor.</p>\n</li>\n<li>\n<p>Enter the desired condition and confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>If required, you can define additional conditions which will be processed in the order you define.</p>\n</li>\n<li>\n<p>Return to the “Options” dialog by clicking on <strong>Back</strong>.</p>\n</li>\n<li>\n<p>If you click on the <strong>Info </strong>icon, the condition will be displayed. This icon will also appear in the question view.</p>\n</li>\n</ol>\n<h3 id=\"incorporating-dynamic-lists-into-questions\" class=\"wysiwyg-text-align-justify\">Incorporating dynamic lists into questions</h3>\n<p class=\"wysiwyg-text-align-justify\">The list function offers you the possibility to incorporate static and dynamic lists into your questionnaire by using questions.</p>\n<h3 id=\"incorporating-dynamic-lists\" class=\"wysiwyg-text-align-justify\">Incorporating Dynamic Lists</h3>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a page titled in the Questionnaire Editor, and create a question of the “Multiple response list (vertical)” type (type 121).</p>\n</li>\n<li>\n<p>All question types in which using lists is advisable contain the “Dynamic answers” section. Later, if a list has been integrated, this section can optionally be hidden.</p>\n</li>\n<li>\n<p>Clicking on the <strong>(No list selected yet) </strong>link allows you to select a list.</p>\n</li>\n<li>\n<p>Select the corresponding list and confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Click on the <strong>&lt;&lt; </strong>icon to return to the question you are editing. Here you will find the elements of the selected list in the “Dynamic answers” area.</p>\n</li>\n<li>\n<p>Depending on the target question type, item-specific functionalities such as randomization, grouping, and DAC are available with dynamic list elements. If desired, you can set these separately for each target question. Alternatively, you can also adopt the settings from the source question.</p>\n</li>\n<li>\n<p>You have the choice of</p>\n<ul>\n<li>\n<p>offering only list elements as answer options. In this case, you should tick the “Delete” checkbox for all other answer options and then click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>offering list elements as well as standard answer options. In this case, you can change the positions of the elements by changing their numbering. Then click on <strong>Save</strong>.</p>\n</li>\n</ul>\n</li>\n</ol>\n<h3 id=\"outputting-lists-in-the-questionnaire\" class=\"wysiwyg-text-align-justify\">Outputting lists in the questionnaire</h3>\n<p class=\"wysiwyg-text-align-justify\">You can output entire lists in the questionnaire, e.g. to issue a confirmation to respondents of what they have selected. If you use this feature, the output will be subject to the inclusion conditions defined for the list, i.e. if you have specified, for example, a dynamic list and the inclusion condition “if selected, always in the list”, the selected elements will be output via wildcard.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The list-ID (#1_xxx#) serves as a wildcard.</p>\n</li>\n<li>\n<p>You can specify which general separator to use and the separator between the last two elements of the list.</p>\n</li>\n<li>\n<p>You can define alternative labeling for the list elements.</p>\n</li>\n<li>\n<p>It is not possible to use this wildcard to output list elements, which come from the multimedia question types 511 and 521: Instead of images, the related alternative texts will be output. However, if you use HTML to incorporate images directly into the items of a list source question, these images will be output.</p>\n</li>\n</ul>\n<h3 id=\"viewing-the-list-id-and-inserting-it-into-questionnaires\" class=\"wysiwyg-text-align-justify\"><strong>Viewing the list ID and inserting it into questionnaires</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You will find the list ID in the overview of the Lists menu. Using the form “#l_xxx#”, insert this list ID into the desired position in the questionnaire text, where it will serve as a wildcard.</p>\n<h3 id=\"specifying-separators\" class=\"wysiwyg-text-align-justify\"><strong>Specifying separators</strong></h3>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the menu <strong>Lists</strong>, select the desired list, and then open the <strong>General settings </strong>tab.</p>\n</li>\n<li>\n<p>Enter the usual separator into the “Separator between list elements” field. If necessary, enter blank spaces before and after the separator as well. </p>\n</li>\n<li>\n<p>If you wish to use a special separator before the last element in the listing (e.g. the word “and” or &lt;br&gt;), enter this separator into the field entitled “Separator right before the last list element”.</p>\n</li>\n<li>\n<p>After that, confirm by clicking on <strong>Save</strong>.</p>\n</li>\n</ol>\n<h3 id=\"changing-list-element-labels\" class=\"wysiwyg-text-align-justify\">Changing list element labels</h3>\n<p class=\"wysiwyg-text-align-justify\">You can change the labels of the list elements displayed.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Define the required sets of text elements on the <strong>Wildcard </strong>tab as will be familiar from loops.</p>\n</li>\n<li>\n<p>These alternative sets are imported via wildcards with the format #listID_x#. That is, the second set of text elements in the first list of the project (list ID 1) is output via #1_1_2#.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To translate the separators and wildcards in multilingual projects, find the list in the overview of the <strong>Questionnaire editor</strong> → <strong>Lists </strong>menu, click on the <strong>Globe </strong>icon and use the <strong>View </strong>button to open the text elements of the desired languages.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"static-lists\" class=\"wysiwyg-text-align-justify\">Static lists</h2>\n<p class=\"wysiwyg-text-align-justify\">You can click on <strong>Questionnaire editor</strong> → <strong>Lists </strong>and then either select an existing list or click on the buttons labeled <strong>Create static list</strong> to create a new list.</p>\n<h3 id=\"creating-a-static-lists\" class=\"wysiwyg-text-align-justify\">Creating a static lists</h3>\n<p class=\"wysiwyg-text-align-justify\">A static list is not composed using the items of source questions or source lists, but the list elements are directly entered.</p>\n<p class=\"wysiwyg-text-align-justify\">Open the <strong>Questionnaire editor</strong> → <strong>Lists </strong>menu and click on the <strong>Create static list </strong>button.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Give the new list an internal name, in this example “Subjects”.</p>\n</li>\n<li>\n<p>Enter a wildcard.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The <strong>List elements </strong>tab will be opened automatically.</p>\n<ul>\n<li>\n<p>To create a new list element, enter its name in the “New element” row.</p>\n</li>\n<li>\n<p>Then, confirm each entry by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"specifying-properties-of-the-list-elements-1\" class=\"wysiwyg-text-align-justify\">Specifying properties of the list elements</h3>\n<p class=\"wysiwyg-text-align-justify\">In the case of static lists, you also specify the inclusion conditions for the list elements on the<strong> List elements</strong> tab, in the “Inclusion conditions” column.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>always in list</p>\n</li>\n<li>\n<p>never in list</p>\n</li>\n<li>\n<p>in list if...</p>\n</li>\n<li>\n<p>always in random selection</p>\n</li>\n<li>\n<p>in random selection if...</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">By default, the “always in list” option is preset. Alternatively, you can also define or change all inclusion conditions at once, using the <strong>Define global inclusion conditions</strong> function, as described above. If the static list is to be used in a loop at a later time, you can use the Wildcards tab to set up several wildcards with alternate texts.</p>\n<h3 id=\"editing-and-exporting-list-elements\" class=\"wysiwyg-text-align-justify\">Editing and exporting list elements</h3>\n<p class=\"wysiwyg-text-align-justify\">List elements that have already been created will be output in the input field and can then be edited. If you wish to delete an element, simply remove it from the list.</p>\n<p class=\"wysiwyg-text-align-justify\">External editing is also possible:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Copy the content of the input field into Excel.</p>\n</li>\n<li>\n<p>Should Excel copy the data into a cell instead of formatting it correctly, select <strong>Data</strong> →<strong> Text to Columns</strong>. Choose the data type “Delimited”, and confirm by clicking on <strong>Next</strong>.</p>\n</li>\n<li>\n<p>Choose the separator, and confirm by clicking on <strong>Next</strong> again.</p>\n</li>\n<li>\n<p>Check the display, and then confirm by clicking on <strong>Finish</strong>.</p>\n</li>\n</ul>\n<h3 id=\"importing-static-list-elements\" class=\"wysiwyg-text-align-justify\">Importing static list elements</h3>\n<p class=\"wysiwyg-text-align-justify\">You can import the elements of static lists or copy out elements that have already been created in a special format, edit them externally and then reimport them.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Formatting import data</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following format should be used:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>List element ID</p>\n</li>\n<li>\n<p>list element number</p>\n</li>\n<li>\n<p>wildcard 1</p>\n</li>\n<li>\n<p>wildcard 2</p>\n</li>\n<li>\n<p>wildcard 3</p>\n</li>\n<li>\n<p>wildcard 4</p>\n</li>\n<li>\n<p>wildcard 5</p>\n</li>\n<li>\n<p>inclusion condition</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The inclusion conditions must be encoded as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>1: always in list</p>\n</li>\n<li>\n<p>2: never in list</p>\n</li>\n<li>\n<p>3: in list if...</p>\n</li>\n<li>\n<p>4: always in random selection</p>\n</li>\n<li>\n<p>6.: in random selection if...</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can create lists with an appropriate format, e.g. in MS Excel.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Performing the import</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Navigate to the <strong>Projects</strong> → {Selected project} → <strong>Questionnaire editor</strong> → <strong>Lists</strong> menu, and create a new static list. Open the <strong>List elements</strong> tab. Instead of creating elements manually, you can click on the<strong> Import list elements</strong> button.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select the desired separator, and enter the elements in the correct format. If you have created an Excel table, transfer the content, but not the column labels, using copy &amp; paste.</p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Import</strong>.</p>\n</li>\n<li>\n<p>Click on the <strong>List elements</strong> tab to switch to the overview of the list elements that have been created.</p>\n</li>\n</ul>\n<h3 id=\"incorporating-static-lists-into-the-questionnaire\" class=\"wysiwyg-text-align-justify\">Incorporating Static Lists into the questionnaire</h3>\n<p class=\"wysiwyg-text-align-justify\">The list function offers you the possibility to incorporate static and dynamic lists into your questionnaire by using questions.</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a page titled in the Questionnaire Editor, and create a question of the “Multiple response list (vertical)” type (type 121).</p>\n</li>\n<li>\n<p>All question types in which using lists is advisable contain the “Dynamic answers” section. Later, if a list has been integrated, this section can optionally be hidden.</p>\n</li>\n<li>\n<p>Clicking on the <strong>(No list selected yet) </strong>link allows you to select a list.</p>\n</li>\n<li>\n<p>Select the corresponding list and confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Click on the <strong>&lt;&lt; </strong>icon to return to the question you are editing. Here you will find the elements of the selected list in the “Dynamic answers” area.</p>\n</li>\n<li>\n<p>Depending on the target question type, item-specific functionalities such as randomization, grouping and DAC are available with dynamic list elements. If desired, you can set these separately for each target question. Alternatively, you can also adopt the settings from the <a href=\"https://qbdocs.atlassian.net/wiki/spaces/TD/pages/2148565069/Dynamic+Lists#Creating-the-Source-Question\">source question</a>.</p>\n</li>\n<li>\n<p>You have the choice of</p>\n<ul>\n<li>\n<p>offering only list elements as answer options. In this case, you should tick the “Delete” checkbox for all other answer options and then click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>offering list elements as well as standard answer options. In this case, you can change the positions of the elements by changing their numbering. Then click on <strong>Save</strong>.</p>\n</li>\n</ul>\n</li>\n</ol>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRTV8X3QJVZ8XBXNV\">What's the difference between dynamic and static lists?</h3>\n<p>Dynamic lists are composed using items from source questions or other lists, while static lists have elements directly entered by the user.</p>\n<h3 id=\"h_01HGKSMPRTYX3QJVZ8XBXNW\">Can I edit list elements after creation?</h3>\n<p>Yes, you can edit both dynamic and static list elements after creation. For static lists, you can also import and export elements for external editing.</p>\n<h3 id=\"h_01HGKSMPRV28X3QJVZ8XBXNX\">How can I use lists in loops?</h3>\n<p>Both dynamic and static lists can be used in loops. You can set up wildcards with alternate texts for list elements to be used in loop questions.</p>",
    "user_segment_ids": []
}