{
    "id": 20370729621906,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370729621906.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370729621906-Messages-Quick-Polls-and-Tasks",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": -1,
    "vote_count": 1,
    "section_id": 20234598507282,
    "created_at": "2024-07-25T16:22:07Z",
    "updated_at": "2024-08-21T12:25:58Z",
    "name": "Messages, Quick Polls and Tasks",
    "title": "Messages, Quick Polls and Tasks",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T08:41:33Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers three main topics: Messages between panelists, Quick Polls, and Tasks. It provides detailed information on how to set up and manage these features in an EFS panel environment.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on enhancing panel communication and engagement through private messaging, quick polls, and customizable tasks. It provides step-by-step instructions for moderators and administrators to implement and manage these features effectively.</p>\n<ul>\n<li><a href=\"#messages-from-panelists-to-panelists\">Messages From Panelists to Panelists</a></li>\n<li><a href=\"#reporting-spam\">Reporting Spam</a></li>\n<li><a href=\"#quick-polls\">Quick Polls</a></li>\n<li><a href=\"#tasks\">Tasks</a></li>\n</ul>\n<h1 id=\"messages-from-panelists-to-panelists\" class=\"sc-chbbiW dCajGG wysiwyg-text-align-justify\">Messages From Panelists to Panelists</h1>\n<p class=\"wysiwyg-text-align-justify\">Community panels are characterized by the fact that panelists may not only communicate with the moderator but also among themselves. For this, EFS provides a variety of channels such as forums, discussions, chats, and blogs. You can also enable your panelists to send each other private messages via e-mail.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The messages are entered into a form on the website.</li>\n<li>The addressees can read the messages on a special panel page; additionally, the messages are sent via e-mail.</li>\n<li>The messages sent via e-mail are embedded in an accompanying text that you can define via a mail template.</li>\n<li>For reasons of privacy, it is possible to write only to panelists who have explicitly agreed to receive private messages.</li>\n<li>As a moderator, you can use the messaging functionality as well, of course. If you want to address panelist groups instead of individual persons, a dedicated feature in the admin allows you to post messages on the panel website without dispatching emails.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In order to use the function for sending private messages, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Adapt the default mail template.</li>\n<li>Create function modules for entry form and list of messages received.</li>\n<li>Configure the visibility options and/or allow them to be edited by the panelists.</li>\n<li>Integrate panelist messages into the website.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The necessary operations will be explained in detail in the following chapters.</p>\n<h2 id=\"adapting-the-default-mail-template-with-accompanying-text\" class=\"wysiwyg-text-align-justify\"><strong>Adapting the Default Mail Template With Accompanying Text</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The messages are not only displayed on a special panel page but also sent via e-mail. These e-mails are dispatched from a panel domain. They usually contain not just the actual text of the message, but also an accompanying text by the panel operator. Here you can, for example, indicate that this is a personal message, or you can include an e-mail address to contact in case this function has been misused.</p>\n<p class=\"wysiwyg-text-align-justify\">The properties of these mails are defined, as is the case with many other EFS features, via a mail template which is then linked to from the function module. In new panels, you can find a default template “Message from panelist to panelist”: all you need to do is to adapt this template for your panel and reference it from the “Send private messages to panelists” page module on the “Send messages” page.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The template should be of the “standard mail” type.</li>\n<li>For the sender, you should use a dedicated e-mail address of the panel domain. Please note that it is not possible to dynamically insert different sender addresses. In particular, it is not possible to use the e-mail addresses of the mailing panelists.</li>\n<li>The following wildcards can be used:<br>– #sender_u_firstname#: The sender’s first name<br>– #sender_u_name#: The sender’s last name<br>– #message_title#: The message header<br>– #message_text#: The message text</li>\n<li>The template should always mention an e-mail address or contact form for abuse cases.</li>\n</ul>\n<h2 id=\"configuring-the-visibility-options\" class=\"wysiwyg-text-align-justify\"><strong>Configuring the Visibility Options</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">For reasons of privacy, it is possible to write only to panelists who have explicitly agreed to receive private messages, i.e. the visibility option “Receive private messages” must be activated. Depending on which processes and privacy policies apply to your panel, this is the responsibility of either the moderator or the panelist.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want to encourage your panelists to make use of the private messaging function, you should explain how to activate the visibility option “Receive private messages” in a suitable location. For example, you can introduce the new function in a forum post or create a FAQ.</p>\n<h2 id=\"sending-messages-to-panelists\" class=\"wysiwyg-text-align-justify\"><strong>Sending Messages to Panelists</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">As a moderator, you can use the messaging functionality as well, of course. If you want to address panelist groups instead of individual persons, a dedicated feature in the admin area allows you to send messages that are displayed in the inbox on the website but not dispatched by e-mail.</p>\n<p class=\"wysiwyg-text-align-justify\">You can find the new feature in the admin area in the menu <strong>People → Contacts → Messages</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Similar to other moderation features, moderator and test accounts can be selected as senders. Please ensure that visibility is activated for the first name and/or name of the used account. Otherwise, the recipients may have problems understanding who sent the message.</li>\n<li>All groups of the panel can be addressed.</li>\n<li>The dispatched messages are logged.</li>\n<li>Both this new messaging function and read access to the panelists’ private messages in the admin area are protected by ACL rights (“panel_send_private_message” and “panel_view_private_message”).</li>\n</ul>\n<h2 id=\"integrating-panelist-messages-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating Panelist Messages into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">To create the entry form for the messages, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Send private messages to panelists” type.</li>\n<li>Configure the setting options as required. Table 19.30 provides an overview.<br>– Select the “func_messages_send” module template. You may have to adapt the templates to the layout of your panel.<br>– Select the appropriate mail template with the accompanying text.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">To create a message list, proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Display of private messages” type.</li>\n<li>Configure the setting options as required.</li>\n<li>Depending on the type of list you want to display, select one of the following module templates. You may have to adapt the templates to the layout of your panel.<br>– func_messages_light: Message overview, e.g. on the personalized homepage.<br>– func_messages: Detailed list of the received messages.</li>\n</ol>\n<h1 id=\"reporting-spam\" class=\"sc-chbbiW dCajGG wysiwyg-text-align-justify\">Reporting Spam</h1>\n<p class=\"wysiwyg-text-align-justify\">Unsolicited advertising, disrespectful posts, and other forms of inappropriate content are a widespread problem in Internet forums. Experience shows that the smaller and more personal the community is, and the more experienced the team of moderators is, the less frequent such spam and abuse problems occur. Consequently, they arise only rarely in EFS Panel communities. To enable you to identify and counter any such problem cases in a timely and effective manner, EFS includes a spam reporting function. This allows panelists to report abusive posts themselves; instead of closely monitoring all discussions on the platform or checking all posts before release, you can rely on the community‘s powers of self-organization.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>From any blog, forum, or discussion post, panelists can open a dedicated form and report abusive content.</li>\n<li>You can access and process the abuse reports received in the admin area.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Usage of the report feature involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Preparing the report form for use.</li>\n<li>Processing the abuse reports regularly.</li>\n</ul>\n<h2 id=\"preparing-the-report-form-for-use\" class=\"wysiwyg-text-align-justify\"><strong>Preparing the Report Form for Use</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In a new standard panel, the abuse reporting process is integrated into the website per default. Blog, forum, and discussion posts contain a <strong>Report</strong> icon. By clicking on this, the panelists can open the report form and enter their abuse report.</p>\n<p class=\"wysiwyg-text-align-justify\">To complete the configuration of the process, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>In the website editor, select the appropriate website and language version and open the page “Report post”. It contains a module of type “Send private messages to panelists”.</li>\n<li>Configure the setting options as required. Table 19.36 provides an overview.<br>– The “func_report_form” module template should be selected.<br>– In the “Mail sender” field, enter the wildcard #u_email#: It will be filled with the e-mail address of the panelist who sends the report.<br>– Enter a suitable feedback topic and recipient address.</li>\n</ol>\n<h2 id=\"processing-abuse-reports\" class=\"wysiwyg-text-align-justify\"><strong>Processing Abuse Reports</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>People → Contacts → Reported posts</strong> menu you will find all abuse reports received.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Per default, only the open reports are shown. To display reports with other statuses, please use extended search.</li>\n<li>The tab <strong>Frequently Reported Posts</strong> displays the open reports grouped by target post. I.e. if there are several open reports for a post, you will notice at first glance.</li>\n<li>If a post has been reported repeatedly, you can change the processing status of all these reports en bloc. To do so, open one of the reports, change the status and editor, and add your comment. Then, before Saving, activate the “Batch processing” checkbox. This will ensure that your status change is applied to all reports for the respective target post.</li>\n</ul>\n<h1 id=\"quick-polls\" class=\"wysiwyg-text-align-justify\">Quick Polls</h1>\n<p class=\"wysiwyg-text-align-justify\">So-called polls are a vote on individual questions for which the results are always immediately displayed. Polls can, for example, be integrated into the home page of the panel.</p>\n<p class=\"wysiwyg-text-align-justify\">EFS supports two types of polls: polls for panelists on the one hand, and anonymous polls which allow all visitors of the home page to contribute on the other hand.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">You can create as many quick polls as required. Please mind, though, that panelist polls, in particular, require considerable server resources, i.e. they may affect the performance of the panel installation: For each participant, an answer must be stored, i.e. for n respondents, n new data records are created. The following guiding values provide orientation:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>It is recommended to run not more than ten active quick polls per language version simultaneously.</li>\n<li>It is recommended to restrict the participation for a quick poll to at most 10,000 participants, e.g. by restricting the field time appropriately.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Tip: After the end of the field period, export the results of the panelist polls, then delete the poll or at least the results.</p>\n<h2 id=\"anonymous-quick-polls-and-panelists-only-polls\" class=\"wysiwyg-text-align-justify\"><strong>Anonymous Quick Polls and Panelists-Only Polls</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">EFS supports two types of polls that are fundamentally different in terms of authentication and retrievable data.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Polls for panelists:\n<ul>\n<li>These polls are visible to all visitors having access to the respective page. However, only logged-in panelists may participate.</li>\n<li>\n<p>As the panelists have identified themselves by logging in, the poll data can be related to the individual panelists' accounts. So, in addition to viewing the poll results, you can also export them along with the corresponding panelist data.</p>\n</li>\n<li>\n<p>The quick poll filter allows you to use the results from panelist polls for grouping purposes.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Anonymous polls:</p>\n<ul>\n<li>\n<p>Anonymous polls can be answered by any visitor.</p>\n</li>\n<li>\n<p>Participation is registered by cookies, i.e. if a visitor rejects or deletes cookies, he or she may participate multiple times. This also applies to logged-in panelists answering an anonymous quick poll. If, on the other hand, two visitors use the same browser on the same PC without deleting cookies, the second visitor will not be recognized as a new user and he cannot answer the quick poll.</p>\n</li>\n<li>\n<p>As you do not know the participants in anonymous quick polls, you may view the results but there is no possibility of exporting the participants’ responses along with the corresponding panelist data as is the case in panelist polls.</p>\n</li>\n<li>\n<p>For the same reason, the results from anonymous quick polls are not available in the quick poll filter for grouping purposes.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"managing-polls\" class=\"wysiwyg-text-align-justify\"><strong>Managing Polls</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Website → Panel websites → {Selected language version} → Quick polls</strong> menu you can set up polls, edit them, and view the results.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Read rights for “panel_quickpolls” are needed for managing the quick polls.</p>\n<p class=\"wysiwyg-text-align-justify\">The overview comprises all the quick polls created for the defined language version and contains the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Title: Internal title.</li>\n<li>Headline: Headline seen by the panelists.</li>\n<li>Active:\n<ul>\n<li>Yes: The poll will be displayed.</li>\n<li>No: The poll will not be displayed.</li>\n</ul>\n</li>\n<li>Type: Question type</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want to view quick polls of another language version in a given installation with several websites and/or language versions, simply change the settings in the upper section of the dialog. You can use the View function to change the number of table columns displayed as well as the number of rows per page. A simple search function is available.</p>\n<p class=\"wysiwyg-text-align-justify\">The icons in the “Actions” column give the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Edit</li>\n<li>Copy poll</li>\n<li>View results</li>\n<li>Only for panelist polls: Export participant answers</li>\n<li>Delete</li>\n</ul>\n<h2 id=\"creating-a-new-poll\" class=\"wysiwyg-text-align-justify\"><strong>Creating a New Poll</strong></h2>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Click on the <strong>Create poll</strong> button in the <strong>Quick Polls</strong> menu.</li>\n<li>Fill in the form. The most important fields are listed below. Optionally, you can activate the rich text editor and use it to format the texts.<br>– Allow participation for non-panelists: This option enables you to decide if only logged-in panelists can participate, or if the poll should be anonymous i.e. can be answered by non-panelists as well. Please mind that with anonymous quick polls, you have fewer possibilities for evaluation. Notably, the result data cannot be matched to panelists. The poll type setting cannot be changed later.<br>– Title: This title is for orientation purposes only, it will not be seen by panelists.<br>– Question text: The actual question.<br>– Text on the display of results: This message is displayed after successful voting. Enter the following text, for example: “Thank you for voting!”<br>– Error message when invalid answers are given: This message is displayed if a problem occurs on saving and, as a result, the answer is deemed invalid. Enter the following text, for example: “Only once, please”.<br>– Maximum scale of results display: In this field, you can define how broad, in percent, result bars may be in relation to the complete breadth of the poll table. Enter: “100”.<br>– Question type: You can choose between single or multiple response lists.<br>– Active: Only active polls will be displayed. If you wish to see your poll on the website, select “Yes” and deactivate all other polls of the current language version once you have saved the setting.</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Open the new poll by clicking on the title or the <strong>Edit</strong> icon.</p>\n</li>\n<li>\n<p>In the lower section of the edit dialog you will find the new section “Answer options”. Enter the first answer text and <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Repeat this for all required answer options.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">For installations with several websites and/or language versions, please note: The language version of a new quick poll is automatically predefined by the overview settings. The language version cannot be subsequently changed.</p>\n<h2 id=\"properties-of-a-poll\" class=\"wysiwyg-text-align-justify\"><strong>Properties of a Poll</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the characteristics a poll can have.</p>\n<table class=\"relative-table wysiwyg-text-align-justify\" style=\"width: 95.8416%; margin-right: auto; margin-left: auto;\" border=\"1\">\n<colgroup> <col style=\"width: 13.9555%;\"> <col style=\"width: 17.0596%;\"> <col style=\"width: 68.99%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Fields</th>\n<th class=\"wysiwyg-text-align-center\">Wildcard</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>\n<p>Allow participation for non-panelists</p>\n</td>\n<td> </td>\n<td>\n<p>There are two types of polls:</p>\n<ul>\n<li>Panelist polls: Only logged-in panelists can participate.</li>\n<li>Anonymous polls: They can be answered by non-panelists as well.</li>\n</ul>\n<p>With anonymous quick polls, you have fewer possibilities for evaluation. Notably, the result data cannot be matched to panelists.</p>\n</td>\n</tr>\n<tr>\n<td>Title</td>\n<td> </td>\n<td>\n<p>The internal poll title. This title may not contain special characters.</p>\n<p>Optionally, you can enter the internal title in the external view via a wildcard.</p>\n</td>\n</tr>\n<tr>\n<td>Question text</td>\n<td>\n<p>{$poll.poll_question}</p>\n</td>\n<td>\n<p>The actual question, for example: “Who do you think will win the World Cup?”</p>\n<p>Optionally, you may design your text using the rich text editor.</p>\n</td>\n</tr>\n<tr>\n<td>Headline</td>\n<td>{$poll.poll_header}</td>\n<td>\n<p>Optional explanatory text.</p>\n<p>Is displayed in the standard panel below the question text.</p>\n<p>Optionally, you may design your text using the rich text editor.</p>\n</td>\n</tr>\n<tr>\n<td>Footer</td>\n<td>{$poll.poll_footer}</td>\n<td>\n<p>Optional text element, which is displayed in the lower section of the poll.</p>\n<p>Optionally, you may design your text using the rich text editor.</p>\n</td>\n</tr>\n<tr>\n<td>Text on results display</td>\n<td> </td>\n<td>\n<p>Text that is optionally displayed after voting. E.g. “Thank you for voting!”</p>\n<p>Optionally, you may design your text using the rich text editor.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Maximum scale of results display</p>\n</td>\n<td> </td>\n<td>\n<p>Defines how broad result bars may be in relation to the</p>\n<p>complete breadth of the poll table. The entry is in percent.</p>\n</td>\n</tr>\n<tr>\n<td>Question type</td>\n<td> </td>\n<td>\n<p>Desired question type. You can choose between single or multiple response lists.</p>\n</td>\n</tr>\n<tr>\n<td>Active</td>\n<td> </td>\n<td>\n<p>Only active polls will be displayed.</p>\n<p>If several polls are active in a language version, use the “Display quick poll” option in the “Quick Poll” function module to define which of them should be displayed.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Start date / End date for participations</p>\n</td>\n<td> </td>\n<td>\n<p>You can define a participation period. Outside this period, the poll is visible, but participation is only possible during the participation period.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"viewing-results\" class=\"wysiwyg-text-align-justify\"><strong>Viewing Results</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The edit dialog of a poll contains a <strong>View results</strong> button with which you can open the result overview.</p>\n<p class=\"wysiwyg-text-align-justify\">You can delete the results by clicking on <strong>Delete results</strong>. Please note that by doing so the poll results are deleted irrevocably.</p>\n<h2 id=\"downloading-results-of-panelist-polls\" class=\"wysiwyg-text-align-justify\"><strong>Downloading Results of Panelist Polls</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In normal, personalized polls, the Export Participant Answers function allows you to download a CSV file that contains selected address data and the answers of each participant.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Write rights for “panel_quickpolls” are needed for using the export.</p>\n<h1 id=\"tasks\" class=\"sc-dliRfk eKiWTu wysiwyg-text-align-justify\">Tasks</h1>\n<p class=\"wysiwyg-text-align-justify\">Experienced community managers appreciate the broad range of feedback methods offered by EFS: It allows them to switch elegantly between various quantitative and qualitative methods. Freely definable tasks are an additional component of your methodological portfolio.</p>\n<p class=\"wysiwyg-text-align-justify\">A task can be any activity that can be connected with a click on a link in the to-do list. It is up to your creativity to define challenging tasks for your panelists. E.g. you can send your panelists to any panel page or external website, you can ask them to open a forum, etc.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The addressees of the task are defined by the combination of language version and group.</p>\n</li>\n<li>\n<p>The tasks are integrated into the panelists’ to-do list.</p>\n</li>\n<li>\n<p>Social Insight Connect’s to-do counter includes the new tasks as well.</p>\n</li>\n<li>\n<p>Allocation of bonus points is triggered by clicking the link.</p>\n</li>\n<li>\n<p>To find out if a specific panelist has completed tasks, search for this panelist in panelists administration, open the detail view, and go to the Tasks tab.</p>\n</li>\n</ul>\n<h2 id=\"managing-tasks\" class=\"wysiwyg-text-align-justify\"><strong>Managing Tasks</strong></h2>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Write rights for “panel_custom_item” are needed for managing tasks.</p>\n<p class=\"wysiwyg-text-align-justify\">Tasks for panelists are managed in the <strong>Website → Standard content → Tasks</strong> menu. In this menu you get an overview of existing tasks, you can check how many reactions have been registered and you can create new tasks.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The overview lists all existing tasks with title, teaser, author, and publication period. Two columns are of special importance for your daily work:<br>– Active: The traffic sign icon shows if the tasks are displayed.<br>– Completed: This column shows how many invitees have already completed the task.</li>\n<li>Via the <strong>Add</strong> button, you can access the dialog that allows you to create a new task.</li>\n<li>Click on the icons in the “Actions” column to<strong> Edit</strong> or <strong>Delete</strong> existing tasks.</li>\n<li>You can search the content of the overview table. The advanced search allows you to selectively search by title, teaser, author, and language version.</li>\n</ul>\n<h2 id=\"properties-of-tasks\" class=\"wysiwyg-text-align-justify\"><strong>Properties of Tasks</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The table lists all properties tasks can have.</p>\n<table class=\"relative-table wysiwyg-text-align-justify\" style=\"width: 99.901%;\" border=\"1\">\n<colgroup> <col style=\"width: 13.8327%;\"> <col style=\"width: 86.1723%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Title (internal)</td>\n<td>\n<p>Internal title of the task. For orientation purposes only, it will not be seen by panelists.</p>\n</td>\n</tr>\n<tr>\n<td>Teaser</td>\n<td>\n<p>Header displayed in the to-do list.</p>\n<p>In the example shown below: “Sign up...”</p>\n</td>\n</tr>\n<tr>\n<td>Content</td>\n<td>\n<p>In this field, you can explain the task in detail.</p>\n<p>In the example shown below: “Interested? Click below...”</p>\n<p>The following wildcards can be used in teaser and content: #u_account# #u_firstname# #u_name# #u_email# #u_www# #u_street# #u_city##u_zip# #u_country# #u_address# #u_address2# #u_address3# #u_gender#</p>\n</td>\n</tr>\n<tr>\n<td>Link</td>\n<td>\n<p>In a standard panel, this link is opened when clicking on the teaser or the <strong>Continue</strong> icon. The click is considered as the completion of the task and triggers the allocation of bonus points.</p>\n<p>Please enter the appropriate URL, starting with either http:// oder https://</p>\n</td>\n</tr>\n<tr>\n<td>Image</td>\n<td>You can add an image, if necessary.</td>\n</tr>\n<tr>\n<td>Start / End</td>\n<td>The period in which the tasks are to be displayed.</td>\n</tr>\n<tr>\n<td>Active</td>\n<td>Only active tasks will be displayed.</td>\n</tr>\n<tr>\n<td>Bonus points</td>\n<td>\n<p>When clicking on the link the panelists will receive the specified amount of bonus points once.</p>\n</td>\n</tr>\n<tr>\n<td>Group</td>\n<td>All existing groups can be selected.</td>\n</tr>\n<tr>\n<td>Language version</td>\n<td>Usually, the tasks are created for specific language versions.</td>\n</tr>\n</tbody>\n</table>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRWCQXQJ8YJXBKP7YQX8YJ\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRWM7YQX8YJ8YQXQJ8YJXB\">How can panelists opt-in to receive private messages?</h3>\n<p>Panelists need to activate the \"Receive private messages\" visibility option in their account settings.</p>\n<h3 id=\"h_01HGKSMPRWRJ8YQXQJ8YJXBKP7YQXQ\">What's the difference between panelist polls and anonymous polls?</h3>\n<p>Panelist polls require a login and allow for data matching with panelist profiles, while anonymous polls are open to all visitors but provide less detailed data.</p>\n<h3 id=\"h_01HGKSMPRWW8YJ8YQXQJ8YJXBKP7YQ\">How are bonus points awarded for completing tasks?</h3>\n<p>Bonus points are automatically awarded when a panelist clicks on the task link, completing the assigned activity.</p>",
    "user_segment_ids": []
}