{
    "id": 20370986276242,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370986276242.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370986276242-Language-editor",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:44:33Z",
    "updated_at": "2024-08-19T19:54:29Z",
    "name": "Language editor",
    "title": "Language editor",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T09:19:01Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide on using the Language Editor in the EFS Survey. It covers creating and managing survey languages, editing text elements, handling survey messages, and using wildcards in multilingual projects.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The Language Editor is a crucial tool for creating and managing multilingual surveys in EFS. This guide will walk you through various aspects of language management, from creating new languages to exporting and importing text elements for external editing.</p>\n<ul>\n<li><a href=\"#survey-languages\">Survey languages</a></li>\n<li><a href=\"#text-elements\">Text elements</a></li>\n<li><a href=\"#survey-messages\">Survey messages</a></li>\n<li><a href=\"#wildcards\">Wildcards</a></li>\n<li><a href=\"#export-import\">Export / import</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"survey-languages\" class=\"wysiwyg-text-align-justify\">Survey languages</h2>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Survey Language</strong>s menu item to create and edit languages, assign language identifiers, set the active default language, set language selection variable, copy language elements, and access the language selection log.</p>\n<h3 id=\"creating-languages\" class=\"wysiwyg-text-align-justify\">Creating languages</h3>\n<p class=\"wysiwyg-text-align-justify\">Proceed as follows</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the<strong> Create language</strong> button.</p>\n</li>\n<li>\n<p>In the “label” field, assign a name to the new language.</p>\n</li>\n<li>\n<p>Optionally, you can initialize the new language with phrases from an already existing language. To do so, specify your desired source language in the field “Copy language phrases from”.</p>\n</li>\n<li>\n<p>Assign a language identifier to the new language.</p>\n</li>\n<li>\n<p>Finally, confirm by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The overview table in the “Edit languages” section lists all existing languages of the project along with the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>ID</strong>: Each language receives an identification number from the system. This number cannot be changed. In the export data record, you will find this language identification number in the form of the “language” variable indicating the language version of the questionnaire that was displayed to the respondent</p>\n</li>\n<li>\n<p><strong>Language</strong>: Language label. The default language is marked accordingly.</p>\n</li>\n<li>\n<p><strong>Language identifier</strong>: Serves as unique identification of language and region.</p>\n</li>\n<li>\n<p><strong>Default language</strong>: This column indicates the current default language of the project.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Depending on your access rights the following actions are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Edit languages</strong>: Opens a dialog where you can change the label and identifier of the respective language.</p>\n</li>\n<li>\n<p><strong>Print</strong>: Opens a view of the questionnaire in the respective language optimized for printing.</p>\n</li>\n<li>\n<p><strong>Rights</strong>: Opens the dialog for assigning read or write rights for the respective language to particular user teams in a targeted manner.</p>\n</li>\n<li>\n<p>Use as default language</p>\n</li>\n<li>\n<p><strong>Delete</strong>: The respective language will be deleted after a confirmation prompt.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Once you delete a language, all text elements and other settings of this language will be deleted and cannot be restored. Deleting a language will also cause errors in settings already made for the language selection question and language selection variable, as well as for language information entered in participant administration. The ID of the deleted language will no longer be subsequently re-assigned. If you re-create the same language, it will be assigned a new language ID.</p>\n<p class=\"wysiwyg-text-align-justify\">You can use the <strong>View</strong> button to hide particular columns of the table or limit the number of rows.</p>\n<h3 id=\"uniquely-characterizing-languages-with-a-language-identifier\" class=\"wysiwyg-text-align-justify\">Uniquely characterizing languages with a language identifier</h3>\n<p class=\"wysiwyg-text-align-justify\">The language identifier allows you to uniquely identify languages and regions. For example, de_DE: German / Germany; en_US: English / USA; en_GB: English / Great Britain. Using the identifier is particularly helpful when a questionnaire is to be localized for different dialects of the same language, e.g. British and American English.</p>\n<p class=\"wysiwyg-text-align-justify\">The identifier is composed of</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>language ID according to ISO 639. A list can be found at <a href=\"http://www.loc.gov/standards/iso639-2/php/code_list.php\">http://www.loc.gov/standards/iso639-2/php/code_list.php</a></p>\n</li>\n<li>\n<p>country ID according to ISO 3166. A list can be found at <a href=\"http://www.iso.org/iso/country_codes/iso_3166_code_lists/english_country_names_and_code_elements.htm\">http://www.iso.org/iso/country_codes/iso_3166_code_lists/english_country_names_and_code_elements.htm</a></p>\n</li>\n<li>\n<p>For example, de is the code for German, DE is the country ID. Accordingly, the language identifier of a German language text localized for Germany is de_DE.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">A language identifier can be used for multiple targets: de_DE for example may be used for formal German, as well as for colloquial German.</p>\n<h3 id=\"setting-the-active-default-language\" class=\"wysiwyg-text-align-justify\">Setting the active default language</h3>\n<p class=\"wysiwyg-text-align-justify\">Among the existing languages of a multilingual project, one language will be treated as the default language. That means the following:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This language will automatically be used in the output questionnaire, unless an individual language preference for the respondent has been set by defining a language selection variable or unless a language selection page has been set up.</p>\n</li>\n<li>\n<p>The language elements of the default language will appear in the questionnaire editor, whereas you can only edit the language elements of the other languages via the language editor.</p>\n</li>\n<li>\n<p>The language elements of the default language will always appear in the first column of the language editor.</p>\n</li>\n<li>\n<p>If a language element has not been filled in for another language, the finished questionnaire will show the corresponding language element of the default language instead.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To find out which language performs the function of default language, check the column “Default language” in the overview of languages. When creating a project, the system will automatically set the language that is used in the admin area by the user creating the project as the default language. I.e. if the project is created by a staff member using the English-language admin area, the default language will automatically be set to English.</p>\n<h3 id=\"changing-the-default-language\" class=\"wysiwyg-text-align-justify\">Changing the default language</h3>\n<p class=\"wysiwyg-text-align-justify\">instead of using the simultaneous central access to the language elements of all languages via the language element editor, you will need to change the default language. It is usually not advisable to proceed in this way because the <strong>Language editor</strong> provides convenient central access to the language elements of the various languages.</p>\n<p class=\"wysiwyg-text-align-justify\">To change the default language, find the desired new default language in the list and click on the <strong>Use as default language</strong> icon. This change will simultaneously trigger a language selection blocker. Please observe the notes on this feature in the following section.</p>\n<p class=\"wysiwyg-text-align-justify\">If the new default language was not yet fully translated before the default language change, the #undefined# marker will appear in the text elements in the questionnaire and language editors which are still empty. Missing logos and buttons will be filled with #undefined#. If no character set has been specified before the change, the character set will also be set to \"#undefined#\" and needs to be defined.</p>\n<h3 id=\"copying-language-elements\" class=\"wysiwyg-text-align-justify\">Copying language elements</h3>\n<p class=\"wysiwyg-text-align-justify\"><em>A survey</em> allows you to copy texts from an already existing language into another language.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The “Copy language phrases from” function allows you to initialize a new language with existing phrases from another language. See the section “Create language” above.</p>\n</li>\n<li>\n<p>To fill or overwrite an already existing language with language elements from another language, specify the source and target languages in the “Copy language elements” field and confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The copy function is useful if, for example, many answer categories are identical and do not require translation, e.g. if questions concern products that are marketed internationally or the names of music artists and song titles.</p>\n<h3 id=\"blocking-changes-to-the-default-language\" class=\"wysiwyg-text-align-justify\">Blocking changes to the default language</h3>\n<p class=\"wysiwyg-text-align-justify\">If several staff members are working in the admin area at the same time, problems might occur. These can be prevented by incorporating the language selection blocker:</p>\n<p class=\"wysiwyg-text-align-justify\">Let us assume that user A sets his or her native language, German, as the default language and starts work in the questionnaire editor. User B does not know about this and changes the default language to English. Now, user A wants to save his or her changes to the German-language questionnaire. However, while saving, the changes will not be entered in the originally set default language of German, but will instead overwrite the English text elements.</p>\n<p class=\"wysiwyg-text-align-justify\">To avoid such overlapping, the change function will be blocked for all users after a change of the default language, and the <strong>Activate language</strong> button will no longer appear.</p>\n<p class=\"wysiwyg-text-align-justify\">Only the user who last made the change as well as users with “root” rights will now see a button labeled <strong>Enable language selection</strong> instead of the <strong>Use as default language</strong> icon, and can unblock language selection by clicking on this button. The blocker remains active until the user who made the change logs out or their session ends.</p>\n<p class=\"wysiwyg-text-align-justify\">After language selection has been unblocked or the last user’s session has ended, the default language can be changed again by any user. You want to change the default language, but the language selection blocker is active.</p>\n<h3 id=\"setting-the-output-language-via-a-language-selection-variable\" class=\"wysiwyg-text-align-justify\">Setting the output language via a language selection variable</h3>\n<p class=\"wysiwyg-text-align-justify\">The language displayed at the start of the survey can be set via a data item known in advance, such as information from participant administration. In the “Read language selection by survey start from” drop-down list, you can define the variable from which the ID of the displayed language will be read at the start of the survey. Which variables are available depends on the project type:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><em>Anonymous projects</em>: URL parameters</p>\n</li>\n<li>\n<p><em>Personalized projects</em>: The standard variables in participant administration except “c_date” and “m_date”, and all additionally created participant variables as well as URL parameters. If you would like to use a participant variable, especially for saving language information, then use the standard variable “u_language” which was introduced especially for this purpose.</p>\n</li>\n<li>\n<p><em>Panel and master data surveys</em>: Participant data, master data, system data, and URL parameters</p>\n</li>\n</ul>\n<h3 id=\"entering-the-language-setting-variable-in-participant-administration\" class=\"wysiwyg-text-align-justify\">Entering the language-setting variable in participant administration</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In language administration, specify from which variable the language setting is to be read.</p>\n</li>\n<li>\n<p>Confirm your entry by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Switch to <strong>Participant administration</strong>.</p>\n</li>\n<li>\n<p>If you select the <strong>Add participant</strong> button, you will find that the data item that was defined as the language variable (in the example shown below, the language version stored in u_language) can no longer be freely entered but only selected via a drop-down list.</p>\n</li>\n<li>\n<p>Now proceed entering or importing the participant data as usual.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If the participant data were entered before setting the language variable, the drop-down list will automatically be completed and set to the default language. Then, it is necessary to add the language data for the participants. Therefore it is strongly recommended to configure languages and participant variables before adding participant data.</p>\n<h3 id=\"tracing-changes-made-in-language-administration-via-the-log\" class=\"wysiwyg-text-align-justify\">Tracing changes made in language administration via the log</h3>\n<p class=\"wysiwyg-text-align-justify\">The “Language selection log” section displays important operations within language administration (e.g. creating and deleting languages and changing the default language) in chronological order. Therefore, you can also see here, among other things, who last changed the default language and is thus responsible for unblocking the language selection.</p>\n<h2 id=\"text-elements\" class=\"wysiwyg-text-align-justify\">Text elements</h2>\n<p class=\"wysiwyg-text-align-justify\">If you want to edit the text elements of your multilingual project directly in<em> EFS</em> instead of using the “External editing” function, the text element editor will be central to your work, because here you can edit the text elements of your questionnaire page by page.</p>\n<h3 id=\"ways-to-the-text-element-editor\" class=\"wysiwyg-text-align-justify\">Ways to the text element editor</h3>\n<p class=\"wysiwyg-text-align-justify\">Once you have created more than one language for a project, there are three possible ways of accessing the text element editor:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>As described above, clicking on the <strong>Language Editor</strong> → <strong>Text elements</strong> menu item in the questionnaire editor will take you to the overview of translation to-dos. Selecting one item from the to-do list will open the text element editor for the corresponding page.</p>\n</li>\n<li>\n<p>From the page view, you only have to click on the <strong>Text Elements</strong> menu to access the text elements of the current page.</p>\n</li>\n</ul>\n<h3 id=\"overview-of-the-translation-process\" class=\"wysiwyg-text-align-justify\">Overview of the translation process</h3>\n<p class=\"wysiwyg-text-align-justify\">Clicking on the <strong>Questionnaire editor → Language editor → Text elements</strong> menu item will take you to the overview of translation to-dos. Here, you can see where there are still untranslated text elements in your questionnaire.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>All text elements in the text element editor that have been filled in the default language should be filled in the additional languages, too. I.e. the pages of the default language will always be marked <strong>OK</strong>.</p>\n</li>\n<li>\n<p>Until all the text elements of an additional language have been completed in the text element editor, the table will output the <strong>Edit</strong> message for the respective page.</p>\n</li>\n<li>\n<p>Once all the text elements of a language have been completed, the table will output<br>the <strong>OK</strong> message for the respective page.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can click on the <strong>OK</strong> and <strong>Edit</strong> messages and switch directly to the appropriate page of the text element editor, the functions of which will be described below. Once you have configured this according to the instructions given in the next section, you can start entering the translated text elements.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note that the list of translation to-dos will only indicate whether or not a text element is filled with text – it is not possible to check automatically whether the text is in the correct language and has been translated correctly.</p>\n<p class=\"wysiwyg-text-align-justify\">Also, this list does not indicate whether survey messages and wildcards have already been translated or whether translated logos or form elements have been uploaded.</p>\n<h3 id=\"editing-text-elements\" class=\"wysiwyg-text-align-justify\">Editing text elements</h3>\n<p class=\"wysiwyg-text-align-justify\">The text element editor is structured as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The text elements of the questionnaire page displayed will be grouped by questions and listed in the order in which they appear in the finished questionnaire. The type of the respective text element (“Question text”, “Item text”, etc.) will be displayed in the “Element” column.</p>\n</li>\n<li>\n<p>The middle column of the text element editor contains the text elements of the default language, i.e. the texts that you can also, as usual, enter and view via the questionnaire.</p>\n</li>\n<li>\n<p>In the other columns, the text elements of the selected page will be entered for all other languages. They can be changed as desired (for information on how to open the text elements of another language or all available languages, see the following section, “Configuring the language element editor”).</p>\n</li>\n<li>\n<p>By clicking on the <strong>Preview</strong> icon, you can open the preview of the questionnaire in the respective language.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can change the text elements both in the default language as well as in the other language(s) shown. After you have finished, you must save your changes by clicking on <strong>Save</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">When saving, however, only those changes containing a string will be transferred to the language table. Empty strings will be ignored. Fields of the language table that do not have an entry will show the text for the default language.</p>\n<p class=\"wysiwyg-text-align-justify\">If the desired survey language should be coded with character sets other than the international character set UTF-8, then you should set up the suitable character sets.</p>\n<h3 id=\"configuring-the-text-element-editor\" class=\"wysiwyg-text-align-justify\">Configuring the text element editor</h3>\n<p class=\"wysiwyg-text-align-justify\">Using the <strong>View</strong> function you will be able to edit the display of the language element editor.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can change the size of the input fields. Both the number of rows and the number of characters per row can be modified. By default, each input field has three rows and is 40 characters wide.</p>\n</li>\n<li>\n<p>You can select languages for editing. By default, when you open the language element editor for the first time, it will display the first language that was created. For projects in three to four languages, it is advisable to display the text elements in all languages simultaneously. By contrast, for projects with a dozen or more languages, it may be more advisable not to show all the languages simultaneously but to edit the respective text elements successively or in groups.</p>\n</li>\n<li>\n<p>When you have completed the text elements on one questionnaire page, you can click on the <strong>Arrow</strong> icons in the top right corner of the window to navigate to the text elements of the previous or next questionnaire page.</p>\n</li>\n</ul>\n<h2 id=\"survey-messages\" class=\"wysiwyg-text-align-justify\">Survey messages</h2>\n<p class=\"wysiwyg-text-align-justify\">Similar to the language elements in the questionnaire, the survey messages of the project can be edited in several languages. To do so, click on the <strong>Survey messages </strong>menu item in the language editor.</p>\n<h3 id=\"text-elements-from-the-library\" class=\"wysiwyg-text-align-justify\">Text Elements from the Library</h3>\n<p class=\"wysiwyg-text-align-justify\">In the top section of this dialog, in the “Which language do you want to fill with text elements from the library?” field, you can select the language in which you want to edit the survey messages. Select the desired language, and then confirm by clicking on <strong>Apply</strong>.</p>\n<h3 id=\"survey-messages-1\" class=\"wysiwyg-text-align-justify\">Survey messages</h3>\n<p class=\"wysiwyg-text-align-justify\">If there is already a complete set of survey messages in the library, you can select it in the “Survey messages from library” field and accept by clicking on <strong>Apply</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">In the “Survey messages of language x”, you can edit the survey messages:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The left-hand column, titled “Element”, explains in which situation the respective survey message will be used.</p>\n</li>\n<li>\n<p>The middle column contains the survey messages of the default language, i.e. the texts that you can also, as usual, view and enter under <strong>Project properties</strong> → <strong>Survey messages</strong>.</p>\n</li>\n<li>\n<p>The right-hand column shows the text elements in the target language. They can be changed as desired.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If the desired survey language should be coded with character sets other than the international character set UTF-8, then you should set up the appropriate character sets in the field “character sets”. More information on this topic, including a list of available character sets, can be found here. </p>\n<h2 id=\"wildcards\" class=\"wysiwyg-text-align-justify\">Wildcards</h2>\n<p class=\"wysiwyg-text-align-justify\">If you are using the wildcard to incorporate text in multilingual projects, you can click on the <strong>Edit language elements </strong>button to insert and change the corresponding text elements in the various languages.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"export-import\" class=\"wysiwyg-text-align-justify\">Export / import</h2>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Export / Import </strong>function allows you to export text elements (i.e. question and help texts, fill-in instructions as well as question options) for external editing with MS Excel or with the translation software SDLX. You can thus make easy and concise changes to question categories and items. For example, you can rename (“relabel”) existing categories and items. This simplifies the translation of questionnaires significantly. However, no new categories, new items, or variables can be added. Importing text changes or translations into another project is not possible, either.</p>\n<p class=\"wysiwyg-text-align-justify\">The required operations,</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>exporting project data</p>\n</li>\n<li>\n<p>editing exported data in an external program</p>\n</li>\n<li>\n<p>importing edited project data into EFS are introduced in the following section.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Following that there is an explanation of how to edit with Microsoft Excel and SDLX.</p>\n<h3 id=\"exporting-text-elements\" class=\"wysiwyg-text-align-justify\">Exporting text elements</h3>\n<p class=\"wysiwyg-text-align-justify\">The tabs for importing and exporting files for external editing are located in the menu <strong>Projects</strong> → {Selected project} → <strong>Questionnaire editor</strong> →<strong> Language editor </strong>→ <strong>Import</strong> / <strong>Export</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Export file</strong> tab.</p>\n</li>\n<li>\n<p>Set the file format for the export. The following options are available:</p>\n<ul>\n<li>\n<p>XLSX for editing with MS Excel</p>\n</li>\n<li>\n<p>HTML for editing with SDLX</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If you wish to use the versioning features, you have to tick the checkbox labeled “Save exported version for later comparisons”.</p>\n</li>\n<li>\n<p>If you have chosen XLS as the export format, you will have several special options available to you for defining the file structure.</p>\n</li>\n<li>\n<p>Click on the <strong>Export</strong> button on the right-hand side to download the file.</p>\n</li>\n<li>\n<p>In most browsers, a dialog will open in which you can choose whether you wish to directly open the file in a program or save the data. It is recommended that you save the data on the hard disk. In some browsers the file will be automatically opened in Excel: In this case, you should likewise save the file onto your hard drive, and make sure that you enter a file extension that matches the file format.</p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Save</strong>.</p>\n</li>\n</ul>\n<h3 id=\"external-editing-of-text-elements\" class=\"wysiwyg-text-align-justify\">External editing of text elements</h3>\n<p class=\"wysiwyg-text-align-justify\">You can open and edit the exported file in MS Excel or SDLX depending on which format you choose.</p>\n<h3 id=\"importing-edited-text-elements-back-into-efs\" class=\"wysiwyg-text-align-justify\">Importing edited text elements back into <em>EFS</em>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">After completing the editing process, switch back to your EFS project and select in the <strong>Import</strong> / <strong>Export</strong> submenu the <strong>Import file</strong> tab. Specify the target language and import conditions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the drop-down list labeled “Into which language do you wish to import the new text elements?”, you can select the target language for the import. If the<br>default language is selected, the elements will be imported directly into the questionnaire editor’s data tables.</p>\n</li>\n<li>\n<p>In the “Back up old elements in another language?” field, the “Overwrite old elements” function will be selected by default. However, if you do not want to lose text elements you have already inserted, you can also back them up in another language.</p>\n</li>\n<li>\n<p>Only those elements containing a string will be transferred to the language table or the editor tables. Empty strings will be ignored.</p>\n</li>\n<li>\n<p>If you wish to import text elements in another language but do not notice that this language has not yet been set up until you reach the tab for re-importing the files, you can still do this in the bottom section “New language”. Specify the name of the new language, and then click on <strong>Save</strong>. After that, you can perform an import into this new language.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You will use <strong>Browse</strong> to select the edited file and you will click on <strong>Next page</strong> to import the changes. The changes will be documented in the overview \"Import finished\".</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What happens if I delete a language?</h3>\n<p class=\"wysiwyg-text-align-justify\">Deleting a language will remove all text elements and settings for that language. This action cannot be undone and may cause errors in language selection settings and participant administration.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I add new categories or items through the Export / Import function?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, the Export / Import function is designed for editing existing text elements. You cannot add new categories, items, or variables through this process.</p>",
    "user_segment_ids": []
}