{
    "id": 20370907544210,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370907544210.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370907544210-Sample",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:38:23Z",
    "updated_at": "2024-08-28T09:53:06Z",
    "name": "Sample",
    "title": "Sample",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T07:26:57Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information on managing samples in panel surveys using the EFS Panel. It covers the process of drawing samples, controlling attribute distribution, and managing sample participants.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">EFS Panel offers various functions for controlling the sampling process in panel surveys. This guide explains how to create, manage, and edit samples, as well as how to invite and remind sample members.</p>\n<ul>\n<li><a href=\"#drawing-a-sample\">Drawing a sample</a></li>\n<li><a href=\"#managing-samples\">Managing samples</a></li>\n<li><a href=\"#searching-all-samples\">Searching all samples</a></li>\n<li><a href=\"#editing-a-sample\">Editing a sample</a></li>\n<li><a href=\"#limiting-the-basic-set\">Limiting the basic set</a></li>\n<li><a href=\"#controlling-the-attribute-distribution-within-the-sample\">Controlling the attribute distribution within the sample</a></li>\n<li><a href=\"#viewing-and-managing-the-participants-of-a-sample\">Viewing and managing the participants of a sample</a></li>\n<li><a href=\"#inviting-and-reminding-sample-members\">Inviting and reminding sample members</a></li>\n<li><a href=\"#managing-personalized-links-for-external-survey-start\">Managing personalized links for external survey start</a></li>\n</ul>\n<p> </p>\n<p class=\"wysiwyg-text-align-justify\">Surveys in panels are usually not comprehensive but rather based on smaller samples from the overall pool of panelists. <em>EFS Panel</em> provides several functions for controlling the sampling process:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Depending on the type of survey and the situation, the sampling is either performed manually by the panel administrator or the participants are automatically added to an internal sample.</p>\n</li>\n<li>\n<p>There are several functions available that allow you to limit the sample according to your needs.</p>\n</li>\n<li>\n<p>Convenient features, already familiar from the participant administration of personalized projects, will help you manage the participants in your sample.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812923666\" alt=\"image-20240618-094813.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can create several samples per project.</p>\n</li>\n<li>\n<p>A panelist can be allocated to only one sample per project.</p>\n</li>\n<li>\n<p>the sample may contain up to 500,000 panelists. Please note: The size of the sample can affect the performance of your project. If you run a large panel and/or plan a large, complex survey project, it is recommended to draw several small samples and send the invitations consecutively.</p>\n</li>\n<li>\n<p>In the context of a master data survey, the sample can only be applied to testers. No additional sample can be created.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Samples are protected by their own “sample_access” right. With read rights, you have access to the samples already available for a panel project and can edit them. With write rights, you can create new samples.</p>\n<h2 id=\"drawing-a-sample\" class=\"wysiwyg-text-align-justify\"><strong>Drawing a sample</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">To learn how to draw a sample in practice, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a panel survey. Make sure that you use the “Panel survey” project type, which is only available for <em>EFS Panel</em> installations.</p>\n</li>\n<li>\n<p>In the <strong>Sample</strong> menu, click on the<strong> Create Sample</strong> button.</p>\n</li>\n<li>\n<p>Enter a title and description.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Submit</strong>.</p>\n</li>\n<li>\n<p>The edit dialog of the new sample is opened. The <strong>Overview</strong> tab contains basic information about the new sample. Further tabs contain various settings and editing functions. However, it is not yet possible to select all tabs.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812925330\" alt=\"image-20240618-094421.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the <strong>Define Basic Set</strong> tab.</p>\n</li>\n<li>\n<p>In the top section of the tab, you specify which panel group shall form the basic set for drawing the sample. For detailed explanations of the various options.</p>\n<ul>\n<li>\n<p>First, select the group category and then the panel group from which you want to draw the sample.</p>\n</li>\n<li>\n<p>Optionally, you can use grouping filters and capacity filters to restrict the basic set further.</p>\n</li>\n<li>\n<p>Optionally, you can restrict the sample to panelists with specific panel statuses.</p>\n</li>\n<li>\n<p>Also, a maximum number of participants can be defined. Please note: this is only recommendable if you do not use stratification. If the basic set is narrowed down unnecessarily from the beginning, it might not be possible to reach the target values that are explicitly specified during the stratification process.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812924434\" alt=\"image-20240618-094547.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The “Extended settings” allow us to further narrow the sample. For example, you can specify how many surveys the members of the new groups must have participated in or how many bonus points they must have. For detailed explanations of the various options.</p>\n</li>\n<li>\n<p>In the “Choose the projects...” section, you can optionally exclude the participants of specific projects from the sample draw. To do so, tick the “Exclude” checkbox after the desired project.</p>\n</li>\n<li>\n<p>After specifying all criteria, click on the <strong>Test filter</strong> button.</p>\n</li>\n<li>\n<p>This will first test-create the sample. A bar will indicate whether panelists meet the conditions and how many of them do. Furthermore, in addition to the <strong>Test filter </strong>button, you will now see the <strong>Activate filter</strong> button.</p>\n</li>\n<li>\n<p>You can make further changes to the filter conditions and test them by clicking on <strong>Test Filter</strong> until the result is to your liking.</p>\n</li>\n<li>\n<p>After that, click on the <strong>Activate filter</strong> button.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014812930706\" alt=\"image-20240618-092932.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The <strong>Overview</strong> tab now contains information on the size of the new sample. The sample shown in the figure comprises 13 participants.</p>\n</li>\n<li>\n<p>Optionally, you can define the distribution of certain attributes within the sample in detail on the <strong>Stratification</strong> tab. This option will only be available until you have created the sample by activating the <strong>Draw sample</strong> function on the following tab.</p>\n</li>\n<li>\n<p>After you have applied all desired filter criteria to the members of the new sample and also - if stratification is required - performed all necessary stratifications, open the <strong>Draw sample</strong> tab. Click the <strong>Draw sample</strong> button: The sample will now be drawn.</p>\n</li>\n<li>\n<p>After the sample has been drawn, the <strong>Define basic set</strong>, <strong>Stratification,</strong> and <strong>Draw sample</strong> tabs are disabled, and the <strong>Statistics</strong>, <strong>View tester list</strong>, <strong>Sample contents</strong>, <strong>Inform, </strong>and <strong>Remind again</strong> tabs are activated.</p>\n</li>\n</ul>\n<h2 id=\"managing-samples\" class=\"wysiwyg-text-align-justify\"><strong>Managing samples</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Sample</strong> menu contains an overview of all samples that exist within the respective project. The following information will be displayed:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Title</p>\n</li>\n<li>\n<p>Description</p>\n</li>\n<li>\n<p>Size: The number of panelists assigned to this sample.</p>\n</li>\n<li>\n<p>Completed interviews: Number of sample participants with disposition codes 31 and 32.</p>\n</li>\n<li>\n<p>Screened-out participants: Number of sample participants with disposition codes 35, 36, 37, and 41.</p>\n</li>\n<li>\n<p>Tester: Number of testers assigned to this sample.</p>\n</li>\n<li>\n<p>Status</p>\n</li>\n<li>\n<p>Filter: Shows whether a filter has already been set.</p>\n</li>\n<li>\n<p>Stratification</p>\n</li>\n<li>\n<p>Accessible: Surveys that are not accessible are marked with a red traffic light icon. Move the cursor over the icon to display the reason for non-accessibility.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Via buttons, you can call up the following actions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Create sample</strong>: Opens the dialog for creating a new sample.</p>\n</li>\n<li>\n<p><strong>Send reminders</strong>: Allows for a centralized reminder dispatch. Opens a list of all samples from the current project that are currently available. You can select the desired sample.</p>\n<ul>\n<li>\n<p>By default, reminders are sent to participants with disposition codes 11, 12, 13, and 17. A drop-down list below the mail form allows you to optionally specify the disposition code of the recipients yourself.</p>\n</li>\n<li>\n<p>You can choose from the codes 11, 12, 13, 14, 17, 20, 21, 22, or 23.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following “Action” icons are available for editing individual samples:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>By clicking on the title you will open the edit dialog of the respective sample.</p>\n</li>\n<li>\n<p><strong>Edit</strong>: Opens the properties dialog where you can change the title and description of an existing sample.</p>\n</li>\n<li>\n<p><strong>Add tester</strong>: Opens the View tester list tab</p>\n</li>\n<li>\n<p>Save in group: Clicking on this icon will create a new panel group including all participants from the sample. Optionally, the “Include participants with completed interviews only” feature can be used to restrict the group to those participants who have completed the survey (disposition codes 31, 32).</p>\n</li>\n</ul>\n<h2 id=\"searching-all-samples\" class=\"wysiwyg-text-align-justify\"><strong>Searching all samples</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Search in All Samples</strong> tab of the <strong>Sample</strong> menu, you can enter a term in the search field. Clicking on <strong>Extended Search </strong>opens a search mask, which allows you to perform a detailed search. You can, for instance, select a specific panel status, a specific sample, or a status from the respective drop-down menus, or you can enter a name in the free text field <strong>Search for Panelists</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859877522\" alt=\"image-20240618-094237.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">If necessary, you can customize the search mask to your individual needs:</p>\n<ol class=\"wysiwyg-text-align-justify\" start=\"1\">\n<li>\n<p>Click on the configuration gear symbol at the very right in the extended search.</p>\n</li>\n<li>\n<p>Select a variable from the drop-down menu, and click <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The variable is now available in the search mask of the extended search.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">You have the option of configuring up to 5 additional variables for use in the extended search. This includes the variable “Pseudonym”, which adds a free text field to the search mask. In this field, you can enter several pseudonyms at the same time, which allows you to do mass searches in your panel projects.</p>\n<h2 id=\"editing-a-sample\" class=\"wysiwyg-text-align-justify\"><strong>Editing a sample</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Clicking on the title of a sample will open the edit dialog. On its various tabs you will find the following information and functions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Overview</strong>: This tab provides basic information on the sample.</p>\n</li>\n<li>\n<p><strong>Basic set</strong>: On this tab, you specify which group will serve as the basic set for drawing the sample, which additional criteria the participants are to meet, and how many participants are required.</p>\n</li>\n<li>\n<p><strong>Stratification</strong>: On this tab, you can define the distribution of certain attributes within the sample in detail.</p>\n</li>\n<li>\n<p><strong>Draw sample</strong>: After defining the basic set and optionally applying stratification, the actual drawing of the sample is performed on this tab.</p>\n</li>\n<li>\n<p><strong>Statistics</strong>: On this tab, you can create ad hoc statistics to get an overview of how the sample is composed.</p>\n</li>\n<li>\n<p><strong>View tester list</strong>: On this tab, you will find all the testers allocated to the current sample.</p>\n</li>\n<li>\n<p><strong>Sample contents</strong>: This tab lists the sample participants.</p>\n</li>\n<li>\n<p><strong>Inform</strong> / <strong>Inform again</strong> / <strong>Remind again</strong>: Via these tabs you can contact sample participants with specific disposition codes.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Which tabs may be opened and edited depends on the respective stage in the sample drawing process.</p>\n<h2 id=\"limiting-the-basic-set\" class=\"wysiwyg-text-align-justify\"><strong>Limiting the basic set</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Basic Set</strong> tab, you specify which panel group shall form the basic set for drawing the sample and which criteria are to be used for further limiting this basic set. The criteria are explained in the following section.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Basic set</strong></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Field</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Group category</p>\n</td>\n<td>\n<p>Groups can be sorted thematically and arranged clearly.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Group</p>\n</td>\n<td>\n<p>People offer you various possibilities to form groups (also called \"subpanels\").</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Filter</p>\n</td>\n<td>\n<p>You can use grouping filters for creating samples.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Capacity filter</p>\n</td>\n<td>\n<p>The capacity filters can be used to organize the panelists’ capacity optimally.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Panel status</p>\n</td>\n<td>\n<p>The most important characteristic of panelists is their panel status: it describes their current role and activity.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Maximum number of participants</p>\n</td>\n<td>\n<p>Optionally, you can define how many participants are to be contained in the sample.</p>\n<p>Please note: limiting the maximum number is only recommendable if you do not use stratification. If the basic set is narrowed down unnecessarily from the beginning, it might not be possible to reach the target values that are explicitly specified during the stratification process.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"><br><strong>Extended settings</strong></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Field</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Number of completed surveys (based on variable n_poll)</p>\n</td>\n<td>\n<p>Evaluates the “n_poll” system data item.</p>\n<p>Please mind: If tracking is activated, evaluation of the variable “track_num_completed” (e.g. via grouping filter) provides you with more<br>precise information.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Number of bonus points</p>\n</td>\n<td>\n<p>Evaluates the current sum of the bonus points in the panelist’s account.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Last completed interview at least / not longer than x months ago</p>\n</td>\n<td>\n<p>Evaluate the system data item <em>last_poll_date</em>.</p>\n<p>Please mind: If tracking is activated, evaluation of the variable “track_num_completed” (e.g. via grouping filter) provides you with more precise information.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Panel member since x months</p>\n</td>\n<td>\n<p>Calculates the time for which the panelist has been a panel member based on the system data item “penter_date”.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Last updating of master data for x months</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>PCI value</p>\n</td>\n<td>\n<p>The Panelist Compliance Index enables the reliability of panelists to be captured and recorded in a variable.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>E-mail verification status</p>\n</td>\n<td>\n<p>Status of the double opt-in e-mail verification</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>The variable used to define the uniqueness</p>\n</td>\n<td>\n<p>Each characteristic of this variable will be in the sample not more than once.</p>\n<p>Please note that finding unique values requires an extra internal processing step. Therefore, if you use this feature, queries will be considerably slower.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"><br><strong>Excluding panelists already participating in other panel surveys</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Panelists who are already participating in other projects can be excluded from the sample draw. This may be useful if you want to avoid overburdening your respondents. Sometimes it may also be the case that several surveys are conducted on the same range of topics at the same time, while you want the panelists to participate in only one of these surveys.</p>\n<p class=\"wysiwyg-text-align-justify\">At the bottom of the<strong> Define basic set</strong> tab, open the section “Choose the projects whose participants shall be excluded from the basic set”. This will open a list of all panel surveys. Select those whose participants you do not want to include in the basic set of the current sample.</p>\n<p class=\"wysiwyg-text-align-justify\">If you create several samples in the same project, each panelist can only be allocated to one of these samples.</p>\n<h2 id=\"controlling-the-attribute-distribution-within-the-sample\" class=\"wysiwyg-text-align-justify\"><strong>Controlling the attribute distribution within the sample</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If necessary, you can define certain attribute distributions within the sample in detail. This process is also known as “stratification”.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You define the distribution of attributes for each combination of attributes or each individual attribute.</p>\n</li>\n<li>\n<p>You can either enter the target values by hand or import them.</p>\n</li>\n<li>\n<p>You can enter either absolute numbers or percentages.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following sections first explain the available definition methods and cell value specification modes. This is followed by a description of both the manual definition and the import.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859880082\" alt=\"image-20240618-093452.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Available definition methods</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table provides an overview of the definition methods available.</p>\n<table class=\"wysiwyg-text-align-justify\" style=\"height: 290px;\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr style=\"height: 22px;\">\n<th class=\"wysiwyg-text-align-center\" style=\"height: 22px; width: 336.91px;\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Option</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"height: 22px; width: 336.91px;\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr style=\"height: 67px;\">\n<td style=\"height: 67px; width: 328.889px;\">\n<p>Manual selection of the stratification variables and entry of the target distribution (absolute values)</p>\n</td>\n<td style=\"height: 67px; width: 328.889px;\">\n<p>The stratification is defined manually, as usual, the target distribution will be specified in absolute values</p>\n</td>\n</tr>\n<tr style=\"height: 67px;\">\n<td style=\"height: 67px; width: 328.889px;\">\n<p>Manual selection of the stratification variables and entry of the target distribution (percentages)</p>\n</td>\n<td style=\"height: 67px; width: 328.889px;\">\n<p>The traditional stratification method involves the entry of target distribution as a percentage.</p>\n</td>\n</tr>\n<tr style=\"height: 67px;\">\n<td style=\"height: 67px; width: 328.889px;\">\n<p>Import of a file containing the stratification settings<br>(absolute values)</p>\n</td>\n<td style=\"height: 67px; width: 328.889px;\">\n<p>The stratification is defined by import, and the target distribution will be specified in absolute values.</p>\n</td>\n</tr>\n<tr style=\"height: 67px;\">\n<td style=\"height: 67px; width: 328.889px;\">\n<p>Import of a file containing the stratification settings<br>(percentages)</p>\n</td>\n<td style=\"height: 67px; width: 328.889px;\">\n<p>The stratification is defined by import, and the target distribution will be specified in percentages.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"><br><strong>Cell definition mode</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Similar to the quotas, there are two ways to define the target values for stratification:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Interlaced: The distribution is defined in detail for all possible combinations of attributes. In the example below, it is defined exactly how many male soccer fans, female soccer fans, and male and female baseball fans the sample contains.</p>\n</li>\n<li>\n<p>Non-interlaced: The stratification distribution is defined for each selected answer category of the stratification variables. The internal distribution is ignored. If this mode was applied in the example below, this might mean that soccer and baseball fans would each account for 50% of the participants, 50% of the participants were male, while the soccer fans could be made up of 20% men and 80% women.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Manual stratification</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a sample as usual and define the basic set.</p>\n</li>\n<li>\n<p>Switch to the<strong> Stratification</strong> tab.</p>\n</li>\n<li>\n<p>Select one of the manual stratification methods and confirm by clicking on <strong>Continue</strong>.</p>\n</li>\n<li>\n<p>Select the appropriate cell value specification mode. You can choose between “interlaced” and “non-interlaced”. Per default, “interlaced” is activated. If you change the setting, please confirm with <strong>Restrict</strong>.</p>\n</li>\n<li>\n<p>Optionally you can restrict the list of available variables to a specific master data category. If you do so, confirm with<strong> Restrict</strong>.</p>\n</li>\n<li>\n<p>The variables available for stratification are listed in the bottom section of the tab. Select the appropriate stratification variable(s) and confirm by clicking on <strong>Continue</strong>. In the example, the variables <em>u_gender</em> and <em>m_favoritesports</em> are used.</p>\n</li>\n<li>\n<p>All answer categories of the selected stratification variables are listed.</p>\n</li>\n<li>\n<p>Select the answer categories you wish to use for stratification. It is advisable to exclude missing categories such as “no answer”. Confirm by clicking on <strong>Continue</strong>.</p>\n</li>\n<li>\n<p>An overview of the stratification cells with their current proportions will be displayed. The number of surveys completed by the prospective sample members over the past weeks will also be indicated: Thus, you can check in time whether a high percentage of the panelists might be overworked or whether many candidates have not participated in any survey for some time i.e. might be inactive.</p>\n</li>\n<li>\n<p>Enter the target values in absolute numbers or percentages, as required. When expressing target values as percentages, you also have to predefine the absolute total amount to be reached. It should be defined in such a manner that the specific target values can be met based on the number of existing candidates.</p>\n</li>\n<li>\n<p>Click on <strong>Check</strong> to see whether your stratification can be achieved with the current basic set.</p>\n<ul>\n<li>\n<p>Target values or the total number may have to be adjusted. Please bear in mind that the values may diverge due to rounding. In the example above, the total of the values of the individual cells (10) slightly differs from the absolute total number of panelists in this stratification (13).</p>\n</li>\n<li>\n<p>It may also be necessary to modify the basic set and the stratification criteria to reach the target values.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If the values are valid, this will be indicated by a green success message. In this case, you can complete the process by clicking on <strong>Perform stratification</strong>.</p>\n</li>\n<li>\n<p>On the <strong>Overview</strong> tab, you will now find a “Stratification” section. This section lists the stratification cells, the target values, and the total number. In the course of the sample draw, the following additional data will be displayed:</p>\n<ul>\n<li>\n<p>Number of allocated participants: Number of participants in the sample that are allocated to a particular cell. This is displayed after the sample draw.</p>\n</li>\n<li>\n<p>Completed or screened-out: Number of participants with disposition codes 31, 32, 36, and 37, allocated to a particular cell.</p>\n</li>\n<li>\n<p>Completed or screened-out %: Percentage of participants with disposition codes 31, 32, 36, and 37, allocated to a particular cell.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Defining stratification via import</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Formatting the import file</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The import file should be formatted as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Format: CSV or Excel format</p>\n</li>\n<li>\n<p>For each master data variable used a corresponding column has to be created; an additional column has to be created for the target values.</p>\n</li>\n<li>\n<p>The first line of the import file must contain the names of the variables and the title of the target value column, “target”.</p>\n</li>\n<li>\n<p>In the following lines of the import file, the target value for each single combination of master data characteristics is specified.</p>\n</li>\n<li>\n<p>If the values entered have decimal places, please use a point as a decimal separator.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Example:</p>\n<p class=\"wysiwyg-text-align-justify\">m_0001;m_0002;target</p>\n<p class=\"wysiwyg-text-align-justify\">1;1;1000</p>\n<p class=\"wysiwyg-text-align-justify\">1;2;1150</p>\n<p class=\"wysiwyg-text-align-justify\">2;1;950</p>\n<p class=\"wysiwyg-text-align-justify\">2;2;1200</p>\n<p class=\"wysiwyg-text-align-justify\">This file describes a stratification employing the variables m_0001 and m_0002. Both variables have the characteristics 1 and 2 each. Each line contains the target value for a combination of the characteristics of these variables. For example, the second line “1;1;1000” specifies that for the combination of m_0001 = 1 and m_0002 = 2, the target value 1000 is to be obtained.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Import</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a sample as usual, define the basic set, and switch to the Stratification tab.</p>\n</li>\n<li>\n<p>Select one of the stratification methods using import and confirm by clicking on <strong>Continue</strong>.</p>\n</li>\n<li>\n<p>Locate the import file on your hard drive and upload the file by clicking on <strong>Import file</strong>.</p>\n</li>\n<li>\n<p>You will be directed to the dialog showing you the current proportion of characteristics. Check the selection of the variables and the target values. Then perform check and stratification as described above.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Checking the Composition of the sample</strong></p>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Statistics</strong> tab, you can create ad hoc statistics to get an overview of how the sample is composed.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can select the report variable and optionally two split variables.</p>\n</li>\n<li>\n<p>This ad hoc statistic is always based on the current sample.</p>\n</li>\n</ul>\n<h2 id=\"viewing-and-managing-the-participants-of-a-sample\" class=\"wysiwyg-text-align-justify\"><strong>Viewing and managing the participants of a sample</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Sample Contents</strong> tab contains a list of all panelists assigned to the sample.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Listed for each panelist are:</p>\n</li>\n<li>\n<p>First name</p>\n</li>\n<li>\n<p>Name</p>\n</li>\n<li>\n<p>E-mail</p>\n</li>\n<li>\n<p>Panel status</p>\n</li>\n<li>\n<p>Code: This is the panelist’s survey access code. You can copy this code to an e-mail or use it to examine the survey from the perspective of this panelist.</p>\n</li>\n<li>\n<p> Mails sent: Number of e-mails sent in the course of this sample.</p>\n</li>\n<li>\n<p>Status: Panelist’s disposition code in this panel survey.</p>\n</li>\n<li>\n<p>Date of first invitation</p>\n</li>\n<li>\n<p>Last access:</p>\n</li>\n<li>\n<p>Monitoring: With the monitoring function you can observe passively as another user clicks through a survey with a panelist account. Please note: The monitoring mode is deprecated and will be dropped in one of the next versions.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the name or the<strong> Edit</strong> icon, you can open the detailed view of the respective panelist. Additional information can be displayed via <strong>View</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014859878930\" alt=\"image-20240618-094050.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Searching the sample</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To search sample members you can use the usual simple search. However, via extended search, you can use additional limitation criteria:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Always available for selection are panel status and the participant’s status in the sample.</p>\n</li>\n<li>\n<p>If you have used stratification, the stratification variables can be used as search criteria, too.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">A range of participant administration actions are available for editing sample members, such as, for example, the dispatching of e-mails to selected participants, or resetting with or without deleting data.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Actions</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Description</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Reset and delete data</p>\n</td>\n<td>\n<p>The status of the panelist in the sample is reset to “active”. If the panelist had already participated in the survey he can participate again. Participant's results data already recorded are deleted.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Reset without deleting data</p>\n</td>\n<td>\n<p>The status of the panelist in the sample is reset to “active”. Participant's<br>results data already recorded are not deleted.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Delete the panelist from this sample</p>\n</td>\n<td>\n<p>The panelist is removed from the sample.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Send e-mail</p>\n</td>\n<td>\n<p>Using this function, you can send emails to the selected panelists.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Disposition code 15 (not available)</p>\n</td>\n<td>\n<p>If invitation mails are bounced, you can set the corresponding panelists to disposition code 15. This code will be taken into account in the field report during evaluation.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"><br>When using an action proceed in a manner analogous to participant administration: Search the desired panelists and mark them in the “Selection” column. Then set the desired action and confirm with the <strong>Send request</strong>.</p>\n<h2 id=\"inviting-and-reminding-sample-members\" class=\"wysiwyg-text-align-justify\"><strong>Inviting and reminding sample members</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Dedicated tabs allow you to e-mail the sample members in a centralized manner during various work phases:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Inform</strong>: This tab is displayed after creating a new sample. You can use it to reach all participants with disposition codes 11, 12, 20, and 22.</p>\n</li>\n<li>\n<p><strong>Inform again</strong>: This tab is displayed after sending the first invitation e-mail. You can use it to reach all participants with disposition codes 11, 12, 20, and 22.</p>\n</li>\n<li>\n<p><strong>Remind again</strong>: This tab is visible after creating a new sample. After sending the first invitation e-mail, it is activated.</p>\n<ul>\n<li>\n<p>By default, reminders are sent to participants with disposition codes 11, 12, 20, and 22.</p>\n</li>\n<li>\n<p>A drop-down list below the mail form allows you to optionally specify the disposition code of the recipients yourself. You can choose from the codes 11, 12, 13, 14, 20, 21, 22, or 23.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"managing-personalized-links-for-external-survey-start\" class=\"wysiwyg-text-align-justify\"><strong>Managing personalized links for external survey start</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">When redirecting sample members to an external survey, personalized links must be used. The following features for managing these links are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Import links</strong>: Opens the import dialog.</p>\n<ul>\n<li>\n<p>The CSV file must contain the survey link in the first column and the URL has to start with the protocol (http:// or https://), the placeholder #panel_url#, or any other placeholder specifying the protocol. Optionally you may add the panelists’ pseudonym, <em>u_account</em>,<em> u_other_id</em>, or <em>panelist_code</em> in the second column. In this case, the links will be assigned to the panel members accordingly.</p>\n</li>\n<li>\n<p>You can only import or update links for panelists who have not yet started the survey.</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Export links</strong>: Triggers the export of all links.</p>\n</li>\n<li>\n<p><strong>Delete links</strong>: All links are deleted after a confirmation prompt.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For details on the external survey start, please see the dedicated manual which is available in the customer center. Please note that this document is currently in revision.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq-1\" class=\"wysiwyg-text-align-justify\">What is the maximum size of a sample?</h3>\n<p class=\"wysiwyg-text-align-justify\">A sample may contain up to 500,000 panelists. However, it's recommended to draw several small samples for large panels or complex survey projects to maintain performance.</p>\n<h3 id=\"faq-2\" class=\"wysiwyg-text-align-justify\">Can a panelist be in multiple samples for the same project?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, a panelist can only be allocated to one sample per project.</p>\n<h3 id=\"faq-3\" class=\"wysiwyg-text-align-justify\">How can I exclude participants from other projects in my sample?</h3>\n<p class=\"wysiwyg-text-align-justify\">On the \"Define basic set\" tab, you can choose projects whose participants should be excluded from the current sample draw.</p>",
    "user_segment_ids": []
}