{
    "id": 20371036970898,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371036970898.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371036970898-Text-Search-and-Rating",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234598507282,
    "created_at": "2024-07-25T16:45:50Z",
    "updated_at": "2024-08-21T12:27:49Z",
    "name": "Text Search and Rating",
    "title": "Text Search and Rating",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T08:33:08Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers text search functionality, rating of community content, tagging and categorization, and leaderboard features for EFS Panel installations. It provides information on setting up and configuring these features, as well as integrating them into the panel website.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on enhancing community engagement and content management in EFS Panel installations through various features such as text search, content rating, tagging, and leaderboards.</p>\n<ul>\n<li><a href=\"#text-search-for-community-generated-content\">Text Search for Community-generated Content</a></li>\n<li><a href=\"#rating-of-community-contents\">Rating of Community Contents</a></li>\n<li><a href=\"#tagging-and-categorization-of-community-content\">Tagging and Categorization of Community Content</a></li>\n<li><a href=\"#leaderboard\">Leaderboard</a></li>\n</ul>\n<h2 id=\"text-search-for-community-generated-content\" class=\"auto-cursor-target wysiwyg-text-align-justify\"><strong>Text Search for Community-generated Content</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Text search is a custom feature that can be made available on EFS Panel installations with EFS 9.1 or higher. It requires special programming. Furthermore, the Panel installation must meet special system requirements.</p>\n<p class=\"wysiwyg-text-align-justify\">If you are interested in using custom text search, please get in touch with the support.</p>\n<p class=\"wysiwyg-text-align-justify\">Text search enables panelists to search the panel news and community-generated content. The functional scope in brief:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Text search covers the content of news, blogs, forums, discussions and download lists. Optionally, you can restrict the scope to any of these content types.</li>\n<li>The search syntax is familiar from web search tools. I.e. panelists can use the commands intuitively.</li>\n<li>Optionally, you can allow the panelists to select the content types to be searched.</li>\n<li>If only one content type is searched, all results will be displayed in a paginated list. If several content types are searched, the most relevant results will be displayed in a summary. Via dedicated links, the panel members can access paginated lists of all results.</li>\n<li>The results lists are automatically restricted to content which the searching panelist is authorized to see.</li>\n<li>The search function is integrated into the website editor.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Setting up content search involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Defining the scope of the search feature and the length of the results lists for the entire panel installation.</li>\n<li>Setting up a search page with search form and results list.</li>\n<li>Creating a search form and inserting it into the panelists’ side-bar navigation on the desired page(s).</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Please make sure that both the search page and the pages with the content to-besearched are shown in the navigation for anybody who’s allowed to access them.</p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<table class=\"relative-table wysiwyg-text-align-justify\" style=\"width: 63.9604%; margin-right: auto; margin-left: auto;\" border=\"1\">\n<colgroup> <col style=\"width: 26.0233%;\"> <col style=\"width: 73.9819%;\"> </colgroup>\n<tbody>\n<tr>\n<th>Search string</th>\n<th>Result</th>\n</tr>\n<tr>\n<td>peace</td>\n<td>Result which contains: peace OR Peace OR PEACE</td>\n</tr>\n<tr>\n<td>peace*</td>\n<td>Result which contains: peace OR peacemaker</td>\n</tr>\n<tr>\n<td>+peace +war</td>\n<td>Result which contains: peace AND war</td>\n</tr>\n<tr>\n<td>+peace -war</td>\n<td>Result which contains: peace AND doesn‘t contain: war</td>\n</tr>\n<tr>\n<td>peace agreement</td>\n<td>Result which contains: peace agreement OR agreement of peace</td>\n</tr>\n<tr>\n<td>„peace agreement“</td>\n<td>Result which contains exactly: peace agreement</td>\n</tr>\n</tbody>\n</table>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\">Words with three or less letters are ignored.</p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\">A list of common words is ignored. For details, please check out:</p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"><span class=\"nolink\">http://dev.mysql.com/doc/refman/5.1/en/fulltext--</span>? stopwords.html</p>\n<h2 id=\"integrating-text-search-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating Text Search into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">To set up a search page, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Search for text in modules” type.</li>\n<li>Configure the setting options as required.<br>– Select the “func_search” module template. You may have to adapt the templates to the layout of your panel.<br>– Keep the “Template for media display” field empty.<br>– The other options are the same as the options in the menu <strong>Global configuration</strong>, but specific to this module and restricted to the maximum scope you defined in <strong>Global configuration</strong>.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">To create a search form for the side-bar navigation, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the „GLOBAL“ page dedicated to referenced content, create a page module of the “Form for text search in modules” type.</li>\n<li>Configure the setting options as required.<br>– Select the “func_searchform” module template. You may have to adapt the templates to the layout of your panel.<br>– Keep the “Template for media presentation” field empty.<br>– In the “Display results using” drop-down list, select the search page created in the previous chapter.</li>\n<li>Reference the GLOBAL module from all pages on which the side-bar navigation is used, as e.g. “My home”.</li>\n</ol>\n<h1 id=\"rating-of-community-contents\" class=\"sc-fzsDOv xgiDk wysiwyg-text-align-justify\"><strong>Rating of Community Contents</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">You can allow your panelists to rate not only other panelists, but contents as well.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You can enable your panelists to rate forum and discussion posts, blog posts and entire individual blogs.</li>\n<li>There is a uniform rating system, i.e. a scale, for each installation. Various predefined scales are available.</li>\n<li>EFS 10.3 includes new scales for “Like” and “Like and dislike”, symbolized by thumbs showing up- or downwards.</li>\n<li>The panelists can usually see their own ratings and the resulting average ratings. When using scales with positive values, the values can optionally be represented by stars.</li>\n<li>In the admin area and in the export you will find the number of performed ratings and the resulting average rating.</li>\n<li>From EFS 10.3, rating data are integrated into the panel tracking. Furthermore, the rating data have been made available for grouping filters. Thus, it is now possible e.g. to create a group of very active or influential community members.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In order to use the rating function, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Configure the rating function.</li>\n<li>Integrate the rating function into the website.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The necessary operations will be explained in detail in the following chapters.</p>\n<h2 id=\"configuring-the-rating-function\" class=\"wysiwyg-text-align-justify\"><strong>Configuring the Rating Function</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The rating function is configured in the “Rating settings” section of the <strong>Website → Global configuration</strong> menu:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>In the field “Rating scale”, one of the available scales can be selected.<br>– It is not possible to create additional scales or change the predefined scales.<br>– The display of the scale on the website is controlled via the template “tpl_rating”. By default, values on purely positive scales are represented by stars. Scales with negative values show numbers. “Like” and “Like and dislike”, newly introduced in EFS 10.3, are symbolized with thumbs showing up- or downwards.</li>\n<li>Panelists are allowed to change their ratings: With this option you define whether the panelists are allowed to change ratings subsequently.</li>\n<li>From EFS 10.3: Panelists are allowed to revoke their ratings: You can specify whether the panelists are allowed to revoke their ratings.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">It is possible to subsequently switch to another scale in an active panel: The system will then recalculate all existing ratings. Please note, however:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>A subsequent change may lead to questions and misunderstandings among the panelists.</li>\n<li>If you have exported rating data, the export data will be different from the recalculated values.</li>\n</ul>\n<h2 id=\"integrating-the-rating-function-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating the Rating Function into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The rating function is implemented by default. Therefore, only the following minor modifications are usually necessary:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>If you want to use any symbols other than stars, you can simply replace the file.</li>\n<li>You may have to adapt the rating template to the layout of your panel.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adapting the rating symbol</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The star symbol for the rating scale is defined by the image star_rate.png located in the “\\images” file of the <strong>Asset library</strong> → tab <strong>Panel assets</strong>: It contains the star in three different hues.</p>\n<p class=\"wysiwyg-text-align-justify\">If you wish to use a different symbol, create an image in PNG format of the same name, size and structure. Upload this image to your “\\images” file so that the default image is overwritten, or simply rename the default image.</p>\n<p class=\"wysiwyg-text-align-justify\">If you have to use a symbol of different size, this requires further adjustments:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The image is inserted as a background image via the CSS class “.star-rating” in the include “css_default”.</li>\n<li>You may have to adjust the size in the templates “tpl_rating_...”.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adapting the rating template to the panel layout</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The display of the rating functions is largely controlled via the templates “tpl_rating_...”. These template may have to be adapted to the overall layout of your panel.</p>\n<h2 id=\"viewing-using-and-exporting-rating-data\" class=\"wysiwyg-text-align-justify\"><strong>Viewing, Using and Exporting Rating Data</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Two values are recorded as the result of the rating: the number of ratings and the average rating.</p>\n<p class=\"wysiwyg-text-align-justify\">These values are usually displayed on the website right next to the rated contents. In the admin area, you can also view the results in the following places:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Forum, discussion or blog posts: in the respective post overview.</li>\n<li>Ratings of blogs: in the blog overview</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The corresponding exports also contain the rating results.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Number of ratings: Export variable “rating_count”</li>\n<li>Average rating: Export variable “rating_average”</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.3, rating data are integrated into the panel tracking. Furthermore, they have been made available for grouping filters. Thus, it is now possible e.g. to create a group of very active or influential community members.</p>\n<h2 id=\"tagging-and-categorization-of-community-content\" class=\"sc-iGrrsa eYmPYl wysiwyg-text-align-justify\"><strong>Tagging and Categorization of Community Content</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.5, it is possible to tag or categorize community content.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<em>Categories</em> allow to group posts and threads. Thus, panelists can select meaningful topical clusters for their content, and for administrators, it is easier to keep track of the community content.</li>\n<li>\n<em>Tagging</em> is available, too. Tags simplify search for the created content, they are not hierarchical.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Both categories and tags can be assigned to blog posts, forum threads and discussion posts.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">If your panel is upgraded from an earlier version to EFS 10.5, manual modifications of the templates may be necessary to integrate the new tagging functonality completely into the website.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Several new templates are added automatically.</li>\n<li>If blog, discussion and forum templates are used without customization in your panel, the enhancements for tagging will be inserted automatically. Otherwise, a manual modification is necessary.</li>\n</ul>\n<h2 id=\"using-categorization\" class=\"wysiwyg-text-align-justify\"><strong>Using Categorization</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Categories are specified by the administrator in the tagging browser: menu <strong>Website → Classifications →</strong> tab <strong>Categories</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Categories can be grouped.</li>\n<li>\n<p>You can assign a color and meta data to each category.</p>\n</li>\n<li>\n<p>Categories are specified by the administrator, therefore, this feature is always active.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The panelists select the appropriate categories for their content.</p>\n<h2 id=\"activating-and-configuring-tagging\" class=\"wysiwyg-text-align-justify\"><strong>Activating and Configuring Tagging</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">For tags, the panel administrator can decide whether to allow the usage or not, and which conditions should apply. The respective options can be found in the menu <strong>Website → Global configuration</strong>.</p>\n<h2 id=\"using-tagging\" class=\"wysiwyg-text-align-justify\"><strong>Using Tagging</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The panelists themselves create the tags themselves, when writing blog posts, forum threads and discussion posts.</p>\n<p class=\"wysiwyg-text-align-justify\">Administrators can access all tags created by the panelists via the tagging browser in the menu <strong>Website → Classifications →</strong> tab <strong>Tags</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>They can delete or block (i.e. blocklist) tags.</li>\n<li>Two tags with the same meaning can be merged. E.g. all posts with the tag “product” and “products” can be merged into “products”.</li>\n</ul>\n<h2 id=\"denying-use-of-tagging-for-specific-panelists\" class=\"wysiwyg-text-align-justify\"><strong>Denying Use of Tagging for Specific Panelists</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The panel administrator can block specific panelists from using the tagging feature.</p>\n<p class=\"wysiwyg-text-align-justify\">For this purpose, in the panelist’s detail view in <strong>Panelist administration</strong>, go to the section “Permissions” and flag “Not allowed to tag content”.</p>\n<h1 id=\"leaderboard\" class=\"sc-chbbiW dCajGG wysiwyg-text-align-justify\"><strong>Leaderboard</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">A leaderboard can be used to present the best, most active panelists. Thus, you can increase motivation and engagement in your community.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>A specific panel group can be specified as basic set.</li>\n<li>The number of listed panelists can be defined.</li>\n<li>The selection criterion can be chosen from a variety of data, as e.g. date of entry, number of bonus points, average rating the panelist received for community content etc.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The new leaderboard is made available in addition to the existing leaderboard, with its own dedicated function module and its own template. Existing templates are not modified.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Usually, first name and last name of the panelists are displayed, assuming that profile visibility  is configured accordingly. If visibility for both first and last name is deactivated or “Show profile to others” switched of in principle, the default text “withheld” will be displayed.</p>\n<h2 id=\"integrating-the-leaderboard-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating the Leaderboard into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In order to set up the leaderboard, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Leaderboard2” type.</li>\n<li>Select the “func_leaderboard2” module template or „func_leaderboard2_light“ for a sidebar integration.</li>\n<li>Configure the setting options as required.</li>\n</ol>\n<h2 id=\"table-based-leaderboard\" class=\"wysiwyg-text-align-justify\"><strong>Table-Based Leaderboard</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Since EFS 10.0, a first, table-based version of the leaderboard has been available. It includes three rankings. The length of the lists can be configured as desired.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>All Time: Overall number of bonus points the panelists collected.</li>\n<li>Accumulated: Current number of bonus points.</li>\n<li>Stars: Virtual points awarded by other panelists in the chosen social currency of the panel.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Integrating the Leaderboard into the Website</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In order to set up the leaderboard, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Leaderboard” type.</li>\n<li>Select the “func_leaderboard” module template.</li>\n<li>Configure the setting options as required.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What are the system requirements for text search?</h3>\n<p class=\"wysiwyg-text-align-justify\">Text search requires EFS 9.1 or higher and special programming. The Panel installation must also meet specific system requirements. Contact support for more information.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I create custom rating scales?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, it is not possible to create additional scales or change the predefined scales. You can only select from the available scales provided by the system.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">How can I prevent specific panelists from using the tagging feature?</h3>\n<p class=\"wysiwyg-text-align-justify\">In the panelist's detail view in Panelist Administration, go to the \"Permissions\" section and flag \"Not allowed to tag content\" for the specific panelists you want to block from using the tagging feature.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>",
    "user_segment_ids": []
}