{
    "id": 20370640908562,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370640908562.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370640908562-Survey-Options-Table-Overview",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:18:45Z",
    "updated_at": "2024-08-21T12:27:05Z",
    "name": "Survey Options (Table Overview)",
    "title": "Survey Options (Table Overview)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T11:11:43Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide to survey options in the questionnaire system, covering general settings, internal organization, login options, data types, and relevant verification.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on the various configuration options available for surveys, including privacy settings, data handling, participant access, and fraud prevention measures.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#general-options\">General Options</a></li>\n<li><a href=\"#internal-organization\">Internal Organization</a></li>\n<li><a href=\"#login-options\">Login Options</a></li>\n<li><a href=\"#data-types\">Data Types</a></li>\n<li><a href=\"#relevantid\">RelevantID</a></li>\n</ul>\n<h2 id=\"general-options\" class=\"wysiwyg-text-align-justify\"><strong>General Options</strong></h2>\n<table class=\"wysiwyg-text-align-justify\" style=\"height: 5618px;\" border=\"1\" width=\"794\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 354.0px;\"> <col style=\"width: 406.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 366.215px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Section</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 420.486px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Description</strong></p>\n</th>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Privacy assistant</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>By activating this function you can ensure GDPR-compliant data processing and survey execution.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Log changes to the questionnaire</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>If this option has been ticked, all changes to the questionnaire for which variables were added or removed will be documented.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>The questions are numbered consecutively</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This feature leads to an automatic consecutive numbering of questions 1 to n.</p>\n<p>Question type 998 (Text and HTML code), 911, filters, and rotation on page level will not be taken into consideration.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Prevent modification of already given answers when participants use browser functions to go back in the questionnaire</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>If participants use browser functions (e.g. Browser Back or History) to go backward in the questionnaire and try to change already-given answers, the new entries will not be saved. Instead, the existing entries will be kept.</p>\n<p>Please note that the function cannot be combined with a displayed Back button: If the Back button is displayed, the respondent expects with the due right that a subsequent change of the values is possible.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Radio buttons for questions with a single response list can be deselected</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This feature works only if JavaScript is enabled.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Preventing usage of the right mouse button in a survey</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This feature is primarily used to protect content: It deactivates the context menu in the entire questionnaire. Please mind:</p>\n<ul>\n<li>\n<p>Keyboard commands however will not be suppressed.</p>\n</li>\n<li>\n<p>Using a question of the type “Text and image”, you can realize the same behavior for a particular questionnaire page.</p>\n</li>\n</ul>\n<p>The feature can also be used to prevent the usage of the browser’s Back button. For this, the survey must be opened in a pop-up window so that there is no menu bar.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>The page is submitted automatically<br>after completion of all questions, if it contains only combinations<br>of the following question types...</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>The respondent does not need to click on the Submit button on pages that only contain the specified combinations of question types.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Should a <strong>Back</strong> button be displayed?</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>If this option has been activated, a real Back button will be shown which does not depend on the browser used by the respondent.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Type of codes that will be generated</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This function is only visible for personalized projects.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Enable data cleaning</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Activates automatic data cleaning. If a respondent uses the “Back” button in the questionnaire or that of the browser while completing a questionnaire, they may pass the same filter question more than once, giving different answers and then being routed into another filter branch, where they will answer different questions.</p>\n<p>Example: Somebody answers the question of whether they drive a car with “Yes” and is subsequently asked all car-related questions. Then, they go back to the questionnaire and state they do not drive a car. A filter lets them skip all car-related questions now. When the respondent completes the survey, they will have stated they do not drive a car. Nonetheless, all car-related variables will contain values.</p>\n<p>In the past, such irrelevant data had to be manually cleaned from the result data. With the “Data cleaning” function, this cleaning process has been automated.</p>\n<p>Please note:</p>\n<ul>\n<li>\n<p>Data cleaning only considers completed interviews, i.e. records with<br>status 31 or 32.</p>\n</li>\n<li>\n<p>The following routing types are supported:</p>\n<ul>\n<li>\n<p>“Filter” and “Random rotation” branches.</p>\n</li>\n<li>\n<p>Trigger types that affect routing via changes in the survey results. The function should, however, not be used in projects involving page triggers: In this case, the routing that the respondent took erroneously or for test purposes cannot be unambiguously identified.</p>\n</li>\n<li>\n<p>Action pages</p>\n</li>\n<li>\n<p>Depot questions</p>\n</li>\n<li>\n<p><em>Survey</em>-side Back buttons. Please note: that browser-side Back buttons are not fully supported. If a respondent skips back several pages using the browser <strong>Back</strong> button first and then skips forward several pages using the browser <strong>Forward</strong> button ignoring the system warning, these steps cannot be tracked and stored correctly. I.e. pages might be missing in page history, though valid data from these pages exist.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>“Random rotation” branches and loops are not supported.</p>\n</li>\n<li>\n<p>Data cleaning should not be applied to surveys that are prefilled with values. I.e. it should not be combined with the options “Transfer master data values to survey variables” -&gt; “Always prefill”, “Allow multiple participations, prefill with values of last participation” and import of specific answers from other projects</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>For all possible answers of the type “answer option + text”, completeness checks (DACs)<br>should also check whether the related text field has been filled in.</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>In the standard configuration, answer categories of the “answer option + text” type are only checked to verify whether the respondent has clicked on a radio button or a checkbox. However, you have the option of configuring the DAC in such a way that the respondent must select the answer option containing the text field and fill in the text field.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Name of ticket variable (external survey start)</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Option for changing the name of the Get parameter used for the external survey start.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Name of ticket variable (when returning from an external survey)</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Option for changing the name of the Get parameter transferred upon returning from an external survey.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Check whether the respondents have Java Script activated, whether the Adobe Flash Player<br>plugin is available, and which device they are using.</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This option must be activated if you want the survey variables “javascript”, “flash” and the device type to be filled.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Detect participants' location using the IP address</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>If you activate this function, the available <a href=\"https://qbdocs.atlassian.net/wiki/spaces/DOC/pages/1231913034/Survey+Variables#Location-variables\">location variables</a> (<em>participant_continent</em>, <em>participant_country</em>, <em>participant_city</em>, <em>participant_region</em>, <em>participant_latitude,</em> and <em>participant_longitud</em>), will be used. The metadata about the locations of the survey participants will be stored in these variables.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Detect participants' device type using the user-agent information</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>If you activate this function, the available <a href=\"https://qbdocs.atlassian.net/wiki/spaces/DOC/pages/1231913034/Survey+Variables#Device-Variables\">device variables</a> (participant_os, participant_device, participant_brand, participant_model, and participant_isbot), will be used. The metadata for the used devices of the survey participants will be stored in these variables.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>All panelists can participate in the survey (independent from being in a sample for the survey)</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This option is only available for master data and panel<br>surveys. If the checkbox is ticked, the survey is active and the appropriate field period has been set, the link to the survey will be shown on the personal homepages of all panelists, and all of them will be allowed to participate.<br>By default, this option is activated for master data surveys and deactivated for panel surveys.<br>You can trace, which panelists took the opportunity to participate with the help of the automatically generated sample “internal”: This sample records all participants that took part. If you send out e-mail invitations to a master data survey instead of simply<br>having the link displayed, you will also find all invited panelists in the “internal” sample and can keep track of who participates.</p>\n<p>Apart from the automatically generated sample, you cannot set up any further samples for master data surveys.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Maximum number of respondents active at the same time</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>You can set an upper limit of simultaneously active respondents. Participants with the disposition codes 20, 21, and 23 are active survey participants. Participants who have finished the survey (or have not been active for more than five minutes) are no longer active survey participants. Every 90 seconds, the software checks whether the upper limit has been exceeded. If this is the case, possible participants are rejected until the number of participants falls below the upper limit again, i.e. at least 90 seconds.</p>\n<p> </p>\n<p>The limit however can only undercut an eventual installation-wide setting for the maximum number of participants per project, it cannot bypass it.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Behavior on resumption</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Used to control the routing of the survey on resumption. The following options are available:</p>\n<ul>\n<li>\n<p>Display page last sent.</p>\n</li>\n<li>\n<p>Send the page last sent again and display the next page.</p>\n</li>\n<li>\n<p>Display page last viewed.</p>\n</li>\n<li>\n<p>Display first page: The respondent will be redirected to the first page after resuming the survey. This is advisable, for example, if your questionnaire is divided into different chapters that are accessed via an index page. In this case, the respondent is not to resume the survey from the last page sent, but from the index page.</p>\n</li>\n</ul>\n<p>By default, the setting is “Display page last sent”.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Determine participant hostnames and IP addresses and store them in survey results  </p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>This option is used to activate the determination and storage of hostnames and IP addresses.</p>\n<ul>\n<li>\n<p>This option is deactivated in new projects by default.</p>\n</li>\n<li>\n<p>To change the setting or to view and export hostnames and IP addresses, you need <em>ip_addresses</em> read rights.</p>\n</li>\n</ul>\n<p>Please note: Certain network constellations may allow only restricted determination and storage of hostnames and IP addresses. Please note the corresponding information and check the functionality before taking the project into the field.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Accounting organization</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Indicates to which client the project belongs and is used for billing purposes (i.e., interviews conducted within this project are booked to the given organization). If the wrong organization is indicated, please contact the person responsible for the installation. If you hold the right “org admin”, you can alter the accounting organization in the <strong>Project Properties</strong> menu.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Mail template for automatic reminders</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>If you use automated dispatch of reminders, the appropriate mail template is selected in this field.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Show cookie policy</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Determines whether or not your company‘s cookie policy will be displayed during survey participation.</p>\n<p>Any texts necessary must be added to the Survey messages.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 358.194px;\">\n<p>Select whether a header with X-Frame-Options should be sent to the client</p>\n</td>\n<td style=\"width: 412.465px;\">\n<p>Today, almost any browser makes it possible for web applications to send an HTTP header „X-Frame-Options“ which declares to the browser if a certain website is allowed to be shown in a frame or not.</p>\n<p>Possible value options are:</p>\n<ul>\n<li>\n<p><strong>Do not send</strong>: By the mentioned default value the header is not sent, which effectively leads to permission of framing.</p>\n</li>\n<li>\n<p><strong>Deny</strong>: The header is sent and will prevent any framing.</p>\n</li>\n<li>\n<p><strong>Same origin</strong>: The header is sent and will allow framing only by the website of the same domain.</p>\n</li>\n</ul>\n<p>By default, this header is not sent. “Deny\" denies the display of pages in all frames, regardless of their domain. With \"Same domain\" pages are only displayed in frames whose parent page belongs to the same domain. Please note that the behavior depends on the client browser used.</p>\n<p>If you want to prevent XSS you can set the option to \"Deny\" (very strict) or to \"Same domain\" (then you can embed the survey in frames on the same page e.g. the panel website or portals).</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"internal-organization\" class=\"wysiwyg-text-align-justify\"><strong>Internal Organization</strong></h2>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 268.0px;\"> <col style=\"width: 492.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Section</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p class=\"wysiwyg-text-align-center\"><strong>Brief description</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Show to-do marker in the questionnaire editor</p>\n</td>\n<td>\n<p>Enables the entry of to-do notes in the questionnaire view.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Debug console and links to the questionnaire editor</p>\n</td>\n<td>\n<p>Displays debug info icon in the toolbar and direct links to page and question view in the questionnaire for testing purposes.</p>\n<p>For question type 911, the links are not available.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>To-do marker in the survey</p>\n</td>\n<td>\n<p>Ticking this checkbox will show the to-do marker icon in the toolbar and you can directly enter to-do notes from the questionnaire.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Pretest comments in the survey</p>\n</td>\n<td>\n<p>Ticking this checkbox will show the pretest icon in the toolbar, allowing testers to enter their comments.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Boss button and page selection in the survey</p>\n</td>\n<td>\n<p>The boss button in the toolbar allows you to skip plausibility and completeness checks.</p>\n<p>The drop-down list in the toolbar makes it possible to navigate directly to specific questionnaire pages.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Language selection in the survey</p>\n</td>\n<td>\n<p>In multilingual projects, this drop-down list in the toolbar makes it possible to switch directly to another language.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Links to EFS Translator Interface</p>\n</td>\n<td>\n<p>In the questionnaire and the preview, links are activated which enable you, your testers, and translators (depending on access rights) to jump directly into the respective editing pages of the <strong>Language editor</strong> or EFS Translator Interface.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Algorithm for creating the external variable names</p>\n</td>\n<td>\n<p>The external variable names can be uniformly labeled according to a predefined pattern.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"login-options\" class=\"wysiwyg-text-align-justify\"><strong>Login Options</strong></h2>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 197.0px;\"> <col style=\"width: 167.0px;\"> <col style=\"width: 396.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Project type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Login type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Description</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Personalized survey</p>\n</td>\n<td>\n<p>E-mail and password</p>\n</td>\n<td>\n<p>Participants receive a link and a password - usually via e-mail. Clicking on this link will open a login window, into which the respondents must enter their e-mail address and password.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Code</p>\n</td>\n<td>\n<p>A code is a personalized survey password that is attached to a link. Clicking on the link will take the respondent directly to the survey, bypassing the login window (if the code is valid).</p>\n</td>\n</tr>\n<tr>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Password</p>\n</td>\n<td>\n<p>For this login procedure, respondents must enter their password into a login form.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Anonymous survey</p>\n</td>\n<td>\n<p>No restriction on access</p>\n</td>\n<td>\n<p>Respondents click on a link <a href=\"http://www.mydomain.com/uc/\">http://www.mydomain.com/uc/</a><br>survey/ or the link is opened in the pop-up window by Java-<br>Script. Respondents can participate in the survey with no<br>further verification of access.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p> </p>\n</td>\n<td>\n<p>IP</p>\n</td>\n<td>\n<p>The so-called referrer, an IP address that specifies the IP address last visited by the respondent, is checked. This login option ensures that the respondent is being referred from the website you wish to evaluate and has not found out about the survey from other sources.</p>\n<p>Please note: Certain network constellations may allow only<br>restricted determination and storage of hostnames and IP<br>addresses.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Password</p>\n</td>\n<td>\n<p>The password specified here is a password shared by all participants of the survey. Any participant who has the password can participate in the survey (even more than once).</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Panel survey, Master data survey</p>\n</td>\n<td>\n<p>Sample</p>\n</td>\n<td>\n<p>Panel and master data survey based on a drawn sample. Respondents usually receive the link to the survey on their homepage after logging in. Alternatively, a URL, such as <a href=\"http://www.mypanel.com/gto.php3?code#code#\">http://www.mypanel.com/gto.php3?code#code#</a> can be used, and #code# will be replaced with a personalized access code by the mail dispatch tool.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"data-types\" class=\"wysiwyg-text-align-justify\"><strong>Data Types</strong></h2>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 171.0px;\"> <col style=\"width: 118.0px;\"> <col style=\"width: 235.0px;\"> <col style=\"width: 236.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Data types</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Explanation</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Size</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Big Integer</p>\n</td>\n<td>\n<p>bigint</p>\n</td>\n<td>\n<p>Big whole numbers</p>\n</td>\n<td>\n<p>Threshold values:</p>\n<ul>\n<li>\n<p>9223372036854775808 to 9223372036854775807</p>\n</li>\n</ul>\n<p>(19 characters)</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Short text</p>\n</td>\n<td>\n<p>text</p>\n</td>\n<td>\n<p>Strings of numbers and letters with variable length</p>\n</td>\n<td>\n<p>max. 255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Integer or floating point numbers</p>\n</td>\n<td>\n<p>float</p>\n</td>\n<td>\n<p>A whole number or floating point number.</p>\n</td>\n<td>\n<p>10 characters</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"relevantid\" class=\"wysiwyg-text-align-center\"><strong>RelevantID</strong></h2>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 245.0px;\"> <col style=\"width: 515.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Field</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p class=\"wysiwyg-text-align-center\"><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>RelevantID authentication code</p>\n</td>\n<td>\n<p>Authentication code of the installation. If you have ordered the feature, yet no value has been set, please get in touch with your sales contact.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Activate RelevantID verification for this survey</p>\n</td>\n<td>\n<p>This checkbox must be ticked to activate the check for the current project.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Survey variable for saving the result of the geo IP validation</p>\n</td>\n<td>\n<p>Select a user-defined variable. The variable must be of the “Integer” data type.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Survey variable for saving the confidence value</p>\n</td>\n<td>\n<p>Select a user-defined variable. The variable must be of the “Integer” data type.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Save additional optional variables in</p>\n</td>\n<td>\n<p>The following information can optionally be stored in user-defined variables as well:</p>\n<ul>\n<li>\n<p>FraudProfileScore: fraudprofilescore • City: city</p>\n</li>\n<li>\n<p>Domain: domain</p>\n</li>\n<li>\n<p>County: Country</p>\n</li>\n<li>\n<p>Region: Region</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Scope of geo IP verification</p>\n</td>\n<td>\n<p>The desired scope: You may select either country, region, or city.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Allowed geo IP values for participants</p>\n</td>\n<td>\n<p>International codes of the countries, regions, or cities from which participants are to be admitted.</p>\n<ul>\n<li>\n<p>Please contact support to receive an up-to-date list of codes.</p>\n</li>\n<li>\n<p>Please enter the allowed values in a comma-separated list.</p>\n</li>\n<li>\n<p>If necessary, it is possible to enter a complete list of all country codes.</p>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What is the purpose of the privacy assistant?</h3>\n<p class=\"wysiwyg-text-align-justify\">The privacy assistant ensures GDPR-compliant data processing and survey execution, helping to maintain legal compliance with data protection regulations.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">How does the data cleaning functionality work?</h3>\n<p class=\"wysiwyg-text-align-justify\">Data cleaning automatically removes irrelevant data from completed interviews when respondents change their answers to filter questions, ensuring data consistency and accuracy.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">What are the benefits of using RelevantID?</h3>\n<p class=\"wysiwyg-text-align-justify\">RelevantID helps verify participant authenticity and prevent fraud by checking geographical locations and other factors, improving the quality and reliability of survey data.</p>",
    "user_segment_ids": []
}