{
    "id": 20371056096018,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371056096018.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371056096018-Search-and-replace",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:46:46Z",
    "updated_at": "2024-08-19T19:56:09Z",
    "name": "Search and replace",
    "title": "Search and replace",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T08:39:12Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\">Overview</h1>\n<p>This article explains the \"Search and replace\" function in a questionnaire editing tool, which allows users to search for and modify text elements across a project efficiently.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>The \"Search and Replace\" feature enables users to search question texts, answers, and fill-in instructions for specific keywords and optionally change the text in one step. It offers various options to refine the search and streamline the editing process.</p>\n<ul>\n<li><a href=\"#using-search-and-replace\">Using Search and Replace</a></li>\n<li><a href=\"#viewing-the-results\">Viewing the results</a></li>\n<li><a href=\"#replacing-text-elements\">Replacing text elements</a></li>\n</ul>\n<h3 id=\"using-search-and-replace\">Using Search and Replace</h3>\n<p><strong>Search and replace</strong> is invoked via the menu item in the questionnaire view. The search text is entered in the search form. The search results will include any terms that contain the keyword (e.g. „questionnaire“ when searching for „question“). Optionally, you may also specify the following restrictions or criteria:</p>\n<ul>\n<li>\n<p>Page to be searched: This option allows to restriction of the search to a specific questionnaire branch.</p>\n</li>\n<li>\n<p>Survey language: By default, the search is performed in the default language.</p>\n</li>\n<li>\n<p>Search type</p>\n<ul>\n<li>\n<p>Normal search: Default setting</p>\n</li>\n<li>\n<p>Case sensitive</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Text type: You can, for example, restrict your search to scale titles or long variable names.</p>\n</li>\n</ul>\n<p>To trigger the search, click on the <strong>Search</strong> button.</p>\n<p>The “Search and replace” function covers &lt;img&gt; tags used e.g. in the HTML question type to insert images, and references from image question types to<br>image files. When replacing texts, please ensure that no HTML elements or references to files are changed inadvertently.</p>\n<h3 id=\"viewing-the-results\">Viewing the results</h3>\n<p>In the results table the results are listed, sorted by page, with the following information:</p>\n<ul>\n<li>\n<p>Type: Text type</p>\n</li>\n<li>\n<p>This “Search and Replace” dialog allows you to perform a specific search within a questionnaire branch under a particular page.</p>\n</li>\n<li>\n<p>Content: The text of the respective question, answer option or fill-in instruction. The keyword is highlighted.</p>\n</li>\n<li>\n<p>Replace: see below.</p>\n</li>\n<li>\n<p>Actions:</p>\n<ul>\n<li>\n<p><strong>Edit page</strong>: This icon allows you to call up and directly edit the respective page in the questionnaire editor.</p>\n</li>\n<li>\n<p><strong>Preview</strong>: Opens the respective page in the questionnaire preview.</p>\n</li>\n<li>\n<p><strong>Edit language elements</strong>: In multilingual projects, this icon allows you to switch to the relevant page in the <strong>Language editor</strong>.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"replacing-text-elements\">Replacing text elements</h3>\n<p>If you wish to edit text elements centrally, first select the search results for modification in the “Replace” column. Then enter the new text element in the “Replace with” field. Your changes will be performed once you click on the <strong>Replace</strong> button.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq_case_sensitive\">Is the search case-sensitive by default?</h3>\n<p>No, the default search is not case-sensitive. However, you can enable case-sensitive search in the search options.</p>\n<h3 id=\"faq_multilingual\">Can I use Search and Replace in multilingual projects?</h3>\n<p>Yes, you can search in different language versions of your project by selecting the desired survey language in the search options.</p>\n<h3 id=\"faq_html_tags\">Does Search and Replace affect HTML tags?</h3>\n<p>The function covers &lt;img&gt; tags and references to image files. Be cautious when replacing text to avoid inadvertently changing HTML elements or file references.</p>",
    "user_segment_ids": []
}