{
    "id": 20370232914194,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370232914194.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370232914194-Quotas",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T15:59:04Z",
    "updated_at": "2024-08-28T09:14:24Z",
    "name": "Quotas",
    "title": "Quotas",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T08:56:44Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about managing quotas in survey projects. It covers quota creation, configuration, statistics, and best practices for implementing quota systems in various survey scenarios.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Quotas are essential tools for controlling survey participation and ensuring balanced representation in research projects. This guide explains how to set up, manage, and monitor quotas effectively.</p>\n<ul>\n<li><a href=\"#quotas\">Quotas</a></li>\n<li><a href=\"#configuration\">Configuration</a></li>\n<li><a href=\"#quota-statistics\">Quota statistics</a></li>\n<li><a href=\"#basics\">Basics</a></li>\n<li><a href=\"#questionnaire-checking-internal-quotas\">Questionnaire: checking internal quotas</a></li>\n<li><a href=\"#routing-and-evaluation\">Routing and evaluation</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"quotas\" class=\"wysiwyg-text-align-justify\">Quotas</h2>\n<p class=\"wysiwyg-text-align-justify\">When you open the Projects → {Selected project} → <strong>Questionnaire editor</strong> → <strong>Quotas</strong> menu, you are automatically directed to the overview of the existing quotas. They are listed along with information on status, current allocation (“quota count”), and quota conditions.</p>\n<h3 id=\"managing-the-quotas\" class=\"wysiwyg-text-align-justify\">Managing the quotas</h3>\n<p class=\"wysiwyg-text-align-justify\">Managing the quotas - and, in particular, editing several quotas en bloc - is done via the “Actions” checkbox and the drop-down list below the table:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Delete quota</strong>s: The respective quotas will be deleted.</p>\n</li>\n<li>\n<p><strong>Activate quotas</strong>: This option allows you to activate several quotas en bloc. If you want to activate an individual quota, you can simply click on Edit and open the edit dialog.</p>\n</li>\n<li>\n<p><strong>Deactivate quotas</strong>: This option allows you to deactivate several quotas en bloc. If you want to deactivate an individual quota, you can simply click on Edit and open the edit dialog.</p>\n</li>\n</ul>\n<h3 id=\"using-icons\" class=\"wysiwyg-text-align-justify\">Using Icons</h3>\n<p class=\"wysiwyg-text-align-justify\">If you want to edit individual quotas, the following actions can be applied by clicking on the corresponding icons:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Order</strong>: The <strong>arrow</strong> icons allow you to change the processing order.</p>\n</li>\n<li>\n<p><strong>Edit condition</strong>: Clicking on this icon opens the condition editor.</p>\n</li>\n<li>\n<p><strong>Delete condition</strong>: The respective condition will be deleted. Please note that the allocation figure of the quota will be maintained.</p>\n</li>\n<li>\n<p><strong>Edit</strong>: Clicking on this icon opens the edit dialog of a quota. Here you can change the name and size of the quota; you can also activate or deactivate the quota.</p>\n</li>\n<li>\n<p><strong>Copy</strong>: This icon allows you to copy a quota. When doing so, the status will be deactivated, the allocation figures will not be copied, i.e. the new quota is initially open, deactivated, and empty.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: The quota will be removed following a confirmation prompt.</p>\n</li>\n</ul>\n<h3 id=\"creating-quotas\" class=\"wysiwyg-text-align-justify\">Creating quotas</h3>\n<p class=\"wysiwyg-text-align-justify\">In order to create quotas, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Create quota</strong> button.</p>\n</li>\n<li>\n<p>Enter the name and the size of the new quota.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The condition editor will open automatically. Define the desired quota condition and click on <strong>Save</strong>. (If you do not define any condition, the quota will not be activated in this step.)</p>\n</li>\n<li>\n<p>After saving, the quota overview will be displayed. There you will find the new quota. It will already be activated.</p>\n</li>\n</ul>\n<h3 id=\"importing-quotas\" class=\"wysiwyg-text-align-justify\">Importing quotas</h3>\n<p class=\"wysiwyg-text-align-justify\">Alternatively, <em>EFS</em> allows you to import new quotas. Click on the <strong>Import quotas</strong> button to open the CSV-based import dialog. You can enter one quota per row, using the format label; size; and (alternative) condition. This syntax is easily generated by filling in a 4-column Excel table and saving it in CSV format. Quotas can then easily be imported via copying and pasting the table contents. It does not matter if semicolons or tab stops are used as a separator in the imported file.</p>\n<h2 id=\"configuration\" class=\"wysiwyg-text-align-justify\">Configuration</h2>\n<p class=\"wysiwyg-text-align-justify\">You are allowed to specify in detail the sequence of the quota process in your project. You will find the configuration options on the <strong>Configuration</strong> tab.</p>\n<h3 id=\"overview-of-the-all-available-setting-options\" class=\"wysiwyg-text-align-justify\">Overview of all available setting options</h3>\n<p class=\"wysiwyg-text-align-justify\">By combining these options, you can realize a wide range of processes. By default, all options are activated for new projects and the pre-set allocation mode is “First matching, open quota”. This corresponds to the previous standard mode.</p>\n<table class=\"wysiwyg-text-align-justify\" style=\"height: 1803px;\" border=\"1\" width=\"750\" data-layout=\"default\">\n<colgroup> <col style=\"width: 196.0px;\"> <col style=\"width: 442.0px;\"> <col style=\"width: 122.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 189.809px;\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Option</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 431.337px;\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 118.472px;\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Preallocation</strong></p>\n</th>\n</tr>\n<tr>\n<td style=\"width: 181.788px;\">\n<p>Option 1: If matching external quota is full, reject participants at survey start</p>\n</td>\n<td style=\"width: 423.316px;\">\n<p>This option only applies to external quotas. I.e. usage is only reasonable in personalized surveys, employee surveys, multi-source feedback, panel surveys, and master data surveys with external quota.</p>\n<ul>\n<li>\n<p>If this option is not activated, participants falling within a full external quota can still open the survey. How they will be handled in the course of the survey, i.e. whether they will be screened out by quota, for example, depends on the further configuration and the structure of the questionnaire.</p>\n</li>\n<li>\n<p>If this option is activated, the system will continuously check during the project whether any participants who have not yet started the survey fall within a full external quota. If this is the case, these participants will be excluded from the outset, i.e. they are assigned disposition code 41 (“Quota closed”) in the participant administration. Any data accumulated by the participant (during the respective survey) will be deleted in this process and will not be considered in the survey. If these participants try to log in, they will be rejected and assigned disposition code 35 (“rejected at login (quota closed)”). The quota variables of the excluded participants are allocated as follows: “quota” = “-77”, “quota_assignment” = “-66”.</p>\n</li>\n</ul>\n<p>When activating this option, make sure that respondents who are rejected at login will not be confused:</p>\n<ul>\n<li>\n<p>In your invitation, indicate that only the first participants may be able to see the questionnaire.</p>\n</li>\n<li>\n<p>In the <strong>Project properties</strong> → <strong>Survey messages</strong> menu, adapt the text of the message for the rejected participants (“The participant is not accepted for the survey, as the quota is already full (status: filtered out).”).</p>\n</li>\n</ul>\n</td>\n<td style=\"width: 110.451px;\">\n<p>yes</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 181.788px;\">\n<p>Option 2: If the matching quota is full, do not allocate participants to any quota (quota=0)</p>\n</td>\n<td style=\"width: 423.316px;\">\n<p>If in the course of answering the questionnaire, the participants fall within a full quota and this option has been activated, then the quota variable will be set to “0”, i.e. they will not be allocated to any quota.</p>\n<p>In this case, the quota variables of the participants are allocated as follows:</p>\n<ul>\n<li>\n<p>“quota” = “0”</p>\n</li>\n<li>\n<p>“quota_assignment” = “-99”</p>\n</li>\n</ul>\n<p>To screen out these participants by quota, you may, for example, set a filter to “quota = 0” and redirect the participants to an intermediate final page. They will then receive e.g. disposition code 36 (“rejected (quota closed)”).</p>\n</td>\n<td style=\"width: 110.451px;\">\n<p>yes</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 181.788px;\">\n<p>Option 3: Increment any matching, open quota at survey end by 1</p>\n</td>\n<td style=\"width: 423.316px;\">\n<p>With this option, you can control how the allocation figures (quota count) are to be changed at the end of the survey:</p>\n<ul>\n<li>\n<p>If this option is not activated, the participants will be allocated to one matching, open quota after completing the survey. Which quota this will be depends on the selected allocation mode and on the defined order.</p>\n</li>\n<li>\n<p>If this option is activated, the participants will be allocated to all matching, open quotas. In this case, all these quotas will be increased by +1.</p>\n</li>\n</ul>\n<p>The quota variables of the participants are allocated as follows:</p>\n<ul>\n<li>\n<p>“quota” = one quota, depending on the selected allocation mode and the defined order.</p>\n</li>\n<li>\n<p>“quota_assignment” = all quotas whose allocation figures (quota count) have been changed. If this option is deactivated, “quota_assignment” contains the same quota ID as quota”.</p>\n</li>\n</ul>\n</td>\n<td style=\"width: 110.451px;\">\n<p>yes</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 class=\"wysiwyg-text-align-justify\"> </h3>\n<h3 id=\"allocation-mode\" class=\"wysiwyg-text-align-justify\">Allocation mode</h3>\n<p class=\"wysiwyg-text-align-justify\">Via the allocation mode, you control to which quota a participant will be allocated if there are various matching open quotas. This selected quota will then be recorded in the variable quota and may be used e.g. for filtering. The following options are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>First matching, open quota: The matching open quota that is first in the sorting order will be allocated to the participant and recorded in “quota”. If “quota_assignment” contains various quota IDs, these will be sorted in ascending order.</p>\n</li>\n<li>\n<p>Random matching, open quota: From the matching open quotas one is chosen at random.</p>\n</li>\n<li>\n<p>Last matching, open quota: The matching open quota that is last in the sorting order will be allocated to the participant and recorded in “quota”. If<br>“quota_assignment” contains various quota IDs, these will be sorted in descending order.</p>\n</li>\n<li>\n<p>Matching, open quota with the fewest participants allocated to it: The system will select the matching open quota that currently has the lowest allocation. If two quotas have equally few participants, the system will select the one that is first in the sorting order.</p>\n</li>\n<li>\n<p>Matching, open quota with the most allocated participants: The system will select the matching open quota with the highest current allocation. If two quotas have the same number of participants, the system will select the one that is first in the sorting order.</p>\n</li>\n<li>\n<p>First matching, open quota with the lowest filling ratio: The participant is allocated to the matching quota first in order with the lowest filling ratio.</p>\n</li>\n<li>\n<p>First matching, open quota with the highest filling ratio: The participant is allocated to the matching quota first in order with the highest filling ratio (recorded in quota).</p>\n</li>\n</ul>\n<h2 id=\"quota-statistics\" class=\"wysiwyg-text-align-justify\">Quota statistics</h2>\n<p class=\"wysiwyg-text-align-justify\">You will find the current allocation figures of the project in the <strong>Quotas</strong> menu on the<strong> Quota statistics</strong> tab and the section “Quota statistics” of the field report. Each quota is listed along with the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Quota ID: Unique identifier of the quota, assigned by the system</p>\n</li>\n<li>\n<p>Name</p>\n</li>\n<li>\n<p>Quota limit: The quota size specified when creating</p>\n</li>\n<li>\n<p>Quota count: Current allocation figure</p>\n</li>\n<li>\n<p>Status: Indicates whether a quota is open, full, or inactive</p>\n</li>\n<li>\n<p>Number of interviews that meet the quota condition: Indicates how many of the completed interviews (disposition codes 31, 32) meet the respective quota condition as currently defined. Depending on the selected configuration, this value may differ from the quota count.</p>\n</li>\n<li>\n<p>Filling degree: (number of interviews which meet the quota condition) / quota limit</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If there are 200 or more quotas in a given project, you have to open the “Quota statistics” section in the Field report explicitly. This prevents unnecessary delays caused by long processing times.</p>\n<h3 id=\"recalculating-quotas\" class=\"wysiwyg-text-align-justify\">Recalculating quotas</h3>\n<p class=\"wysiwyg-text-align-justify\">It is possible to manually trigger a recalculation of the quotas. Occasionally, this may be necessary to adjust the quota allocation to the actual number of participants. Possible applications:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The quota statistics will be reset automatically if you compile the project completely, i.e. with deletion of all result data (see Chapter 3.3, p. 71). But when deleting individual participants who have already taken part or applied Reset and delete data, the actual value in the quota statistics will be updated automatically. Only when executing a reset without deleting data will the actual value not be updated automatically as there have been results accumulated which are displayed e. g. in the detailed view of the survey statistics.</p>\n</li>\n<li>\n<p>If you check the project using a tester account for which a quota is set only once but which generates entries for the allocation every time you click through the project, you can use the update function to undo this effect.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the course of recalculation, the existing quota results will be irretrievably overwritten. Recalculation should not be triggered during an ongoing field phase. The following takes place during recalculation:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>All quotas are reset to zero allocation and opened.</p>\n</li>\n<li>\n<p>After this, the quotas are checked individually for each participant. In larger projects (i.e., many quotas and/or many participants) this process may take quite a while.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">During recalculation new participants may enter into the project and additionally fill up quotas where they would normally be rejected. At the same time it may happen that participants who have already completed the questionnaire are subsequently screened out by quota.</p>\n<h3 id=\"triggering-recalculation\" class=\"wysiwyg-text-align-justify\">Triggering recalculation</h3>\n<p class=\"wysiwyg-text-align-justify\">Recalculation is triggered by clicking on the <strong>Recalculate quota</strong> button on the<strong> Quota Statistics</strong> tab in the<strong> Quotas</strong> menu.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"basics\" class=\"wysiwyg-text-align-justify\">Basics</h2>\n<h3 id=\"specifications\" class=\"wysiwyg-text-align-justify\">Specifications</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The following variables can be used in the quota conditions: Project variables, userdefined variables and GET parameters, various system data and, depending on the type of project, participant data, address data of panelists, all master data and tracking variables in the panel.</p>\n</li>\n<li>\n<p>A wide range of configuration options allows you to adjust the quota process to your requirements. For example, it is up to you to decide whether participants shall be excluded right from the start of the survey if they are no longer required, or you can have the participants allocated to all matching open quotas instead of only one quota.</p>\n</li>\n<li>\n<p>In particular, the quota function is able to react dynamically to allocation figures. This can be used to fill up especially those quotas with lower allocation figures.</p>\n</li>\n<li>\n<p>Participants that are no longer required may be screened out using filters.</p>\n</li>\n<li>\n<p>The runtime check covers errors that may have occurred in quota while processing the survey.</p>\n</li>\n<li>\n<p>Quota statistics and field reports will always give you an up-to-date overview of the quota status.</p>\n</li>\n<li>\n<p>The ACL right <em>quotation_admin</em> allows to control access to the quotas. Read rights are required for accessing the quota statistics in the field report. Write rights are required for using the quotas.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The number and complexity of the quotas in a project affects the performance. Therefore, it is recommended to use not more than 300 quotas per project.</p>\n<h3 id=\"work-steps-for-creating-a-quota\" class=\"wysiwyg-text-align-justify\">Work Steps for Creating a Quota</h3>\n<p class=\"wysiwyg-text-align-justify\">Plan the quota. Create your quota schedule and calculate the target values for the various quota cells. Target values are always absolute numbers. Define the exact sequence of the quota process. Please bear in mind that values for all variables used in the quota conditions must already exist when you perform the quota check.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Enter the questionnaire before starting with the actual creation of the quotas. Participants should also already exist or, in the case of a panel survey, the sample should already be drawn.</p>\n</li>\n<li>\n<p>Define the quotas in the <strong>Survey menu</strong> → <strong>Questionnaire editor</strong> → <strong>Quotas</strong> menu.</p>\n</li>\n<li>\n<p>Specify the sequence of the quota process on the<strong> Configuration</strong> tab.</p>\n</li>\n<li>\n<p>If you make use of the possibility of excluding participants from the survey due to external quotas, it may be the case that respondents cannot open the questionnaire in the first place. In the Project properties-&gt;Survey messages menu, adapt the text of the message these respondents will receive when trying to log in.</p>\n</li>\n<li>\n<p>If you have defined internal quotas (i.e. quotas whose conditions contain variables that are determined only in the course of the survey), you have to specify after which questionnaire page the checking for these quotas is to be performed. To do so, select an appropriate page in the <strong>Questionnaire editor</strong>, open its <strong>Properties</strong> menu, and select the option “Check internal quotas”.</p>\n</li>\n<li>\n<p>Set up the questionnaire so as to appropriately screen out any respondents no longer required. This is commonly achieved with a filter that redirects<br>respondents with “quota” = “0” (i.e. respondents that have not been allocated to any open quota) to an intermediate final page.</p>\n</li>\n</ul>\n<h3 id=\"the-quota-schedule\" class=\"wysiwyg-text-align-justify\">The quota schedule</h3>\n<p class=\"wysiwyg-text-align-justify\">The quota schedule is fundamental to defining quotas. In this schedule, you list in detail which characteristics are to be displayed by how many participants. To create such a schedule, you enter the relevant characteristics into a matrix. Then you specify the target values for the individual cells. There are two options, that produce different results:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><em>interlocking</em>: The quotas are defined using the inner cells. Thus, the feature combinations for the total of 100 participants admitted in the example shown below will be specified in detail: 25 young men, 25 old men, etc.</p>\n</li>\n<li>\n<p><em>non-interlocking</em>: The quotas are defined using the margin values, without regard to the distribution in the inner cells. In the example shown below, this means: a total of 100 participants will be admitted, among them, firstly, 50 men and 50 women and, secondly, 50 young people and 50 old people. The internal distribution of the quota is not defined, i.e. there may be, for example, 40 young men and 10 old men, 10 young women and 40 old women participating.</p>\n</li>\n</ul>\n<h3 id=\"internal-and-external-quotas\" class=\"wysiwyg-text-align-justify\">Internal and external quotas</h3>\n<p class=\"wysiwyg-text-align-justify\">Two types of quotas are processed at different times and therefore configured in different ways to some extent:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Internal quotas: These quotas contain variables whose value is determined only in the course of the survey.</p>\n</li>\n<li>\n<p>External quotas: These quotes refer solely to variables originating from external sources and existing beforehand, i.e. variables that are not determined in the course of the survey. External quotas are used only in surveys with a predefined pool of participants.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If a quota condition contains both survey variables and external variables, it will be treated as an internal quota, i.e. it will not be automatically executed before login.</p>\n<p class=\"wysiwyg-text-align-justify\">A quota that accesses URL parameters is internal.</p>\n<h3 id=\"quota-timetable\" class=\"wysiwyg-text-align-justify\">Quota timetable</h3>\n<p class=\"wysiwyg-text-align-justify\">Depending on what kind of quota there are in a project and which process has been configured, events can be triggered at different stages in the course of the survey.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Optionally, the participants can be checked for external quotas already before the start of the survey. To do so, select the <strong>Configuration</strong> tab. The checking procedure is as follows:</p>\n<ul>\n<li>\n<p>Every time a participant has completed the questionnaire and the allocation figures in the quota statistics are changed accordingly, all those participants that have not yet started the survey (disposition code &lt; 20) will be checked for external quotas.</p>\n</li>\n<li>\n<p>Of these participants, the system will exclude those that fall within a full external quota from participating, i.e. they are assigned disposition code 41<br>(“quota closed”) in the participant administration. Any data accumulated by the participant (during the respective survey) will be deleted in this process and will not be considered in the survey. If these participants try to log in, they will be rejected and assigned disposition code 35 (“rejected at login (quota closed)”. The quota variables of the excluded participants are allocated as follows: quota = -77, quota_assignment = -66.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If the check for external quotas is not performed beforehand as described above, it will be carried out at the start of the survey.</p>\n</li>\n<li>\n<p>The check for internal quotas is triggered by sending a questionnaire page predefined by you.</p>\n</li>\n<li>\n<p>The allocation figures in the quota statistics will be changed according to the check results mentioned above when the participant completes the questionnaire (i.e. when reaching the final page or an intermediate final page and receiving disposition code 31 or 32).</p>\n<ul>\n<li>\n<p>If the participant has been allocated to an open quota i.e. if the quota is greater than 0, the quota count for the respective quota will be increased by 1.<br>Depending on the configuration, the quota count for all other open quotas whose conditions the respondent has met might be increased by 1, too.</p>\n</li>\n<li>\n<p>When the target size of a quota has been reached, the quota is closed. If this is an external quota and you have chosen the option of excluding participants already prior to their login (see 1. above), then all respondents with disposition code &lt; 20 falling within this quota will be set to status 41 (quota closed).</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For external quotas, the quota check is performed already at the start of the survey; for internal quotas, in the course of the survey. The allocation figures<br>(quota count), however, will not be changed before completion of the survey. If the questionnaire is very long and/or many participants start taking the survey at the same time, it may therefore be the case that slightly more participants will pass the quota check and complete the questionnaire than planned.</p>\n<h3 id=\"the-most-important-quota-processes\" class=\"wysiwyg-text-align-justify\">The most important quota processes</h3>\n<p class=\"wysiwyg-text-align-justify\"><em>The survey</em> offers a great degree of freedom in designing the quota process.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The following table presents the most frequently desired scenarios.</p>\n</li>\n<li>\n<p>The “Configuration” column lists the combination of options and allocation mode that allows you to realize the respective scenario.</p>\n</li>\n</ul>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 190.0px;\"> <col style=\"width: 318.0px;\"> <col style=\"width: 252.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Quota type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Rule</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Configuration</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>non-interlocking</p>\n</td>\n<td>\n<p>If at least one already filled quota applies to the participant, he will be screened out by quota.</p>\n<p>Otherwise, the participant will be allocated to all matching, open quotas.</p>\n</td>\n<td>\n<p>Options 1, 2, 3</p>\n<p>Allocation mode: First matching open quota</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>interlocking</p>\n</td>\n<td>\n<p>If at least one open quota applies to the participant, he can participate and will be allocated to all matching quotas.</p>\n</td>\n<td>\n<p>Option 3</p>\n<p>Allocation mode: First matching, open quota</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Prioritized quotas - standard</p>\n</td>\n<td>\n<p>If at least one already filled quota applies to the participant, he will be screened out by quota.</p>\n<p>Otherwise, the quota conditions will be processed in the predefined order and the participant will be allocated to the first matching, open quota.</p>\n</td>\n<td>\n<p>Options 1, 2,</p>\n<p>Allocation mode: First matching, open quota</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Prioritized quotas - extended</p>\n</td>\n<td>\n<p>If at least one open quota applies to the participant, he can participate. The quota conditions will be processed in the predefined order and the participant will be allocated to the first matching, open quota.</p>\n</td>\n<td>\n<p>All options disabled</p>\n<p>Allocation mode: First matching, open quota</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Low Bucket Fill (Fill up the quotas with the lowest allocation figure first)</p>\n</td>\n<td>\n<p>Difference from the prioritized extended quotas: The prioritization is dynamic.</p>\n<p>If at least one open quota applies to the participant, he can participate. The quota conditions will be processed in the predefined order and the participant will be allocated to the quota with the fewest participants.</p>\n</td>\n<td>\n<p>All options disabled</p>\n<p>Allocation mode: Matching, open quota with the fewest participants</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 class=\"wysiwyg-text-align-justify\"> </h2>\n<h2 id=\"questionnaire-checking-internal-quotas\" class=\"wysiwyg-text-align-justify\">Questionnaire: checking internal quotas</h2>\n<p class=\"wysiwyg-text-align-justify\">Whether the participants fulfill internal quotas can only be checked when there are values for all required variables, i.e. in the course of the survey. For reasons of performance, this check will not be done automatically after each questionnaire page, but only after a page that you have tagged accordingly. The Figure below shows a sample questionnaire. On the page marked with a Q icon, the internal quota are checked.</p>\n<h3 id=\"selecting-the-appropriate-questionnaire-page-s\" class=\"wysiwyg-text-align-justify\">Selecting the appropriate questionnaire page(s)</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>At the time that the check is to be performed, there must be values for all required variables. As the check is triggered when the page is sent, you can, for example, select the page that contains the last question needed for the quota.</p>\n</li>\n<li>\n<p>You should select a page that all participants will have to view, i.e. it should not be located in a filter-branch, for example.</p>\n</li>\n</ul>\n<h3 id=\"tagging-the-appropriate-questionnaire-page-s\" class=\"wysiwyg-text-align-justify\">Tagging the appropriate questionnaire page(s)</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the questionnaire editor, locate the page following the processing of which the quotas are to be analysed, and open its list view.</p>\n</li>\n<li>\n<p>Open the <strong>Properties</strong> menu.</p>\n</li>\n<li>\n<p>Select the option “Check internal quotas”.</p>\n</li>\n<li>\n<p>Click on <strong>Save</strong>. The page will now be marked with a <strong>Q</strong> icon in the questionnaire view.</p>\n</li>\n</ul>\n<h3 id=\"screening-out-unsuitable-respondents-by-quota\" class=\"wysiwyg-text-align-justify\">Screening out unsuitable respondents by quota</h3>\n<p class=\"wysiwyg-text-align-justify\">Respondents that are identified as unsuitable due to the quota must be screened out. They are usually redirected to an intermediate final page using a filter:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>On this intermediate final page, the survey supervisor will thank the respondents for their willingness to participate.</p>\n</li>\n<li>\n<p>Upon reaching the intermediate final page, the participants can optionally be assigned a special disposition code (36, 37) by which they can be recognized in the subsequent analysis.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can see this typical routing structure in the sample questionnaire shown in figure.</p>\n<h3 id=\"selecting-a-suitable-point-in-the-questionnaire\" class=\"wysiwyg-text-align-justify\">Selecting a suitable point in the questionnaire</h3>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The screening out should not be performed until all quotas have been checked.</p>\n</li>\n<li>\n<p>You should select a point in the questionnaire which all participants will have to pass, i.e. it should not be located in a filter branch, for example.</p>\n</li>\n</ul>\n<h3 id=\"setting-up-filter-and-a-final-page\" class=\"wysiwyg-text-align-justify\">Setting up the filter and a final page</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the questionnaire editor, locate the page following the processing of which the unsuitable respondents are to be screened out.</p>\n</li>\n<li>\n<p>Create a filter. In most cases, the filter condition will be “quota = 0”, i.e. the system will screen out all those respondents who have not been allocated to an open quota. If you want to screen out respondents that have been allocated to the quota with the ID 1, you will select “quota = 1” instead.</p>\n</li>\n<li>\n<p>Create a final page under the filter and open its list view.</p>\n</li>\n<li>\n<p>Click on the <strong>Properties</strong> menu.</p>\n</li>\n<li>\n<p>In the field “Disposition code”, select the disposition code that the participants are to be assigned upon reaching this intermediate final page. A range of disposition codes (31-40) is available.</p>\n<img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21013838018194\" alt=\"Screenshot 2023-03-20 at 08.31.15.png\">\n</li>\n<li>\n<p>Confirm by clicking on <strong>Change</strong>.</p>\n</li>\n</ul>\n<h2 id=\"routing-and-evaluation\" class=\"wysiwyg-text-align-justify\">Routing and evaluation</h2>\n<h3 id=\"two-variables-quota-and-quota_assigment\" class=\"wysiwyg-text-align-justify\">Two Variables <em>quota</em> and <em>quota_assigment</em>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">The quota results will be recorded in two variables:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>quota: This variable contains the ID of the allocated quota (i.e. the quota selected via allocation mode). It is used to screen out unsuitable participants.</p>\n</li>\n<li>\n<p>quota_assignment: This variable contains the IDs of all quotas in which the respective participant has been counted. It may help with the evaluation if you have activated option 3, for example, and thus allocated participants to all matching open quotas. In this case, “quota” will contain only the quota selected via allocation mode. “quota_assignment” will contain all the quotas to which the participant has been allocated, i.e. it allows you to understand exactly how the allocation figures are generated. Please bear in mind that “quota_assignment” cannot be used for filtering and other routing processes.</p>\n</li>\n</ul>\n<h3 id=\"disposition-codes-of-screened-out-participants\" class=\"wysiwyg-text-align-justify\">Disposition codes of screened-out participants</h3>\n<p class=\"wysiwyg-text-align-justify\">At which point in the quota process a participant has been excluded from participation will be recorded i.a. in the field report, in the participant administration, and in the export data record via the following disposition code.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 228.0px;\"> <col style=\"width: 532.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Disposition codes</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Rejected at login (quota closed) (code 35</p>\n</td>\n<td>\n<p>Is set for respondents in personalized projects who want to use the link from the invitation mail to log into the survey after a quota has been closed.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Rejected (quota closed) (code 36)</p>\n</td>\n<td>\n<p>Statuses 36 and 37 are set in a project with quotas when an intermediate final page has been reached. The survey administrator can use these codes to mark respondents as rejected (i.e. screened out by quota; there are already enough participants with the respective features) or screened out (= unsuitable). The status to be set is manually specified by the administrator at the intermediate final page.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Screened out (code 37)</p>\n</td>\n<td>\n<p>Statuses 36 and 37 are set in a project with quotas when an intermediate final page has been reached. The survey administrator can use these codes to mark respondents as rejected (i.e. screened out by quota; there are already enough participants with the respective features) or screened out (= unsuitable). The status to be set is manually specified by the administrator at the intermediate final page.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Filtered out before the beginning of the survey, because quota is already closed (code 41)</p>\n</td>\n<td>\n<p>If a quota is full, this status will be assigned to all participants, who match the quota condition, but have not started with the survey yet.</p>\n<p>If one of these participants tries to log in, then he will be rejected and the disposition code will be set to 35.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"reactivating-participants-when-increasing-size-of-an-external-quota\" class=\"wysiwyg-text-align-justify\">Reactivating participants when increasing the size of an external quota</h3>\n<p class=\"wysiwyg-text-align-justify\">Under certain circumstances, it may be necessary to subsequently increase the quota size during the field phase. In projects with a preset pool of participants (personalized survey, panel and master data surveys), this is problematic if external quota is used, the option to reject participantts on survey start is activated and one of the external quotas has already been closed. That is because, in this case, all respondents who have not yet participated but fall under the quota that has already been closed are automatically set to the “Quota closed” status.</p>\n<p class=\"wysiwyg-text-align-justify\">In projects that use external quotas exclusively, it is possible to reactivate the respondents in such a case, thus allowing them to participate. To do so, increase the quota size, change the status to “active”, and confirm by clicking on<strong> Change</strong>. After that, you can choose for which of the changed quotas the participants are to be reactivated. After you have confirmed by clicking on <strong>Submit</strong>, the participant’s status is changed to “active”.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">How many quotas can I have in a project?</h3>\n<p class=\"wysiwyg-text-align-justify\">It is recommended to use not more than 300 quotas per project to maintain optimal performance.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I reactivate participants if I increase the size of an external quota?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, in projects that use external quotas exclusively, you can reactivate participants by increasing the quota size, changing the status to \"active,\" and following the prompts to reactivate participants for the changed quotas.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">How do I handle quota statistics in large projects?</h3>\n<p class=\"wysiwyg-text-align-justify\">For projects with 200 or more quotas, you need to open the \"Quota statistics\" section in the Field report explicitly to prevent delays caused by long processing times.</p>",
    "user_segment_ids": []
}