{
    "id": 20371031237650,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371031237650.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371031237650-How-to-Tasks-with-Task-List-Portals",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234774909202,
    "created_at": "2024-07-25T16:43:13Z",
    "updated_at": "2024-08-28T10:01:56Z",
    "name": "How-to: Tasks with Task List (Portals)",
    "title": "How-to: Tasks with Task List (Portals)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T13:11:43Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide on how to use the Task List module in Portals. It covers the configuration, setup, and usage of Task List for managing tasks within an organization.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The Task List module in Portals allows users to create, view, and edit tasks without switching to the Org Processor's Action Planner. This guide explains how to set up and use Task List effectively.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#configuring-task-list\">Configuring Task List</a></li>\n<li><a href=\"#working-with-task-list-in-the-exterior-view-of-portals\">Working with Task List in the exterior view of Portals</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Requirements for the use of </strong><em><strong>Task List</strong></em></p>\n<p class=\"wysiwyg-text-align-justify\">The following requirements must be met in order to use<em> Task List</em> for <em>Portals</em>:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Only ES type projects qualify for the use of a <em>Task List</em>.</p>\n</li>\n<li>\n<p>Users creating, viewing, or editing tasks in the <em>Task List</em> must be allocated to the respective unit in the Org Processor first and must be assigned the correct role (e. g. owner).</p>\n</li>\n<li>\n<p>Users working with <em>Task List</em> must have a panelist account based on the same e-mail address used in <em>Portals</em>.</p>\n</li>\n<li>\n<p>The <em>Action Planner</em> must be activated first to use<em> the Task List</em> in <em>Portals</em>.</p>\n</li>\n<li>\n<p>To use the page-module <em>Task List</em>, it must be added to a portal and configured first.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adding </strong><em><strong>Task List</strong></em><strong> to a portal</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To add a <em>Task List</em> to a portal, proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the portal to which you want to add the <em>Task List</em>.</p>\n</li>\n<li>\n<p>Select a page on which you want to add the module.</p>\n</li>\n<li>\n<p>Click on the button <strong>New row</strong> and select a layout from the default selection to define the number of columns of the new row.</p>\n</li>\n<li>\n<p>Click on the button <strong>New module</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">A list with all available page modules is opened.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the page module<em> Task List</em>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have added the page module<em> Task List</em> to your portal.</p>\n<h2 id=\"configuring-task-list\" class=\"wysiwyg-text-align-justify\">\n<strong>Configuring </strong><em><strong>Task List</strong></em>\n</h2>\n<p class=\"wysiwyg-text-align-justify\">To open the admin area of Task List, click on the arrowhead. The settings of the Task List are displayed. To configure the Task List, proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select a<strong> Heading</strong> for the page module.</p>\n</li>\n<li>\n<p>Select the <strong>Employee target project</strong> containing the tasks to be shown in the list display.</p>\n</li>\n<li>\n<p>Using the checkbox “Users can create new tasks”, you can control if users can create new tasks or not. To do so, check or uncheck the box.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To create new tasks, responsible persons need to have at least the rights of the standard Owner role.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Define the <strong>number of tasks</strong> to be displayed on one page.</p>\n</li>\n<li>\n<p>Define how many days before the expiration of a task a reminder will be sent out for a <strong>warning</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The expiration warning is set to one day by default.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Optionally, you can add additional fields to tasks. For this purpose, click on the button + <strong>Select field</strong> below <strong>Field‘s order</strong>, select additional fields from the dropdown list, and confirm each selection by clicking the green check. You can adapt the order of displayed fields with the arrows on the right. With the trash icon, you can delete added fields again.</p>\n</li>\n<li>\n<p>Confirm your information by clicking on the button <strong>Publish</strong>.</p>\n</li>\n<li>\n<p>Activate the online button to publish your <em>Task List</em> page.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The configuration of the <em>Task List</em> is completed. In case you want to delete the page module <em>Task List</em> again, click on the trash icon and in the confirmation dialog on the button <strong>Delete</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Notes:</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Fields added via the Task List configuration area will be shown in the list display of tasks.</p>\n</li>\n<li>\n<p>These selectable fields are displayed through the variables in the variable editor of the Action Planner configuration. Here, you can create and add any variables to the standard variables.</p>\n</li>\n<li>\n<p>To hide self-created variables in the configuration and exterior view of the Task List, set the setting “Show the content of this variable” to “no”.</p>\n</li>\n<li>\n<p>The adaptable order of variables in the variable editor determines the order of variables displayed in the detail view and the editing mode of tasks in the exterior view of <em>Portals.</em></p>\n</li>\n</ul>\n<h3 id=\"allocating-rights\" class=\"wysiwyg-text-align-justify\"><strong>Allocating rights</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the comment area in the detail view of tasks, responsible persons can leave notes, images, and videos while editing tasks. To enable responsible persons to create, edit, or delete comments, they need the respective rights beforehand.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To allocate comment rights, navigate via the following path to the Rights administration of the role you want to allocate rights:</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">[Selected project] → <strong>Process configuration</strong> → tab <strong>Roles</strong> →<strong> Paragraph icon of the respective role</strong> → <strong>Rights administration</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To allocate the right of creating comments to tasks and editing and deleting own comments:</p>\n<ul>\n<li>\n<p>check the box in the row “actionplanner_comment_create” of the section <strong>Follow Up - Action Planner</strong>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>To allocate the right to edit or delete any comment to tasks:</p>\n<ul>\n<li>\n<p>check the box in the row “actionplanner_comment_moderate” of the section <strong>Follow Up - Action Planner</strong>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Confirm with<strong> Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have allocated the comment rights to responsible persons in their respective roles.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Allocating access right to survey results</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If a task was created by the <em>Task Trigger</em>, a survey link is created in the detail view of this task routing to the results of the respective survey participation. The responsible user of this task has the possibility to open the survey link by clicking on the form icon in the detail view and to access the survey results of the participants. The form icon is not displayed in the detail view by default. To activate the icon and to make it visible for responsible persons, they need the right of accessing survey results beforehand.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To allocate the right, navigate via the following path to the Rights administration of the role you want to allocate rights to:</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">[Selected project] →<strong> Process configuration</strong> → tab <strong>Roles</strong> → <strong>Paragraph icon of the respective role</strong> → <strong>Rights administration</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Check the box in the row “actionplanner_view_survey_result” of section <strong>Follow Up - Action Planner</strong>.</p>\n</li>\n<li>\n<p>Confirm with <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have allocated the right of accessing survey results to responsible persons in their respective role.</p>\n<h3 id=\"activating-deactivating-notifications\" class=\"wysiwyg-text-align-justify\"><strong>Activating/Deactivating Notifications</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the Panelist administration, you can set whether participants, being panelists at the same time, receive a push notification on their smartphone as well as on their installation and/or an e-mail notification informing them about new assignments of tasks. The activation of push notifications requires the installation of the <em>Portals</em> app on the participants‘ smartphones.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To activate or deactivate notifications for a participant, open the<strong> Panelists administration</strong> in the<em> People</em> module.</p>\n</li>\n<li>\n<p>Enter the respective participant in the search field and click<strong> Search</strong>.</p>\n</li>\n<li>\n<p>Select the participant by clicking on their name.</p>\n</li>\n<li>\n<p>The tab<strong> Detail view</strong> of the participant‘s account is opened.</p>\n</li>\n<li>\n<p>In the section <strong>Notifications</strong>, you can activate or deactivate the<strong> Push notifications for tasks</strong> and / or the<strong> E-mail notifications for tasks</strong> via the respective checkboxes.</p>\n</li>\n<li>\n<p>To save your changes, click on the button <strong>Change account</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have changed the settings of Notifications for the selected participant.</p>\n<p class=\"wysiwyg-text-align-justify\">To display a list of all created participants / panelists from which you can select the desired participant, enter “@” in the search field and click <strong>Search</strong>.</p>\n<h2 id=\"working-with-task-list-in-the-exterior-view-of-portals\" class=\"wysiwyg-text-align-justify\">\n<strong>Working with</strong><em><strong> Task List</strong></em><strong> in the exterior view of </strong><em><strong>Portals</strong></em>\n</h2>\n<p class=\"wysiwyg-text-align-justify\">In the exterior view of Portals, responsible persons work on their tasks in the context of the follow-up process. You have received an e-mail (or some other message) which names you as the person responsible for administrating the follow-up process of the employee survey in your organizational unit. The e-mail usually contains your access data to the exterior view of <em>Portals</em>:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>E-mail address</p>\n</li>\n<li>\n<p>Password</p>\n</li>\n<li>\n<p>URL for the login of the Portals exterior view</p>\n</li>\n</ul>\n<h3 id=\"login-to-portals-exterior-view\" class=\"wysiwyg-text-align-justify\">\n<strong>Login to </strong><em><strong>Portals</strong></em><strong> exterior view</strong>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">Click on the link in the e-mail to open the login to the exterior view of<em> Portals</em>. If this link is not working, mark it, copy it and paste it into the address field of your web browser. By clicking on <strong>Enter</strong>, you will reach the login window. Please enter your e-mail address and password into the text fields and click on the <strong>Sign In</strong> button. When logging in for the first time, this will prompt a security routine in the course of which you change your password and specify a security question. Later, you will be taken directly to the Portals exterior view. The password will have to be changed once every month. The Portals exterior view is opened.</p>\n<h3 id=\"task-list-in-the-portals-exterior-view\" class=\"wysiwyg-text-align-justify\">\n<em><strong>Task List</strong></em><strong> in the </strong><em><strong>Portals</strong></em><strong> exterior view</strong>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">After the login, you automatically enter the Portals exterior view.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039491474\" alt=\"image2019-5-15_16-30-40.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">On the main page of the Portals exterior view, you see, if applicable, a list with created tasks which are assigned to your organizational unit. From here, you can create new tasks as well as access, edit, copy and delete tasks. Also, you can filter, sort and search tasks.</p>\n<p class=\"wysiwyg-text-align-justify\">Depending on the setting of your installation, the exterior view is opened with another page in <em>Task List</em>.</p>\n<h3 id=\"filtering-area\" class=\"wysiwyg-text-align-justify\"><strong>Filtering area</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To open the filtering area, click on the <strong>Filter</strong> button with the funnel icon. Here, you can filter created tasks by Status, Creator, Unit and Subject group. Only tasks with the status Not started and Started are listed by default. You can adjust this setting via the checkboxes in the Status section. The number next to the Filter button with the funnel icon indicates the number of filters currently being active. Via activation of the <strong>Filter buttons</strong> “Show only my own tasks” and “Show escalated tasks”, you can restrict the display of tasks in the list display to your own current tasks or to escalated tasks of your own organizational unit. Via the drop-down list, you can sort tasks by Title, Completion date, Status and Created date.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the search field, you can search and display tasks by entering respective characters and numbers which are included in the task variables Title, Responsible person, Creator, ID, Problem description and Task description.</p>\n<h3 id=\"creating-a-new-task-in-task-list\" class=\"wysiwyg-text-align-justify\">\n<strong>Creating a new task in </strong><em><strong>Task List</strong></em>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">To create a new task in <em>Task List</em>, click on the button <strong>Create task</strong>. The entry mask for creating a new task is opened.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039486866\" alt=\"image2019-5-15_16-40-56.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select Title, Status, Completion date with time, Unit, Responsible person of the task as well as the Subject group and enter a Problem description and a Task description into the text fields.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Notes:</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select a unit first to load a list of responsible persons for that unit.</p>\n</li>\n<li>\n<p>If more than ten units or responsible persons are visible, the select box becomes a filtering list.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Saving is not available until all required fields are filled.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the button<strong> Submit</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Your newly created task has been added to the list display - from here you can access and edit tasks.</p>\n<h3 id=\"list-display\" class=\"wysiwyg-text-align-justify\"><strong>List display</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The list display provides you with an overview of created tasks. Depending on your filter settings, maybe only tasks with the status Not started and Started (standard setting) or only tasks created by a certain person are displayed for example. In the list display, depending on each configuration, the following items of a task can be displayed: ID (with a preceding hash sign), title, responsible person, their organizational unit, subject group, status, the remaining time until expiration of the task, the number of existing comments on the task and tags (if created). Via the menu on the right side, you can edit, copy and delete tasks.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Status display and reminder function</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><u>Status display</u></p>\n<p class=\"wysiwyg-text-align-justify\">The color of the status bar corresponds to the current status of a task:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Green: Editing of the task has Not started.</p>\n</li>\n<li>\n<p>Orange: Editing of the task has Started.</p>\n</li>\n<li>\n<p>Red: Editing of the task is Completed.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">When editing tasks via workflows, the status Not started is automatically set to Started.</p>\n<p class=\"wysiwyg-text-align-justify\"><u>Reminder function</u></p>\n<p class=\"wysiwyg-text-align-justify\">The color of the time display serves as reminder function and is independent of the status display. The reminder function runs synchronously to the reminder mail, warning about an upcoming expiration of a task.</p>\n<p class=\"wysiwyg-text-align-justify\">By default, the color of the time display of tasks turns from black to orange as soon as a task is one day away from expiration. In the configuration area, you can define the number of days the reminder function is executed before expiration. Here, you can adjust the default setting of one day.</p>\n<p class=\"wysiwyg-text-align-justify\">There are three different colors displaying the time status of tasks:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Black: The task is at least one day away from expiration warning. By default, the warning is executed one day before expiration of the task. In this case, the task is marked in black up to two days before expiration.</p>\n</li>\n<li>\n<p>Orange: The task is one day away from expiration with default setting or at the most as many days as is set for the expiration warning.</p>\n</li>\n<li>\n<p>Red: The task is expired and lies in the past.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The setting of the expiration warning runs by days (not time). Tasks expire at 11.59 pm at night (UTC). Expired tasks are automatically escalated one level up.</p>\n<h3 id=\"editing-the-properties-of-a-task\" class=\"wysiwyg-text-align-justify\"><strong>Editing the properties of a task</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In editing mode, you can edit the properties of a task.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To switch to editing mode of a task, hover over the menu icon on the right side of a task in the list display.</p>\n</li>\n<li>\n<p>Click on <strong>Edit</strong> in the displayed context menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039483794\" alt=\"image2019-5-15_16-51-36.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">The edit view of the task is opened.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069517586\" alt=\"image2019-5-15_16-52-29.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the edit view of a task, you can edit title, status, completion date with time, unit, responsible person, subject group, problem description, task description and add tags as needed.</p>\n</li>\n<li>\n<p>Confirm your changes with <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The changed properties of your task are shown in the list display.</p>\n<p class=\"wysiwyg-text-align-justify\">You can only edit tasks assigned to your own unit. With tags, you can add categorization to tasks for example. Tags currently cannot be exported or used in <em>MySight</em>.</p>\n<h3 id=\"working-in-detail-view\" class=\"wysiwyg-text-align-justify\"><strong>Working in detail view</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To open the detail view of a task, click on a random position on the respective task in the list display.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069514514\" alt=\"image2019-5-15_16-55-35.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">In detail view, all configured properties of tasks are displayed. In the upper area of the detail view, you find the <strong>workflow buttons</strong>, in the bottom area, you have access to the <strong>history log</strong> and <strong>comment field</strong>, showing a small extract of current comments for a quick overview. Also in the upper area, you find the ID of the task with <strong>URL copy function</strong> and a button for switching into edit view. In case you have the required rights, another button is visible for accessing<strong> survey results</strong> of participations.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Workflow buttons</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The workflow buttons are an important feature when editing tasks. Depending on the status of a task, you can perform different workflow actions without having to switch to edit mode. Depending on the status, you can assign tasks to yourself or to another person, escalate, close or reopen tasks as well as invite participants to follow-up surveys. Workflows automatically move status from Not started to Started when triggered.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Assigning tasks to yourself</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this workflow, you can assign tasks to yourself as the current user. To assign a task to yourself, click on the workflow button <strong>Assign to me</strong>. The task is automatically assigned to yourself.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Assigning tasks to users</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this workflow, you can assign tasks to users of your own unit only or to users of your own unit and all levels down. However, this doesn’t mean, that you can assign a task to all persons of subordinate levels at the same time. You can merely choose one person of all subordinate levels. If you want to rapidly assign several persons, you have the option of copying a task. More information on this topic can be found <a href=\"https://qbdocs.atlassian.net/wiki/spaces/DOC/pages/925138951/How-to+Action+Planner+and+CLF#%5BhardBreak%5DCopying-actions\">here</a>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To assign a task to another person, click on the workflow button <strong>Assign to</strong>. An entry mask is opened.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069508754\" alt=\"image2019-5-15_17-0-18.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the drop-down list, select the Responsible person you want to assign your task to.</p>\n</li>\n<li>\n<p>Optionally, you can leave a comment in the comment field.</p>\n</li>\n<li>\n<p>Click on the button <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have assigned the task to another person who will be notified accordingly by e-mail.</p>\n<p class=\"wysiwyg-text-align-justify\">Depending on each configuration, the list either contains persons of your own unit only or persons of your own unit and all levels down.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Escalating tasks to users</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this workflow, you can escalate tasks to persons of the next level up. Escalated tasks are not editable for you any more. However, they are still viewable with the filter setting “Show escalated tasks” in the list display. With the comments function in detail view, you can also comment on escalated tasks, as long as you have the equivalent comment right.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To escalate a task to a person of the next level up, click on the workflow button <strong>Escalate to</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">An entry mask is opened.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069505554\" alt=\"image2019-5-15_17-3-36.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the drop-down list, select the<strong> Responsible person</strong> of the next level up you want to escalate your task to.</p>\n</li>\n<li>\n<p>Optionally, you can leave a comment in the comment field.</p>\n</li>\n<li>\n<p>Click on the button <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have escalated the task to a person of the next level up who will be notified accordingly by e-mail.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Inviting participants to follow-up surveys</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this workflow, you can invite participants to follow-up surveys. This workflow is usable as an individual workflow or in combination with the workflow “Close”.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To invite a participant to a follow-up survey, click on the workflow button <strong>Invite to follow-up survey</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">An entry mask is opened.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069504146\" alt=\"image2019-5-15_17-6-6.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Optionally, you can leave a comment in the comment field.</p>\n</li>\n<li>\n<p>Click on the button <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have invited the participant of this task to a follow-up survey. The participant will be notified accordingly by e-mail.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Closing tasks</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this workflow, you can close tasks you are responsible for.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To close a task, click on the workflow button <strong>Close</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">An entry mask is opened.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069502354\" alt=\"image2019-5-15_17-8-34.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Optionally, you can leave a comment in the comment field.</p>\n</li>\n<li>\n<p>Depending on each configuration, you additionally have the possibility to decide whether you send an invitation to a follow-up survey or not upon closing of the task, via radio button “Invite to follow-up survey?”.</p>\n</li>\n<li>\n<p>Click on the button <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have closed the task. Depending on each configuration, you have automatically sent out an invitation to a follow-up survey in addition to closing of the task, or through activation or deactivation of the respective radio button, you have decided yourself, if you have sent out an invitation to a follow-up survey or not.</p>\n<p class=\"wysiwyg-text-align-justify\">Closed tasks are not visible in the list display by default. To display closed tasks in the list display, activate the status Completed in the filtering area.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069500434\" alt=\"image2019-5-15_17-11-42.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Reopening tasks</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this workflow, you can reopen closed tasks.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To reopen a closed task, click on the workflow button <strong>Reopen</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">An entry mask is opened.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069497746\" alt=\"image2019-5-15_17-13-16.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the drop-down list, select the <strong>Responsible person</strong> who will be editing this task.</p>\n</li>\n<li>\n<p>Optionally, you can leave a comment in the comment field.</p>\n</li>\n<li>\n<p>Click on the button <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have reopened the task for the person responsible for editing who will be notified accordingly by e-mail.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Comments</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Underneath the comment area, you can leave notes, images and videos with regard to tasks.</p>\n<p class=\"wysiwyg-text-align-justify\">To create a comment, proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the tab <strong>Comments</strong> in the bottom area of the detail view, if not active yet.</p>\n</li>\n<li>\n<p>Click on the button <strong>Write a comment</strong>.</p>\n<ul>\n<li>\n<p>For entering text: enter your text into the text field and proceed with step 4. Alternatively, click on the <strong>plus</strong> and proceed with step 3.</p>\n</li>\n<li>\n<p>For the choice of image and/or video: click on the plus icon and proceed with step 3.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Select the desired option from the table:</p>\n</li>\n</ul>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 308.0px;\"> <col style=\"width: 229.0px;\"> <col style=\"width: 223.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Comment as text</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Comment as image</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Comment as video</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Click on the<strong> pen</strong> icon.</p>\n</td>\n<td>\n<p>Click on the <strong>camera</strong> icon.</p>\n</td>\n<td>\n<p>Click on the<strong> video camera</strong> icon.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Place your cursor within the text field and click.</p>\n</td>\n<td>\n<p>The window for the media selection is opened.</p>\n</td>\n<td>\n<p>The field “Paste video-link here“ is opened.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Enter your text into the text field.</p>\n</td>\n<td>\n<p>Upload your desired<br>image.</p>\n</td>\n<td>\n<p>Paste the URL to your desired video into the field.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\">Click on the button <strong>Post your comment</strong>. Your comment is created.</p>\n<p class=\"wysiwyg-text-align-justify\">To use the comments function, you need corresponding comment rights</p>\n<h3 id=\"history-log\" class=\"wysiwyg-text-align-justify\"><strong>History log</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Each task has a history log storing all modifications to this task chronologically. To view information in the history log, click on the tab <strong>History</strong> in the bottom area of the detail view, if not active yet.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>URL link</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By clicking the task ID and the button <strong>Copy url</strong>, you can create a URL link for your task, routing responsible persons directly to the detail view of this task.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Survey link</strong></p>\n<p class=\"wysiwyg-text-align-justify\">With this survey link, you can display the complete survey results of participants. To display the survey results, click on the form icon in the detail view. The corresponding survey is displayed in a new window in HTML print view.</p>\n<p class=\"wysiwyg-text-align-justify\">The survey link is only available if the respective task was created by the <em>Task Trigger</em>. To use the survey link, you need the access right to survey results. Without this right, the survey link is invisible to you.</p>\n<h3 id=\"notifications-of-tasks\" class=\"wysiwyg-text-align-justify\"><strong>Notifications of tasks</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">With the settings of Notifications, you can define whether you want to receive a push notification on your smartphone as well as on your installation and/or an e-mail notification upon assignment of new tasks. The push notification is deactivated by default. The receipt of push notifications requires the previous installation of the Portals app on your smartphone.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To activate or deactivate Notifications, click on your <strong>profile</strong> icon in the above menu bar on the right side.</p>\n</li>\n<li>\n<p>Select the option <strong>profile</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Your profile is opened.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To edit your profile data, click on the<strong> pen</strong> icon on the upper right.</p>\n</li>\n<li>\n<p>Click on the buttons <strong>Push notifications for tasks</strong> and <strong>E-mail notifications for tasks</strong> to activate or deactivate these functions.</p>\n</li>\n<li>\n<p>Confirm your changes with the<strong> check</strong> icon on the upper right to save the new setting.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You have changed the setting of Notifications.</p>\n<p class=\"wysiwyg-text-align-justify\">The settings of Notifications are true for each portal you have access to. The same settings for Notifications can be performed for you in the admin area.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq-1\">Can I assign tasks to users outside my unit?</h3>\n<p>No, you can only assign tasks to users within your own unit or to users in your unit and all levels down, depending on your configuration.</p>\n<h3 id=\"faq-2\">How do I escalate a task?</h3>\n<p>Use the \"Escalate to\" workflow button in the task's detail view to escalate a task to a person in the next level up.</p>\n<h3 id=\"faq-3\">Can I reopen a closed task?</h3>\n<p>Yes, you can reopen a closed task using the \"Reopen\" workflow button in the task's detail view.</p>",
    "user_segment_ids": []
}