{
    "id": 20370630764946,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370630764946.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370630764946-Project-Information",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:16:25Z",
    "updated_at": "2024-08-28T10:03:34Z",
    "name": "Project Information",
    "title": "Project Information",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T10:54:19Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about project management in a survey platform, covering project statuses, information, distribution methods, and various project types. It also includes details on process progress tracking and the use of macros for automating repetitive tasks.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on the key aspects of managing survey projects, including project statuses, distribution methods, and specific features for different project types. It also covers advanced features such as process progress tracking and automation using mcros. </p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#project-statuses\">Project Statuses</a></li>\n<li><a href=\"#information\">Information</a></li>\n<li><a href=\"#distribution\">Distribution</a></li>\n<li><a href=\"#h_01J3QAJ514X2N3W6HQ7643WEK2\">Project Type</a></li>\n<li><a href=\"#process-progress\">Process progress</a></li>\n<li><a href=\"#macros\">Macros</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"project-statuses\" class=\"wysiwyg-text-align-justify\"><strong>Project Statuses</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The following table provides an overview of the project statuses and the arising to-dos. Changes of the project status are logged in the <strong>Documentation</strong> → <strong>Project change log</strong> menu.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015136712210\" alt=\"Statuses.jpg\"></p>\n<h3 id=\"survey-compiled\" class=\"wysiwyg-text-align-justify\"><strong>Survey compiled</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>After creating the project, the survey will be generated automatically.</p>\n</li>\n<li>\n<p>Usually the project will be reset manually before the field phase starts. This is necessary if real data records are created when testing an anonymous project or if real data records are created for a personalized project or if a personalized project involves real participant accounts rather than dedicated test accounts.</p>\n</li>\n<li>\n<p>If the project has the status <strong>Survey compiled</strong>, nobody can participate in the survey.</p>\n</li>\n</ul>\n<h3 id=\"active\" class=\"wysiwyg-text-align-justify\"><strong>Active</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The survey project has been activated i.e. it is “in the field“, the current date is between the set start and end date of the survey.</p>\n</li>\n<li>\n<p>If the project has the status <strong>Active</strong>, you can participate in the survey.</p>\n</li>\n</ul>\n<h3 id=\"no-further-participations\" class=\"wysiwyg-text-align-justify\"><strong>No further participations</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This status makes it possible to bring a “smooth” end to the field phase: Participants, who are working with a questionnaire, can complete the process of filling it out and new participants will be rejected with an appropriate message.</p>\n</li>\n<li>\n<p>The status can be triggered manually by clicking on the To do of the same name. This will happen automatically, when the activated participation counter reaches the preset quota of finished participants.</p>\n</li>\n<li>\n<p>The process of filling out a questionnaire in progress can be finished, whereas it is no longer possible to begin a new one.</p>\n</li>\n</ul>\n<h3 id=\"finished\" class=\"wysiwyg-text-align-justify\"><strong>Finished</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The project has been deactivated and then finished.</p>\n</li>\n<li>\n<p>Possible next steps will be archiving or exporting the project.</p>\n</li>\n<li>\n<p>If the project has the status Finished, participation is no longer possible.</p>\n</li>\n</ul>\n<h3 id=\"participation-counter\" class=\"wysiwyg-text-align-justify\"><strong>Participation counter</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The participation counter takes a survey out of the field, as soon as a preset number of successful participations has been reached.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Permitting only a Limited Number of Participations</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By default the participation counter is deactivated. Where a project with activated par- ticipation counter is copied or exported/imported, the counter is also deactivated in the new project.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>From the moment of activation, the participation counter counts backwards from the preset value to “0”.</p>\n</li>\n<li>\n<p>􏰀It will count all of the participants that have filled out the questionnaire fully. You also have the option of counting screened-out participants, respectively quoted out participants or testers.</p>\n</li>\n<li>\n<p>􏰀Once the participation counter has reached a value of “0”, the project will be automatically set to project status 51 “no further participations”. Newly arriving prospective participants will be denied access. In contrast, participants who are already active can fill out their questionnaire unhindered. (For this reason, depending on the circumstances, participant numbers may exceed the defined limit.)</p>\n</li>\n<li>\n<p>􏰀If the participation counter is active in a project, then both the setting and the number of participants still to be admitted will be displayed in the project informa- tion dialog.</p>\n</li>\n<li>\n<p>􏰀A protocol of the changes to the value of the participation counter will be documented in the project change log.</p>\n</li>\n<li>\n<p>The participation counter always counts from the current moment onward. It can be activated or deactivated during the field phase; a change to its value is also possible during the field phase.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>In accordance with which rules does the counting take place?</strong></p>\n<p class=\"wysiwyg-text-align-justify\">From the moment of activation the participation counter counts backwards from the preset value until “0”, and then triggers a status change from “active” to “no further participations”.</p>\n<p class=\"wysiwyg-text-align-justify\">When counting it will only take into account further participation that takes place from the time of activation onward or from the time of a change to the counter value onward. Participation that took place before activation or before a change to the counter value will not be taken into account. A change to the number of participants in personalized and panel projects, caused e.g. by adding, deleting or reseting, likewise has no effect on the participation counter.</p>\n<p class=\"wysiwyg-text-align-justify\">So that a survey will be classified and counted as “completed regularly”, the respective participant must reach the final page of the project, which means it will have disposition code 31 or 32. You also have the option of counting screened out and quoted out participants and testers. Participants, who were screened out or quoted out are identifiable through the disposition codes 36 and 37, which they were given for reaching a certain page with such a configuration.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>How does a respondent experience a participation limit?</strong></p>\n<p class=\"wysiwyg-text-align-justify\">As soon as the participation counter has changed the project status to “no further participations”, newly arriving prospective participants will be denied access with the message “No further participants can be admitted”.</p>\n<p class=\"wysiwyg-text-align-justify\">In contrast, participants who are already active can fill out their questionnaire unhindered. In most usage scenarios, a sudden closure of their sessions in the middle of the questionnaire would be counterproductive. For this reason, participant numbers may exceed the defined limit, especially if many respondents participate at the same time in large surveys.)</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Activating the participation counter</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Switch to the <strong>Project </strong>→ {<strong>Selected project</strong>} → <strong>Project information. </strong>Click on the slider symbol (<strong>Set target</strong>) next to the participation counter in the status box. Enter into the text field “Number of additional necessary survey participations” the number of participants required from this point in time. The participation counter counts backwards from this value. You also have the option of counting respondents with the tester status. To do this tick the corresponding checkbox. You have the option of counting quoted and screened out participants (disposition code 36 and 37). Complete the work process by clicking on <strong>Save</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing the rejection message</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The survey message that is displayed when the number of participants is too high can be found in the <strong>Project properties </strong>→<strong> Survey messages </strong>menu. The title of the message is “The survey is in status 'no further participations'”, a suitable message would be “No further participants allowed.”</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Informing respondents about the current state of the participation counter</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The current value of the participation counter can be inserted into project-related mails with the wildcard #participants_left#.</p>\n<h3 id=\"exporting-and-archiving\" class=\"wysiwyg-text-align-justify\"><strong>Exporting and archiving</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Export: Switch to the Export menu, in order to export the required data.</p>\n</li>\n<li>\n<p>Archive: The survey project is scheduled for archiving. Once a day, scheduled projects are archived during a low traffic period.</p>\n</li>\n</ul>\n<h2 id=\"information\" class=\"wysiwyg-text-align-justify\"><strong>Information</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Information</strong> section you will find the following information and editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The project type and author are displayed. Clicking on the <strong>Change</strong> link will open the entry form allowing you to change basic properties (e.g. project type and author).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015166744466\" alt=\"Information_EN.png\"></p>\n<h3 id=\"survey-languages\" class=\"wysiwyg-text-align-justify\"><strong>Survey languages</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">All survey languages used are listed. Via the link, you can navigate into <strong>Language editor</strong>.</p>\n<h3 id=\"access-rights\" class=\"wysiwyg-text-align-justify\"><strong>Access rights</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Which teams have access to your project: Via the <strong>Change rights</strong> link you open the dialog where you can assign teams access to the project.</p>\n<h3 id=\"accessible\" class=\"wysiwyg-text-align-justify\"><strong>Accessible</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">All standard question types are accessible. The respective page can be captured, structured and read by a screen reader software and can be controlled completely by keyboard (using tab and arrow keys). A mouse is not necessary.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Complex types of questions (hotspots, images) are not necessarily designed to be accessible, since they are dependent, for example, on further descriptions of the visible image by the survey creator.</p>\n</li>\n<li>\n<p>Responsive Layout 3 offers significant improvements in the area of accessibility.</p>\n</li>\n</ul>\n<h3 id=\"privacy-assistant\" class=\"wysiwyg-text-align-justify\"><strong>Privacy Assistant</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You activate the <em>Privacy Assistant</em> to conduct the surveys in accordance with the General Data Protection Regulation (GDPR) for new and existing projects. The <em>Assistant</em> is already activated by default.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015166755218\" alt=\"Modify project data.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"distribution\" class=\"wysiwyg-text-align-justify\"><strong>Distribution</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Distribution</strong> section contains the project type-specific features for publishing the survey.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015166741522\" alt=\"image-20231010-090734.png\"></p>\n<h3 id=\"url-with-icons-edit-questionnaire-preview-open-survey-in-new-window-and-participate-again\" class=\"wysiwyg-text-align-justify\">\n<strong>URL</strong> with icons: <strong>Edit</strong>, <strong>Questionnaire preview</strong>, <strong>Open survey in new window</strong> and <strong>Participate again</strong>\n</h3>\n<h4 id=\"icon-edit\" class=\"wysiwyg-text-align-justify\">Icon <strong>Edit</strong>\n</h4>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This icon is displayed in Personalized Projects, Anonymous Surveys, Employee Surveys and Multi-source Feedback.</p>\n</li>\n<li>\n<p>You can change the URL of a survey if, for example, you want to adapt the URL to the name of your company. You can also use this feature to shorten the survey’s URL, if you wish to invite respondents via e-mail using the “Code” login type and want to avoid the problem of 72-character wraps for URLs in e-mails. In this case, you can freely specify the part of the URL following the directory specification “/uc/”.</p>\n</li>\n<li>\n<p>An example of what the URL could look like: http://www.domain.com/uc/your_company</p>\n</li>\n<li>\n<p>The “Replace URL in questions?” option will browse all entered questions for absolute paths to the old URL. These references can have found their way into the survey, for example, through user-defined questions or the HTML container. If the “Replace URL in questions?” option has been activated, all old URL paths will be replaced with the new URL.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015166753298\" alt=\"Change URL.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The URL may not be changed once the field phase has begun. Otherwise externally placed links on the questionnaire or links in invitation mails already sent will not work and participants can no longer access the questionnaire.</p>\n<p class=\"wysiwyg-text-align-justify\">If you change the URL before the beginning of the field phase, make sure that these changes are also made to any mails you may have prepared (e.g. invitations).</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h4 id=\"icon-questionnaire-preview\" class=\"wysiwyg-text-align-justify\">Icon <strong>Questionnaire preview</strong>\n</h4>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This icon is displayed in all survey types.</p>\n</li>\n<li>\n<p>Clicking this icon will open a preview of your questionnaire, so you can do a test run.</p>\n</li>\n<li>\n<p>A preview is not counted as an actual participation, so no participation data is stored.</p>\n</li>\n</ul>\n<h4 id=\"icon-open-survey-in-new-window\" class=\"wysiwyg-text-align-justify\">Icon<strong> Open survey in new window</strong>\n</h4>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This icon is displayed in all survey types.</p>\n</li>\n<li>\n<p>By clicking this icon, you can open your survey in a new window.</p>\n</li>\n<li>\n<p>This is counted as an actual participation.</p>\n<ul>\n<li>\n<p>When cookies are activated in the browser and you click on the same icon again after you have suspended the survey, the same survey session will be opened. All entered data will be saved and the page last sent will be displayed. If the survey was completed and cookies are activated, clicking the icon again will not open the survey again. You will be presented with the message “Sorry, but you have already completed this survey. Thank you for participating.<em>” </em>instead. In case cookies are deactivated in the browser, each time you click on the icon, a new survey session will be started.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In order to activate/deactivate cookies, go to <strong>Survey menu → Project properties → Login options, </strong>and activate/deactivate the checkbox for <strong>Cookies are used</strong>. More information on cookies in anonymous surveys can be found <a href=\"https://qbdocs.atlassian.net/wiki/spaces/DOC/pages/1422196805/Project+Properties#Login-Options\">here</a>.</p>\n<h4 id=\"icon-participate-again\" class=\"wysiwyg-text-align-justify\">Icon <strong>Participate again</strong>\n</h4>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This icon is only displayed in anonymous surveys.</p>\n</li>\n<li>\n<p>This is counted as an actual participation.</p>\n<ul>\n<li>\n<p>Each time you click on this icon, a new survey session is started and a new session ID is generated – regardless of whether cookies are activated in the browser or not.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"h_01J3QAJ514X2N3W6HQ7643WEK2\" class=\"wysiwyg-text-align-justify\"><strong>Project Type</strong></h2>\n<h3 id=\"anonymous-projects\" class=\"wysiwyg-text-align-justify\"><strong>Anonymous projects</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>One possible way of inviting participants is to publish a link to the survey on a website or in a newsletter or an e-mail.</p>\n</li>\n<li>\n<p>With EFS, you will find it particularly easy to communicate the URL of your survey - not only online and through e-mail, but also in QR code via print media, for example. In anonymous projects, you will find the field “QR code” in the<strong> Survey menu</strong> in the “Distribution” section: clicking on the <strong>Display</strong> button opens a pop-up window containing the QR code of the survey URL. In order to save the QR code image to your PC, right-click the image and select the option “Save image to...”.</p>\n</li>\n<li>\n<p>Features for sharing links in the most influential social networks (Facebook, Twitter, Google+, LinkedIn und XING) are located in the Survey menu in the <strong>Distribution</strong> section.</p>\n</li>\n<li>\n<p>If your survey is intended to appear in a pop-up window you can make <em>EFS</em> create the requisite code with a click on the<strong> Get pop-up code</strong> button. Copy and paste the code into your web page. If you are not familiar with HTML, please ask a web designer or developer to help.</p>\n</li>\n</ul>\n<h3 id=\"personalized-surveys\" class=\"wysiwyg-text-align-justify\"><strong>Personalized surveys</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><em>Personalized surveys</em> require defining the sample in advance by filling in the so-called Participant administration. During the field phase, you can include additional participants in the survey at any time. This allows you to interview any number of persons.</p>\n</li>\n<li>\n<p>In the case of a personalized survey, a sample is the number of persons who have been released as participants for this survey.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Path:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><em>Projects</em> → {Selected project} → <em>Participant administration</em> menu item.</p>\n</li>\n</ul>\n<h3 id=\"panel-surveys-and-master-data-surveys\" class=\"wysiwyg-text-align-justify\"><strong>Panel surveys and master data surveys</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Surveys in panels are usually not comprehensive but rather based on smaller samples from the overall pool of panelists. <em>People</em> provides a number of functions for controlling the sampling process.</p>\n</li>\n</ul>\n<h2 id=\"process-progress\" class=\"wysiwyg-text-align-justify\"><strong>Process progress</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In projects of the type “Employee survey”, you can find a Gantt chart showing the process progress in the <strong>Survey</strong> menu. Via the hamburger button you can execute the following actions: <strong>Print chart</strong>,<strong> Download PNG image</strong>, <strong>Download PDF document</strong>, <strong>Download SVG vector image</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015166746642\" alt=\"Process progress.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Activating the next phase via the Gantt Diagram</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you have write rightss for “org_phase_admin”,, you can change the project phases directly via the Gantt chart.</p>\n</li>\n<li>\n<p>To do so, click on the phase which you intend to activate. After a warning, its status will be changed to “active”, while the status of all previous phases is changed to “finished”.</p>\n</li>\n<li>\n<p>Depending of the constellation, the status of the previous or following phase may change as well. If, for example, you change the status of the “Pretest” phase from “not yet started” to “active”, the status of the previously-activated “Setup” phase will be changed to “finished”.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The rights of<em> Org Processor </em>users are affected strongly by a change of phase. Never change the phase of a running project just to find out what might happen!</p>\n<h2 id=\"macros\" class=\"wysiwyg-text-align-justify\"><strong>Macros</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Creating survey projects often involves performing identical steps: For example, with each new project the following must be repeated: importing the standard company layout, activating predefined survey messages, loading previously defined standard wildcards and creating participants. The actions required to end a project also repeat themselves: The project must be deactivated, result data exported and the codebook and online statistics saved as data for documentation purposes. The macro function permits automation of such steps: Specific actions can be preconfigured by the user and executed again at a later time at the push of a button. The macro function makes it possible not only to execute individual actions, but also to bundle several actions into a single macro. This does not only simplify working with <em>Survey</em>, but it also increases the uniformity of work processes.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You create a macro both under the <strong>Project information</strong> menu item and under the <strong>Macros</strong> menu item in the <strong>Libraries</strong> menu. There you will find all macros available on the installation to which you have access, while the macros created under the <strong>Project information</strong> menu item are only available for the specific project.</p>\n</li>\n<li>\n<p>Creating macros requires write rights for <em>create_macro</em>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Create macro</strong> button. This will open the entry form shown. Set the basic properties of the macro:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Name</strong></p>\n</li>\n<li>\n<p><strong>Description</strong></p>\n</li>\n<li>\n<p><strong>Suppress output</strong>: If the checkbox is ticked and the macro activated, the output of precise information on the process will be suppressed, and only a message indicating success or failure will be output. It is recommended that you activate the message output when first testing a macro, but switch it off after a successful test.</p>\n</li>\n<li>\n<p><strong>Offer for projects of type</strong>: You can select the project types for which the macro is to be available.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015136701074\" alt=\"Create new macro.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The select boxes in the <strong>Actions</strong> area allow you to select preset actions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you wish to select only individual actions, click on these actions in the “Available actions” field, and then click on the simple <strong>Arrow</strong> icon to move them into the “Selected actions” field.</p>\n</li>\n<li>\n<p>If you wish to select all available actions, click on the larger arrow.</p>\n</li>\n<li>\n<p>After that, use the up and down arrows below the “Selected actions” select box to sort the actions in the desired order.</p>\n</li>\n<li>\n<p>Finally, confirm by clicking on <strong>Create</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015166748818\" alt=\"Actions.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">After creating the macro, you will automatically be taken to the Actions tab, which is now active. It allows you to edit or delete actions.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the name of an action or on the related<strong> Edit</strong> icon.</p>\n</li>\n<li>\n<p>In the “General” area of the entry form, you can enter a specific title for the action and describe it.</p>\n</li>\n<li>\n<p>In the “Parameters” area, the specific parameter for the respective action must be set, in this example, the message set to be chosen.</p>\n</li>\n<li>\n<p>After that, the setting must be saved by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<h3 id=\"using-macros\" class=\"wysiwyg-text-align-justify\"><strong>Using Macros</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The Project information menu item includes the “Execute automation macro” field in the <strong>Special actions</strong> section.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select the macro you created, and then click on the <strong>Run selected automation package</strong> icon.</p>\n</li>\n<li>\n<p>A popup window will provide an overview of the contents of this macro.</p>\n</li>\n<li>\n<p>If you wish to start the macro, confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n<li>\n<p>The actions configured will now be executed. If this involves generating files, the result display will provide a link you can use to download a zip file. Alternatively, you can have the file e-mailed to your address.</p>\n</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"h_01J3QACA901SA62CAFWCZD5QD6\" class=\"wysiwyg-text-align-justify\">How does a respondent experience a participation limit?</h3>\n<p class=\"wysiwyg-text-align-justify\">When the participation counter reaches its limit, new participants will see a message saying \"No further participants can be admitted.\" However, active participants can still complete their ongoing surveys.</p>\n<h3 id=\"h_01J3QACA90CSNJ4REJJ8J5DKXB\" class=\"wysiwyg-text-align-justify\">Can I change the URL of my survey after the field phase has begun?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, changing the URL after the field phase has started is not recommended as it will break existing links to the survey, preventing participants from accessing it.</p>\n<h3 id=\"h_01J3QACA90A3926NCWGPXD9GX2\" class=\"wysiwyg-text-align-justify\">How can I make my survey accessible?</h3>\n<p class=\"wysiwyg-text-align-justify\">Most standard question types are accessible by default, allowing screen reader compatibility and keyboard navigation. Complex question types (e.g., hotspots, images) may require additional descriptions for full accessibility.</p>",
    "user_segment_ids": []
}