{
    "id": 20371021175698,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371021175698.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371021175698-Triggers",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:45:43Z",
    "updated_at": "2024-08-21T12:14:51Z",
    "name": "Triggers",
    "title": "Triggers",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T08:23:12Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about various types of triggers in the EFS Survey, including mail triggers, page triggers, logout triggers, sample triggers, re-invitation triggers, variable split triggers, recoding triggers, random triggers, list triggers, bonus triggers, panel group triggers, and pre-qualification triggers. Each trigger type is explained in detail, along with its features, configuration steps, and usage examples.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Triggers are powerful tools in EFS Survey that allow you to automate various actions based on specific conditions or events during a survey. This article covers the different types of triggers available, their functionalities, and how to configure them effectively.</p>\n<ul>\n<li><a href=\"#mail-trigger\">Mail trigger</a></li>\n<li><a href=\"#page-trigger\">Page trigger</a></li>\n<li><a href=\"#logout-trigger\">Logout trigger</a></li>\n<li><a href=\"#sample-trigger\">Sample trigger</a></li>\n<li><a href=\"#re-invitation-trigger\">Re-invitation trigger</a></li>\n<li><a href=\"#variable-split-trigger\">Variable split trigger</a></li>\n<li><a href=\"#recoding-trigger\">Recoding trigger</a></li>\n<li><a href=\"#random-trigger\">Random trigger</a></li>\n<li><a href=\"#list-trigger\">List trigger</a></li>\n<li><a href=\"#bonus-trigger\">Bonus trigger</a></li>\n<li><a href=\"#panel-group-trigger\">Panel group trigger</a></li>\n<li><a href=\"#pre-qualification-trigger\">Pre-qualification trigger</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"mail-trigger\" class=\"wysiwyg-text-align-justify\">Mail trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The mail trigger is available for all survey types. When a defined event occurs, it will trigger the dispatch of an e-mail whose content was predefined, dynamically generated, or entered by the respondent to an address that was either defined in advance or collected during the survey.</p>\n<h3 id=\"basic-settings\" class=\"wysiwyg-text-align-justify\">Basic Settings</h3>\n<p class=\"wysiwyg-text-align-justify\">When configuring basic settings for a mail trigger please note the following features:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Execution position: As the execution position you should choose “After submitting page, after filter”.</p>\n</li>\n<li>\n<p>Condition: Definition of an appropriate condition is of special significance for mail triggers. For example, you can ensure that e-mails are only sent when the participant has completely filled a comments field.</p>\n</li>\n</ul>\n<h3 id=\"details\" class=\"wysiwyg-text-align-justify\">Details</h3>\n<p class=\"wysiwyg-text-align-justify\">In addition, the following specific settings must be made for this trigger type:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Mail template: Optionally, the contents to be dispatched by the trigger can be imported from a mail template and then modified and stored in the trigger editor.</p>\n</li>\n<li>\n<p>Mail sender</p>\n<ul>\n<li>\n<p>Manually defined mail sender: The e-mail address of the sender must be entered, it cannot be adopted from a mail template. Entering a real name (e.g. John Doe &lt;<a href=\"mailto:john.doe@example.com\">john.doe@example.com</a>&gt;) is not possible in triggers.</p>\n</li>\n<li>\n<p>Dynamic mail sender: here you can select the variables for single-row text fields (141) and “Other” fields (answer option + text). In personalized projects, the additional “u_email” wildcard is available, which is filled with the stored survey participant’s e-mail address.</p>\n</li>\n<li>\n<p>If you use the ACL right “mail_reply“ to hide “Reply-To” and “Return-Path” for a user team (usually for privacy protection), please take care to enter clearly defined values in the mail template which the team members are supposed to use for the trigger. The default options “Reply-To = From” and “Return-Path = From” cannot be used, because they are filled with the mail sender entered manually by the responsible user.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Mail recipient:</p>\n<ul>\n<li>\n<p>Manually defined recipient: In this field, you can define one or more recipients who do not necessarily have to be included in the<em> EFS Survey</em> system. You may either enter a single e-mail address or several e-mail addresses separated by commas. The e-mail will be sent to all the recipients you have defined.</p>\n</li>\n<li>\n<p>Dynamic mail recipient: You can select the variables for single row text fields (141) and “Other” fields (answer option + text). In personalized projects, the additional <em>u_email</em> wildcard is available, which is filled with the stored survey participant’s e-mail address.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Mailing date:</p>\n<ul>\n<li>\n<p>Immediately upon activation of the trigger. This option is preset as the default.</p>\n</li>\n<li>\n<p>Scheduled</p>\n</li>\n<li>\n<p>Dynamically upon activation of the trigger: This option triggers the dispatch after a period defined by the user, which can range from 30 minutes to 6 months.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"tips-for-creating-mail-templates-for-mail-triggers\" class=\"wysiwyg-text-align-justify\">Tips for Creating Mail Templates for Mail Triggers</h3>\n<p class=\"wysiwyg-text-align-justify\">When creating mail templates, especially for mail triggers please note the following:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The “Subject” field should have meaningful content otherwise the e-mail may be filtered out as spam under certain circumstances.</p>\n</li>\n<li>\n<p>What you enter in the mail form’s ”Content” field is dependent on the purpose of the trigger:</p>\n<ul>\n<li>\n<p>If you wish to send predefined mail content then enter the desired content in the form. At this point, you can use the wildcards available in the respective project type.</p>\n</li>\n<li>\n<p>If, on the other hand, you wish to send content entered by the participant, enter the variable of the corresponding input field in the questionnaire as a wildcard enclosed by two hash signs (#).</p>\n</li>\n<li>\n<p>If you wish to output the participant’s answers to closed-ended questions you can work with conditional replacement.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">On EFS Panel installations the mail trigger can access panel-specific values and master data variables using the #panelpoints#, #panelist_code# and #md_00# wildcards.</p>\n<h3 id=\"testing-mail-triggers\" class=\"wysiwyg-text-align-justify\">Testing Mail Triggers</h3>\n<p class=\"wysiwyg-text-align-justify\">When testing a mail trigger, please note: u_email or any project variables used are not replaced correctly when testing via the questionnaire preview, as data generated in the preview cannot be allocated to a participant account and dataset. Instead, the e-mails are always sent to the admin area user who has triggered the dispatch. To test the mail trigger properly, create a test participant with an e-mail address to which you have access, and test in productive mode. In this way, you can check whether the wildcards used are correctly replaced by the e-mail address and/or questionnaire entries.</p>\n<h2 id=\"page-trigger\" class=\"wysiwyg-text-align-justify\">Page trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">Generally, the questionnaire dramaturgy is configured by setting appropriate filters. As an alternative, the page trigger is available in all project types. You can use this trigger to specify any page as the next page to be shown to the respondent, depending on the selected variable characteristic. You can jump to the previous and next pages.</p>\n<p class=\"wysiwyg-text-align-justify\">The page trigger is available for all project types.</p>\n<p class=\"wysiwyg-text-align-justify\">Select the following execution position: „After submitting page, after filter“. Use this trigger type with caution because the questionnaire will quickly become cluttered for the administrator.</p>\n<h3 id=\"example-realizing-a-questionnaire-with-a-table-of-contents\" class=\"wysiwyg-text-align-justify\">Example: Realizing a questionnaire with a table of contents</h3>\n<p class=\"wysiwyg-text-align-justify\">Most questionnaires have a sequential structure: The respondents go through the questionnaire from the first page to the last. Filters and hiding conditions are used to skip blocks of pages and questions. As an alternative, a division into chapters with a table of contents is especially suited for very long surveys that do not have to be answered completely. The respondents will select a topic block they wish to edit from the table of contents, jump to that topic block, and will be routed back to the table of contents after editing it.</p>\n<p class=\"wysiwyg-text-align-justify\">Using page triggers, a non-sequential project can be realized like this:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>For the table of contents, you can, for example, create a question with a single response list (type 111).</p>\n</li>\n<li>\n<p>Create a page trigger that will query the variable created in Step 1. This page trigger is used to jump to the start pages of the individual chapters.</p>\n</li>\n<li>\n<p>At the end of each chapter, you must create a question of type 911 (user-defined) with a variable. In a hidden form field (input type=hidden), you must set the variable to a value of 1.</p>\n</li>\n<li>\n<p>For the final page of the chapter, you must also define a page trigger that will query whether the hidden variable has a value of 1 and then route to the table of contents. This condition will be ensured in any case when sending the final page: The page trigger is activated, and the respondent can make another selection in the table of contents.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note, that EFS does not support consecutive page triggers on target pages, and any page triggers on the target page, set to execution position “directly”, will be ignored.</p>\n<h2 id=\"logout-trigger\" class=\"wysiwyg-text-align-justify\">Logout trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The logout trigger can be used in every project type. “Logout” means that the participant will be routed to the system final page, without any specific message. You can use the logout trigger if, for example, you have a complex, nested questionnaire and want to route respondents to the final page in a very straightforward way.</p>\n<p class=\"wysiwyg-text-align-justify\">The participant’s interview will be classified as a completed interview (disposition code 31). If the survey contains additional final pages, the panelist will always be sent to the system's final page.</p>\n<h2 id=\"sample-trigger\" class=\"wysiwyg-text-align-justify\">Sample Trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The sample trigger allows you to invite participants, depending on a condition that you have defined, to a second personalized survey or panel survey. The participants are added dynamically to the participant administration or sample of the follow-up project.</p>\n<h3 id=\"example\" class=\"wysiwyg-text-align-justify\">Example</h3>\n<p class=\"wysiwyg-text-align-justify\">You are surveying customers of an online shop to find out how satisfied they are and when they expect to receive the goods they bought: Depending on the expected date of delivery, the interview participants will receive an email inviting them to a second survey after a certain delay. The respondents are entered into the sample as active participants.</p>\n<h3 id=\"features\" class=\"wysiwyg-text-align-justify\">Features</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The sample trigger can be set up and executed in all quantitative project types (AN, PE, PA, MD, ES, MSF).</p>\n</li>\n<li>\n<p>For the target project, you can use all project types with participant administration, i.e. personalized projects, employee surveys, multi-source feedback, panel surveys, and master data surveys.</p>\n</li>\n<li>\n<p>You can only invite participants with existing panelist accounts to panel surveys or master data surveys. The e-mail address is used to match the participant and panelist account.</p>\n</li>\n</ul>\n<h3 id=\"configuring-sample-trigger\" class=\"wysiwyg-text-align-justify\">Configuring Sample Trigger</h3>\n<p class=\"wysiwyg-text-align-justify\">The basic settings are the same as for other trigger types. When configuring the details, please mind:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select the participant administration or sample of the target project to which the participants are to be added and invited.</p>\n</li>\n<li>\n<p>In the “Mail dynamically to” field, select the variable that contains the e-mail address of the participants:</p>\n<ul>\n<li>\n<p>This e-mail address will be used not only for delivering the invitations, but to create the participant accounts in the target project, or to insert the panelists into the sample of the target project in panel and master data surveys.</p>\n</li>\n<li>\n<p>In projects with participant administration, this is usually<em> u_email</em>.</p>\n</li>\n<li>\n<p>In anonymous projects, similar to the mail trigger, you can select the variables for single row text fields (141) and “Other” fields (answer option + text). It is recommendable to apply an “e-mail” input format check to the selected variable.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Just as with the mail trigger, you have to configure the e-mail to be sent. You can define the mail in the trigger editor. Alternatively, you can import the content of a mail template, too.</p>\n<ul>\n<li>\n<p>The mail sender must be specified.</p>\n</li>\n<li>\n<p>The mail text must contain an access code or link for the secondary survey. For this purpose, use the wildcard #url#, #code# and #code_complete#: if participant administration or sample of the secondary project are selected, the wildcards will be filled with the URL and/or code of the target project.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Define the dispatch date:</p>\n<ul>\n<li>\n<p>Per default, the emails will be dispatched immediately upon activation of the trigger.</p>\n</li>\n<li>\n<p>Optionally, another dispatch date can be defined. Create a user-defined variable (c variable) or project variable of type “text”. This variable should contain the number of days from the execution of the trigger to the dispatch of the mail, for the proper dispatch date, <em>EFS</em> will then add another 12 hours to the value of this variable. Select this variable in the reinvitation trigger.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"re-invitation-trigger\" class=\"wysiwyg-text-align-justify\">Re-invitation trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The reinvitation trigger reinvites participants to take part in a survey, depending on a condition that you have defined. The data records of the participants are reset without deletion of data to disposition code 11 or 12, i.e. if the participants restart at a later date, they will be routed to the first page of the survey again.</p>\n<h3 id=\"example-1\" class=\"wysiwyg-text-align-justify\">Example</h3>\n<p class=\"wysiwyg-text-align-justify\">At the start of a long, complex survey, you want to offer participants the option to interrupt and participate at a later date. On one of the first pages, you ask if the participant does have sufficient time to respond at the moment. If not, you offer to send a reminder mail. If a participant does not have sufficient time and wishes a reminder mail, he’s routed to a final page via a filter. On this final page, the reinvitation trigger is executed. It resets the data record and sends the reminder mail at the desired later date.</p>\n<h3 id=\"features-1\" class=\"wysiwyg-text-align-justify\">Features</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The reinvitation trigger is only available on the final pages.</p>\n</li>\n<li>\n<p>It can be used in personalized surveys, employee surveys, multi-source feedback, panel surveys, and master data surveys. In anonymous surveys, this trigger type is not available.</p>\n</li>\n<li>\n<p>The participants’ disposition code will be reset to 11 resp. 12.</p>\n</li>\n<li>\n<p>The data records are reset without deleting, i.e. already-given answers of the participant are not deleted.</p>\n</li>\n<li>\n<p>Participants who respond to the reminder mail will start again on the first page: Due to the reset of the disposition code, the resumption is considered a restart.</p>\n</li>\n</ul>\n<h3 id=\"configuring-a-re-invitation-trigger\" class=\"wysiwyg-text-align-justify\">Configuring a Re-Invitation trigger</h3>\n<p class=\"wysiwyg-text-align-justify\">The basic settings are the same as for other trigger types. When setting the special options, please mind:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Just as with the mail trigger, you have to configure the e-mail to be sent. Usually, the content of a mail template is imported. Alternatively, you can define the mail in the trigger editor, too.</p>\n<ul>\n<li>\n<p>The mail sender must be defined beforehand.</p>\n</li>\n<li>\n<p>Depending on the situation, it might make sense to repeat the access code or link in the mail text. For this purpose, use the wildcards #url#, #code# and #code_complete#.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Define the dispatch date: </p>\n<ul>\n<li>\n<p>Per default, the emails will be dispatched immediately upon activation of the trigger.</p>\n</li>\n<li>\n<p>Optionally, another dispatch date can be defined. Create a user-defined variable (c variable) or project variable of type “text”. This variable should contain the number of days from the execution of the trigger to the dispatch of the mail, for the proper dispatch date, EFS will then add another 12 hours to the value of this variable. Select this variable in the reinvitation trigger.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"variable-split-trigger\" class=\"wysiwyg-text-align-justify\">Variable split trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">You can use variable split triggers to</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>save transferred parameters in user-defined variables. (This does not refer to URL parameters: You can save any parameters transferred via GET in user-defined variables.)</p>\n</li>\n<li>\n<p>read cookies from the respondent and save them in user-defined variables</p>\n</li>\n<li>\n<p>break down the variables into their individual components before saving the parameters or cookies, if necessary.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The user-defined variables will be included in any export, but you can also use them for screening within the survey, output them in the questionnaire, etc. The variable split trigger is available for all survey types.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If a variable split trigger is used on the first page of a survey, then the execution position cannot be “=directly”.</p>\n</li>\n<li>\n<p>Variables located within a loop branch cannot be used as a split attribute.</p>\n</li>\n<li>\n<p>The following variables cannot be used as source or target variables for data privacy reasons: <em>u_account</em>, <em>u_ppasswd</em>, <em>u_passwd</em>, <em>u_email</em>, <em>u_initial_passwd</em>. Existing recodings of these variables are not supported either.</p>\n</li>\n</ul>\n<h3 id=\"application-example\" class=\"wysiwyg-text-align-justify\">Application Example</h3>\n<p class=\"wysiwyg-text-align-justify\">You are planning an advertising effectiveness study intended to test a new form of advertising. Your cooperation partner sets a cookie with every website visitor who has seen the new form of advertising. Now, you want to find out whether there are connections between answer patterns in your study and the form of advertising (e.g. “Do people who have seen the form of advertising remember its contents?”).</p>\n<p class=\"wysiwyg-text-align-justify\">At the beginning of the survey, all cookies will automatically be read and saved, collectively, in a system variable. The variable split trigger will pinpoint one cookie value, read it from the collection, and save it in a user-defined variable.</p>\n<p class=\"wysiwyg-text-align-justify\">For reasons of privacy, the browsers only allow certain cookies to be read. If you run the study at the <a href=\"http://survey.mycompany.com\">survey.mycompany.com</a> domain, for example, you can read all cookies in the <a href=\"http://mycompany.com\" data-card-appearance=\"inline\">http://mycompany.com</a> domain group. This includes, e.g., <a href=\"http://advert.mycompany.com\">advert.mycompany.com</a> or <a href=\"http://survey.mycompany.com\">survey.mycompany.com</a>, but not <a href=\"http://www.somethingelseentirely.com\">www.somethingelseentirely.com</a> or <a href=\"http://www.mycompany.net\">www.mycompany.net</a>. However, this will only work if the cookie is set in such a way that other subdomains are allowed to read it. Clarify this in advance with those responsible for setting the cookie.</p>\n<p class=\"wysiwyg-text-align-justify\">To read the respondents’ cookies and save a cookie value in a user-defined variable, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create a new variable in the <strong>Project properties</strong> menu on the <strong>User-defined variables</strong> tab. As you want to save the cookie name, choose the “Text” type. Assign a meaningful label. You can output the variable’s content via #Label# or #c_000n#, where n is the number of the user-defined variable.</p>\n</li>\n<li>\n<p>Then, switch to the page of the survey on which you wish to create the trigger.</p>\n</li>\n<li>\n<p>Click on the<strong> Trigger</strong> tab and create a trigger of the “Variable split trigger” type.</p>\n</li>\n<li>\n<p>First, specify the condition for which the trigger is to be activated. You will normally want to execute the trigger on the first page of your survey. If this page does not contain a variable, create a dummy variable with question type 911.</p>\n</li>\n<li>\n<p>In the trigger editor, various source variables are visible:</p>\n</li>\n</ul>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 344.0px;\"> <col style=\"width: 416.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Variable</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Cookies (start_cookies)</p>\n</td>\n<td>\n<p>All readable cookies.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>GET variables at the beginning of the survey (start_get_vars)</p>\n</td>\n<td>\n<p>All parameters were transferred at the beginning of the survey.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Quota (quota)</p>\n</td>\n<td>\n<p>Contains the result of quota processes.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Project variables (v_xxx)</p>\n</td>\n<td>\n<p>The “normal” project variables.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A cookie, when it is set, has a name and a value, e.g. opst_demopanel_108 and “7a8cc5c05df7820217d9bf3f6c5b0781”. The “Array field” allows you to define which of the collected cookies is to be written into the user-defined variable.</p>\n</li>\n<li>\n<p>The cookie’s value can be structured to contain various values, separated by a separator such as | or ;. For example, the cookie value could encrypt the date, the browser version, and the site by which the cookie was set. If your cookie has such a structure, you can save the individual values separately using different destination variables. To do so, you must save the settings, create a new destination variable, and enter the separator character (e.g. a comma).</p>\n</li>\n<li>\n<p>The value of the cookie named in the “Array field” will now be stored in the user-defined variable.</p>\n</li>\n</ul>\n<h3 id=\"reading-get-variables\" class=\"wysiwyg-text-align-justify\">Reading Get Variables</h3>\n<p class=\"wysiwyg-text-align-justify\">Analogously, you can read Get variables attached to the survey URL. To do so, use the Get variables at the beginning of the survey as the source variable, enter the name of the Get variable in the <strong>Array field,</strong> and choose the user-defined variable you want to write the value to as the destination variable.</p>\n<h2 id=\"recoding-trigger\" class=\"wysiwyg-text-align-justify\">Recoding trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The recoding trigger is used to recode variables during a survey. The value(s) for one or more variables can be set either conditionally (i.e. depending on survey results) or unconditionally (i.e. always). For example, the new trigger allows you to</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>transfer values from one variable to another</p>\n</li>\n<li>\n<p>prefill text fields</p>\n</li>\n<li>\n<p>perform calculations and output results based on the entries</p>\n</li>\n<li>\n<p>recode multiple variables at the same time</p>\n</li>\n<li>\n<p>access and change participant and panelist data</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">All recodings made as the result of actual participation will be logged (see the section “Viewing the recodings performed”).</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Please note:</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The recoding trigger is available for all survey types.</p>\n</li>\n<li>\n<p>You can recode project variables (with the exception of variables located within a loop branch), user-defined variables and URL parameters, participant data and panelist data (with the exception of<em> u_account</em>, <em>u_ppasswd</em>, <em>u_passwd</em>,<em> u_email</em>, <em>u_initial_passwd</em>) and master data.</p>\n</li>\n<li>\n<p>System variables cannot be recoded.</p>\n</li>\n<li>\n<p>If the value to be set is a text, put it between quotation marks.</p>\n</li>\n<li>\n<p>Both recodings and trigger actions require a lot of server resources, i.e. the usage of recoding triggers affects the performance of the questionnaire. Therefore, it is recommended to use not more than 100 recodings per trigger and per page.</p>\n</li>\n</ul>\n<h3 id=\"recoding-syntax\" class=\"wysiwyg-text-align-justify\">Recoding syntax</h3>\n<p class=\"wysiwyg-text-align-justify\">When defining recoding conditions, the following rules apply:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The operators + - / * and ( and ) can be used.</p>\n</li>\n<li>\n<p>Wildcards (#v_xxx#) can be used to insert project variables. Please mind:</p>\n<ul>\n<li>\n<p>Special project variables, e.g. loop variables, cannot be used in the condition.</p>\n</li>\n<li>\n<p>For project variables relating to an open text field, #v_000n# outputs the content. Make sure to enclose the wildcard by quotation marks in this case, e.g. '#v_1#'</p>\n</li>\n<li>\n<p>For closed-ended questions the wildcard #v_000n# in the trigger outputs the code.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Texts (strings) must be enclosed by quotation marks (e. g. 'foo').</p>\n</li>\n<li>\n<p>It is not permitted to use the special characters? and $ in the recoding condition. They are reserved for internal usage in database queries.</p>\n</li>\n<li>\n<p>You can use the MySQL functions NOW() and IF() on all EFS installations.</p>\n<ul>\n<li>\n<p>NOW() returns the current date and time. Example: NOW() -&gt; 2011-02-11 12:08:29</p>\n</li>\n<li>\n<p>IF(expr1,result1,result2) is processed as follows: If expr1 is TRUE, IF() returns result1, otherwise it returns result2. Example: IF(#v_1#&lt;2,'Yes','No') →  If #v_1# &lt; 2, IF() returns “Yes”, otherwise it returns “No”.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>On installations with deactivated High-Security Mode, other, non-security-relevant <a href=\"https://mariadb.com/kb/en/built-in-functions/\">SQL functions</a> can be used. Access to other databases, users, or files is not possible. Unfortunately, our support will not be able to assist you with these advanced functions.</p>\n</li>\n</ul>\n<h3 id=\"example-preallocation-using-participant-data\" class=\"wysiwyg-text-align-justify\">Example: Preallocation using participant data</h3>\n<p class=\"wysiwyg-text-align-justify\">In an employee survey, the question relating to pertinent departments is to be preallocated according to the information available in participant administration.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create the question where the pertinent department is to be entered.</p>\n</li>\n<li>\n<p>Switch to the page view and open the <strong>Trigger</strong> menu.</p>\n</li>\n<li>\n<p>Choose the recoding trigger, and confirm by clicking on <strong>Submit</strong>.</p>\n</li>\n<li>\n<p>The trigger will be created.</p>\n</li>\n<li>\n<p>Enter “Trigger name” and “Trigger description”.</p>\n</li>\n<li>\n<p>Choose the execution position “Directly”.</p>\n</li>\n<li>\n<p>Decide whether the “Also execute trigger in preview mode” function should be enabled. In this example, it is advisable to enable this function because it allows you to perform tests directly in the preview.</p>\n</li>\n<li>\n<p>Decide whether the trigger can be executed repeatedly in one survey session. In this example, it is not necessary.</p>\n</li>\n<li>\n<p>Lastly the settings under “Detail configuration” have to be made, i.e. the recodings need to be defined.</p>\n</li>\n<li>\n<p>Select the variable to be recoded, and enter the value for which the recoding condition applies. In the example, “v_1“ is the variable where the answer to the question relating to pertinent departments and characteristic “1” is saved.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Click on the<strong> Filter</strong> icon, which will now appear, to define the condition.</p>\n</li>\n<li>\n<p>Choose the variable whose content is to be loaded as well as the condition and the code. In this example, variable v_1 is to be prefilled with code 1 if the participant variable labeled “u_department” equals 1.</p>\n</li>\n<li>\n<p>Click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Repeat this operation for all characteristics of the variable v_1, which are to be preallocated.</p>\n</li>\n</ul>\n<h3 id=\"viewing-the-recodings-performed\" class=\"wysiwyg-text-align-justify\">Viewing the recodings performed</h3>\n<p class=\"wysiwyg-text-align-justify\">Navigate to the <strong>Projects</strong> → {Selected project} → <strong>Documentation</strong> → <strong>Recoding log</strong> menu to view all recodings that have been performed.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>After six months, the log data will be deleted.</p>\n</li>\n</ul>\n<h2 id=\"random-trigger\" class=\"wysiwyg-text-align-justify\">Random trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">For scientific projects in particular, it is often necessary to form participant groups to which different questionnaire versions are presented at random. The random trigger allows you to make random assignments: All you have to do is enter a range for the random number, e.g. “1-5“ (depending on the number of different questionnaires). At the beginning of the survey, “dice” are used to generate a number, which is then written into a user-defined variable (“c” variable). These variables can subsequently be used to create the corresponding filters for the various questionnaire versions.</p>\n<p class=\"wysiwyg-text-align-justify\">The additional feature “Approximate uniform distribution within given range” has also been incorporated, to achieve a good uniform distribution of the randomly generated numbers and, consequently, of the selected respondent groups, (see last section).</p>\n<p class=\"wysiwyg-text-align-justify\">The random trigger is available for all survey types.</p>\n<h3 id=\"configuring-the-random-trigger\" class=\"wysiwyg-text-align-justify\">Configuring the Random Trigger</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Switch to the page view and open the <strong>Trigger</strong> menu.</p>\n</li>\n<li>\n<p>Choose a random trigger, and confirm by clicking on <strong>Submit</strong>. The trigger will be created.</p>\n</li>\n<li>\n<p>On the <em>Detail Configuration</em>, select the user-defined variable already created, into which the random number will be subsequently written.</p>\n</li>\n<li>\n<p>Set the user-defined variable: You are free to choose the label, however, the variable type should be “Integer or floating point numbers”.</p>\n</li>\n<li>\n<p>Make the usual settings: “Trigger name”, “Trigger description”, “Execution position” and “Condition”.</p>\n</li>\n<li>\n<p>Decide whether the “Also execute trigger in preview mode” function should be enabled. When testing, it may in certain circumstances be helpful to have conditions that remain constant.</p>\n</li>\n<li>\n<p>Decide whether the trigger can be executed repeatedly in one survey session.</p>\n</li>\n<li>\n<p>Lastly the settings under “Detail configuration” have to be made: Only user-defined variables can be used to save the random number.</p>\n</li>\n<li>\n<p>The minimum and maximum values of the random number are required.</p>\n</li>\n<li>\n<p>You have the option of specifying that a uniform distribution should be approximated.</p>\n</li>\n<li>\n<p>Finally, click on <strong>Save</strong>.</p>\n</li>\n</ul>\n<h3 id=\"uniform-distribution\" class=\"wysiwyg-text-align-justify\">Uniform Distribution</h3>\n<p class=\"wysiwyg-text-align-justify\">The distribution of the randomly generated values will only approximate a uniform distribution only if the number of cases is sufficiently large. The special feature labeled “Approximate uniform distribution within given range” is used to allow you to simulate a uniform distribution even with small and medium numbers of participants. If this function is enabled, the numbers generated will no longer be actual random numbers, rather the numbers will be generated in such a way that, even for a small number of cases, their distribution will tend strongly toward a uniform distribution.</p>\n<h2 id=\"list-trigger\" class=\"wysiwyg-text-align-justify\">List trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The list trigger allows you to transfer the contents of a list into user-defined variables. The contents of the user-defined variables can in turn be displayed in the questionnaire via wildcards. The main purpose of this new function consists in presenting - in certain work situations - an alternative to the use of loops, which are considerably more complex to evaluate. For example, at the beginning of a survey, respondents are often presented with a range of brands and products and asked to select the ones they know. The questions in the subsequent survey will only involve those brands and products marked as “known”. In the past, this kind of questionnaire was realized with the help of loops. Alternatively, the list trigger now allows you to encode the “known” brands or products in user-defined variables and to import these during the subsequent survey via wildcards. Thus, the export data record remains reasonably sized.</p>\n<p class=\"wysiwyg-text-align-justify\">The functional scope at a glance:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The list elements remaining after processing the list inclusion conditions, list options, and sort order, can be written in user-defined variables.</p>\n</li>\n<li>\n<p>You can choose whether to record the element number or the element label. Please note that in multilingual projects, labels can only be recorded and displayed in the default language.</p>\n</li>\n<li>\n<p>The various list processing options can be separately configured for the trigger. The list trigger is independent of the settings that are made when using the list on the pages of the questionnaire.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The list trigger is available for all survey types.</p>\n<h3 id=\"configuring-the-list-trigger\" class=\"wysiwyg-text-align-justify\">Configuring the List Trigger</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>First, create the list.</p>\n</li>\n<li>\n<p>Next, you have to create the required variables in the <strong>Project Properties</strong> menu on the <strong>User-defined Variables</strong> tab.</p>\n</li>\n<li>\n<p>To create the list trigger, open the <strong>Trigger</strong> menu on the appropriate page, select the type “List trigger” and confirm by clicking on<strong> Submit</strong>.</p>\n</li>\n<li>\n<p>Make the usual basic trigger settings (name, execution position, etc.).</p>\n</li>\n<li>\n<p>Select the desired list and click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Further setting options will now be displayed in the lower part of the dialog.</p>\n</li>\n<li>\n<p>In the “Settings” section, successively specify for each remaining list element (i. e. for each list element that remains after processing all inclusion conditions, etc.) which list property is to be transferred into which destination variable. The available list properties are element number and element label.</p>\n</li>\n<li>\n<p>After clicking on <strong>Save</strong>, the settings will be adopted and the line “New” for selecting the next list element will be displayed again.</p>\n</li>\n<li>\n<p>In the lower sections, you can set list options and sort the order of the list elements.</p>\n</li>\n<li>\n<p>Then, confirm by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<h3 id=\"list-trigger-data-in-the-export\" class=\"wysiwyg-text-align-justify\">List Trigger data in the Export</h3>\n<p class=\"wysiwyg-text-align-justify\">In the example shown above, three elements are selected at random from the list of elements that the respondents selected in the questionnaire. The list trigger writes these, or rather their labels, in three user-defined variables.</p>\n<h2 id=\"bonus-trigger\" class=\"wysiwyg-text-align-justify\">Bonus trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">In panel and master data surveys, you can award bonus points for reaching a particular page of the questionnaire, for giving a correct answer, or for other events.</p>\n<h3 id=\"features-2\" class=\"wysiwyg-text-align-justify\">Features</h3>\n<p class=\"wysiwyg-text-align-justify\"><em>EFS</em> offers a lot of freedom when allocating bonus points:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A panelist may receive more allocations in one survey.</p>\n</li>\n<li>\n<p>A potential allocation on the final page of the survey does not affect any bonus point allocations via a bonus trigger. In particular, you may use triggers and the final page to allocate different amounts of points.</p>\n</li>\n<li>\n<p>You may use multiple bonus triggers within one survey.</p>\n</li>\n<li>\n<p>You can use the bonus trigger only for allocating points. The subtraction of points makes no sense within the context of a survey and is therefore not possible.</p>\n</li>\n</ul>\n<h3 id=\"configuring-bonus-triggers\" class=\"wysiwyg-text-align-justify\">Configuring Bonus Triggers</h3>\n<p class=\"wysiwyg-text-align-justify\">The basic settings are the same as for other trigger types. Additionally, the following settings specific to this type of trigger have to be performed:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Bonus points to be allocated: In this field, you define how many points the trigger is supposed to allocate to the panelists.</p>\n</li>\n<li>\n<p>Trigger behavior: If the respective panelist has already been allocated points by another bonus trigger, it is up to you to decide whether the current trigger shall be executed.</p>\n</li>\n</ul>\n<h3 id=\"configuring-bonus-trigger-entry-in-the-bonus-points-history\" class=\"wysiwyg-text-align-justify\">Configuring bonus trigger entry in the bonus points history</h3>\n<p class=\"wysiwyg-text-align-justify\">Every allocation of bonus points is logged in the respective panelist’s bonus points history. At the time it is not possible to define a different text for every bonus trigger and every final page. Instead, the message “Entry into panelist’s bonus points history” is defined in the <strong>Project properties</strong>→ <strong>Survey messages</strong> menu and is used for all allocations within the project. Therefore, make sure to enter a meaningful general text.</p>\n<h2 id=\"panel-group-trigger\" class=\"wysiwyg-text-align-justify\">Panel group trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">After they have taken part in a survey, it may often be convenient to collect the panelists in a specific panel group, e.g. to facilitate incentivization or other follow-up processes. The panel group trigger allows you to do this without much effort. It is also possible to remove panelists from a group.</p>\n<h3 id=\"configuring-the-panel-group-trigger\" class=\"wysiwyg-text-align-justify\">Configuring the Panel Group Trigger</h3>\n<p class=\"wysiwyg-text-align-justify\">The panel group trigger is available in panel surveys and master data surveys. The basic settings are the same as for other trigger types. Additionally, the following settings specific to this type of trigger have to be performed:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Group category</p>\n</li>\n<li>\n<p>Target group.</p>\n</li>\n<li>\n<p>Trigger mode: You can choose whether the respective panelist is to be added to or removed from the group.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The update rule “Copy from survey to group” provides the “Add panelist to group” function for the updating of groups.</p>\n<h2 id=\"pre-qualification-trigger\" class=\"wysiwyg-text-align-justify\">Pre-qualification trigger</h2>\n<p class=\"wysiwyg-text-align-justify\">The <em>Pre-Qualification trigger</em> can be used to import participants as panelists. They have to take part in an <em>Anonymous survey</em> (AN), a <em>Personalized survey</em> (PE), <em>Employee survey</em> (ES). The panelists will be created using survey variables. The e-mail address is mandatory. To configure the trigger two tabs are available. You will use the<strong> Settings</strong> and the <strong>Detail configuration</strong> tabs.</p>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Settings</strong> tab, a name and a short trigger description can be added. Then you have to set up the conditions and check whether the trigger should also be executed in the questionnaire preview and whether it should be executed multiple times in one survey session.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRV24YJXQX3QJQZ8YDX\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRV44YJXM0YJQBXQJRA\" class=\"wysiwyg-text-align-justify\">What is the difference between a mail trigger and a re-invitation trigger?</h3>\n<p class=\"wysiwyg-text-align-justify\">A mail trigger can be used to send emails based on various conditions throughout the survey, while a re-invitation trigger is specifically used to reinvite participants to a survey and reset their data record without deleting data. Re-invitation triggers are only available on the final pages of certain survey types.</p>\n<h3 id=\"h_01HGKSMPRV64YJXQX3QJQZ8YDZ\" class=\"wysiwyg-text-align-justify\">Can I use multiple triggers in a single survey?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can use multiple triggers of different types within a single survey. This allows for complex survey logic and automation of various actions based on different conditions or events.</p>\n<h3 id=\"h_01HGKSMPRV84YJXM0YJQBXQJRC\" class=\"wysiwyg-text-align-justify\">How can I test if my triggers are working correctly?</h3>\n<p class=\"wysiwyg-text-align-justify\">To test triggers, create test participants with accessible email addresses and run the survey in productive mode. This allows you to verify that wildcards are replaced correctly and that the triggers function as intended. For some trigger types, you can also enable execution in preview mode for testing purposes.</p>",
    "user_segment_ids": []
}