{
    "id": 20370435825810,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370435825810.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370435825810-Media-Library",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:05:00Z",
    "updated_at": "2024-08-21T12:51:57Z",
    "name": "Media Library",
    "title": "Media Library",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T13:53:09Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about the Media Library feature in EFS, including its various components, functionalities, and best practices for managing media files within projects and across installations.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The Media Library in EFS consists of three main components: Current Project, Common Library, and Tivian Library. Each component serves different purposes and has specific features to help users manage and utilize media files effectively in their projects.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#current-project\">Current Project</a></li>\n<li><a href=\"#common-library\">Common Library</a></li>\n<li><a href=\"#tivian-library\">Tivian Library</a></li>\n</ul>\n<h2 id=\"current-project\" class=\"wysiwyg-text-align-justify\">Current Project</h2>\n<p class=\"wysiwyg-text-align-justify\">The project-related media library on the <strong>Current Project</strong> tab offers the following options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can use not only images but SVG graphics, flash, and video formats e.g. RealVideo or Quicktime. To access a detailed list of the permitted file types, click on the <strong>Question mark</strong> icon in the <strong>Upload file</strong> dialog.</p>\n</li>\n<li>\n<p>The uploaded files are stored in the project directory in the directory /images.</p>\n</li>\n<li>\n<p>Directories can be created within /images to improve the overview.</p>\n</li>\n<li>\n<p>The maximum file size is installation-specific. If you exceed the threshold value, a note will be displayed.</p>\n</li>\n<li>\n<p>You can upload zip files and unpack them directly if you wish. Thus multimedia files that exceed the maximum file size can be uploaded if it is possible to compress them to the allowed size. The upload of a high number of files or the creation of a directory with sub-directories is made easier by compression, too: You can sort the files as required in a parent directory and subdirectories, compress these, and then, in one operation, upload them to the server and have them unpacked.</p>\n</li>\n</ul>\n<h3 id=\"uploading-files\" class=\"wysiwyg-text-align-justify\">Uploading files</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the<strong> Upload file</strong> button.</p>\n</li>\n<li>\n<p>Locate the file on your hard disk using the <strong>Browse</strong> function.</p>\n</li>\n<li>\n<p>If you are uploading a zip file, you can have the system unpack it and automatically create subdirectories in one operation. To do so, tick the “Unpack ZIP file” checkbox.</p>\n</li>\n<li>\n<p>You have the option of defining a wildcard. You can use the characters a-z, A-Z and 0-9. The wildcards must be enclosed in two hash signs (#).</p>\n</li>\n<li>\n<p>If you want to overwrite files in your media library with an updated version, simply activate the new “Overwrite file(s)” checkbox during upload.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Upload</strong>.</p>\n</li>\n</ul>\n<h3 id=\"viewing-and-editing-the-uploaded-files\" class=\"wysiwyg-text-align-justify\">Viewing and Editing the Uploaded Files</h3>\n<p class=\"wysiwyg-text-align-justify\">If you search for a specific file, you may either skip through the directories or use the search form. It offers a full-text search for the file name, which means it is enough to enter a part of the name to find a file.</p>\n<p class=\"wysiwyg-text-align-justify\">For each file the following information is listed:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Thumbnails for the files that contain images: Clicking on a thumbnail allows you to open a detailed view of the respective image. This contains the image, height, and width information, and the appropriate img tags with absolute and relative paths.</p>\n</li>\n<li>\n<p>Description (filled automatically with the file name)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The height and width of the images and an alternative text are defined when inserting the images into the <em>Multimedia</em> question type.</p>\n<h3 id=\"editing-individual-files\" class=\"wysiwyg-text-align-justify\">Editing Individual Files</h3>\n<p class=\"wysiwyg-text-align-justify\">If you scroll over a row or activate a checkbox, the following action icons are displayed:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Info</strong>: In a pop-up window, you can find the img tag that can be used to incorporate a file into the questionnaire, with both absolute and relative paths. Furthermore, the absolute path is displayed separately for copy and paste.</p>\n</li>\n<li>\n<p><strong>Edit file</strong>: Opens an entry form in which you can change the file name and description.</p>\n</li>\n<li>\n<p><strong>Move file</strong>: Opens a drop-down list from which you can choose a different category for the file.</p>\n</li>\n<li>\n<p><strong>Delete</strong></p>\n</li>\n</ul>\n<h3 id=\"editing-several-files-at-the-same-time\" class=\"wysiwyg-text-align-justify\">Editing Several Files at the same Time</h3>\n<p class=\"wysiwyg-text-align-justify\">Using the icons above the file list, you can download, move, or delete several or all files. Just activate the desired files and click on the appropriate icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The media library is not a secure storage location! It is recommended to save only logos and/or data that do not need to be protected (e.g. by a security query). The saved logos and/or data are publicly accessible.</p>\n<h3 id=\"using-categories-to-organize-files\" class=\"wysiwyg-text-align-justify\">Using Categories to Organize Files</h3>\n<p class=\"wysiwyg-text-align-justify\">You can create categories in the media library, i.e. in the project-related directory/images, which help to improve the overview.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating new categories</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the category below which you wish to create the new category.</p>\n</li>\n<li>\n<p>Click on the <strong>Create category</strong> icon.</p>\n</li>\n<li>\n<p>Enter the name.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>OK</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Renaming categories</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the category you wish to rename.</p>\n</li>\n<li>\n<p>Click on the <strong>Rename category</strong> icon.</p>\n</li>\n<li>\n<p>Enter the new name.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>OK</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Deleting categories</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the category you wish to delete.</p>\n</li>\n<li>\n<p>Click on the <strong>Delete category</strong> icon.</p>\n</li>\n<li>\n<p>Affirm the confirmation window.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">When deleting a category, all files in it will be removed as well. The images category cannot be deleted.</p>\n<h3 id=\"downloading-files-from-media-library\" class=\"wysiwyg-text-align-justify\">Downloading Files from the Media Library</h3>\n<p class=\"wysiwyg-text-align-justify\">Individual or several files can be downloaded. For this purpose, a <strong>Download</strong> icon is available on every level of the category structure on the <strong>Current Project</strong> and<strong> Common library</strong> tabs. If you select the desired files and click this icon, a zip file will be generated that contains the content of the current folder including its subfolders. You can save this file locally to a PC, open it, and then view or edit the images.</p>\n<p class=\"wysiwyg-text-align-justify\">When working in the installation-wide media library, in particular, take care to select only reasonable amounts of data for download, i.e. less than 10 MB and not more than 30 files. Otherwise, the download process can affect the performance of the <em>EFS</em> installation.</p>\n<h4 id=\"protecting-images\" class=\"wysiwyg-text-align-justify\">Protecting Images</h4>\n<p class=\"wysiwyg-text-align-justify\">Customers running product or cover tests frequently ask for better protection against illegal copying and screenshotting of their content. A dedicated image protection feature makes storing or screenshotting images considerably more difficult.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the questionnaire, participants will see only the silhouette and outline of the protected image, plus an instruction for display.</p>\n</li>\n<li>\n<p>If the participants press the key combination specified in the instruction, the image will be displayed. (They have to keep the blank key pressed and click on the image with the left key of the mouse pointer.)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For technical reasons, it is not possible to prevent participants from taking screenshots or from downloading the displayed images on their hard disks with absolute reliability. But with the new image protection feature, it is considerably more difficult.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"common-library\" class=\"wysiwyg-text-align-justify\">Common Library</h2>\n<p class=\"wysiwyg-text-align-justify\">Customers with their server can have Tivian Support activate an installationwide library on the <strong>Common library</strong> tab.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Uploaded files are saved in the /images directory of the installation.</p>\n</li>\n<li>\n<p>It is possible to create subdirectories in /images.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please use the installation-wide media library economically. The following guiding values provide orientation:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>It is recommended to create not more than 250 folders.</p>\n</li>\n<li>\n<p>The folder structure should not be more than 10 levels deep.</p>\n</li>\n<li>\n<p>It is recommended to upload not more than 10,000 files.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"tivian-library\" class=\"wysiwyg-text-align-justify\">Tivian Library</h2>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.0, the Tivian library provides ready-made visuals, made available by Tivian for free. This includes, among others, a comprehensive repertoire of icons and other image files for the new question types. The Tivian library content is read-only: the used content will only be referenced in an effective, resource-saving manner instead of copying into the project.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_file_types\" class=\"wysiwyg-text-align-justify\">What file types can I upload to the Media Library?</h3>\n<p class=\"wysiwyg-text-align-justify\">You can upload various file types including images, SVG graphics, flash, and video formats such as RealVideo or Quicktime. For a detailed list of permitted file types, click on the <strong>Question mark</strong> icon in the <strong>Upload file</strong> dialog.</p>\n<h3 id=\"faq_file_size\" class=\"wysiwyg-text-align-justify\">Is there a file size limit for uploads?</h3>\n<p class=\"wysiwyg-text-align-justify\">The maximum file size is installation-specific. If you exceed the threshold value, a note will be displayed. You can use zip files to compress larger files or multiple files for easier uploading.</p>\n<h3 id=\"faq_image_protection\" class=\"wysiwyg-text-align-justify\">How effective is the image protection feature?</h3>\n<p class=\"wysiwyg-text-align-justify\">While the image protection feature makes it considerably more difficult for participants to take screenshots or download images, it cannot prevent these actions with absolute reliability due to technical limitations.</p>",
    "user_segment_ids": []
}