{
    "id": 20370668305810,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370668305810.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370668305810-Update-And-Change-Participant-Data",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:23:28Z",
    "updated_at": "2024-08-28T11:26:06Z",
    "name": "Update And Change Participant Data",
    "title": "Update And Change Participant Data",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T10:28:09Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides instructions on how to update and change participant data in the Participant administration system. It covers two main methods: using an updated template and making changes directly in the List of participants.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Learn how to efficiently update and modify participant information, including bulk editing capabilities for multiple participants simultaneously.</p>\n<ul>\n<li><a href=\"#updating-participant-data\">Updating Participant Data</a></li>\n<li><a href=\"#changing-participant-data\">Changing Participant Data</a></li>\n</ul>\n<h2 id=\"updating-participant-data\" class=\"wysiwyg-text-align-justify\">Updating Participant Data</h2>\n<p class=\"wysiwyg-text-align-justify\">If you wish to update participant data, download the update template in the <strong>Participant Administration</strong> menu. To do so, click on the <strong>Update Participant Data</strong> button and then on <strong>Download update template</strong>.</p>\n<h3 id=\"update-template\" class=\"wysiwyg-text-align-justify\">Update template</h3>\n<p class=\"wysiwyg-text-align-justify\">To assign the data that should be updated, you must fill in the <em>u_id</em> field of the template. To make sure you don't accidentally overwrite participant data, simply delete the columns you don't need for the update process. The existing data will also be overwritten if the column is not filled out.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017221297298\" alt=\"Update participant data.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">After filling in the template, you must select the corresponding file under the \"Source\" option and click the <strong>Send file</strong> button. After the successful transfer, the data will be updated.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017221296402\" alt=\"Upload file.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">To retrieve the User ID do the following: In the participant administration, click the <strong>View</strong> button. Activate the checkbox for <strong>User ID</strong>. To display the <strong>User ID</strong>, you need the <em>export-with_lfdn </em>right. If you would like to obtain this right, please contact our support team. Next, click the Excel export button. The Excel export will contain your participants, including the User ID.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"changing-participant-data\" class=\"wysiwyg-text-align-justify\">Changing Participant Data</h2>\n<p class=\"wysiwyg-text-align-justify\">If you wish to subsequently change or correct the data of a participant, you must first select the participant from the list of participants. With a large number of participants, this requires using the <strong>Search participant</strong> function. In the list of participants, the participant’s name will be displayed as a link you can click on to open the same entry form. Now you can change all required data and then transfer them to participant administration by clicking on <strong>Save</strong>.</p>\n<h3 id=\"bulk-editing-participant-data\" class=\"wysiwyg-text-align-justify\">Bulk Editing Participant Data</h3>\n<p class=\"wysiwyg-text-align-justify\">It is often the case that already uploaded participant data records need to be subsequently modified or extended. For example, titles used to personalize e-mails and questionnaires need to be changed (“Dr.” → “PhD” it turns out during evaluation that a variable necessary for a particular split has not been created and filled in in the participant administration (e.g. “customer type”). The “Bulk edit” feature allows you to realize such changes with reduced effort. If you limit the list of participants to the relevant data records (or at least to a subset) using appropriate search criteria, you can modify all these in a single step.</p>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To do so, switch to the Participant administration.</p>\n</li>\n<li>\n<p>Use Search participants to restrict the list of participants as far as possible to those participants affected by the change.</p>\n</li>\n<li>\n<p>Mark the participants to be changed.</p>\n</li>\n<li>\n<p>Select the “Bulk edit” action from the drop-down list.</p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Execute</strong>.</p>\n</li>\n<li>\n<p>The form where you can specify the desired change will be displayed. Select the variable to be changed and the value you want this variable to have after the change. In the given example, the value of the variable “u_group” is to be changed within the selected data records from 1 = Development to 5 = System administration as the employees have been transferred.</p>\n</li>\n<li>\n<p>Click on <strong>Preview</strong> to check the result.</p>\n</li>\n<li>\n<p>Check whether the change appears as you had planned it. If so, confirm by clicking on <strong>Save.</strong></p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_user_id\" class=\"wysiwyg-text-align-justify\">How do I retrieve the User ID?</h3>\n<p class=\"wysiwyg-text-align-justify\">To retrieve the User ID: 1. In the participant administration, click the <strong>View</strong> button.<br>2. Activate the checkbox for <strong>User ID</strong>.<br>3. Click the Excel export button.<br>4. The Excel export will contain your participants, including the User ID.<br>Note: You need the <em>export-with_lfdn</em> right to display the User ID. Contact support if you need this right.</p>\n<h3 id=\"faq_bulk_edit_example\" class=\"wysiwyg-text-align-justify\">Can you give an example of bulk editing?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, here's an example: You can change the value of the variable \"u_group\" from 1 = Development to 5 = System administration for selected data records if employees have been transferred to a different department.</p>",
    "user_segment_ids": []
}