{
    "id": 20370673054994,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370673054994.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370673054994-Layout-Templates",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:18:54Z",
    "updated_at": "2024-08-19T19:46:13Z",
    "name": "Layout Templates",
    "title": "Layout Templates",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T13:48:01Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides information about Layout Templates in EFS, including how to manage, import, export, and migrate layouts. It also covers the layout migration feature, which allows users to control when to apply the latest layout version to their projects.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Layout Templates in EFS offer various project layouts and ensure that live projects are not negatively impacted by changes to layout versions. This guide covers the Layout List, template management, and the Layout Migration feature.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<ul>\n<ul>\n<li><a href=\"#layout-list\">Layout List</a></li>\n<li><a href=\"#layout-migration\">Layout Migration</a></li>\n</ul>\n</ul>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"layout-list\" class=\"wysiwyg-text-align-justify\">Layout List</h2>\n<p class=\"wysiwyg-text-align-justify\">You can find a list of all existing templates available to you in the<strong> Layout Templates</strong> menu on the <strong>Layout List</strong> tab.</p>\n<h3 id=\"reset-to-system-layout\" class=\"wysiwyg-text-align-justify\">Reset to System Layout</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can easily reset the layout of your project to the initial state: Open the <strong>Layout templates </strong>menu and click on <strong>Reset to system layout</strong>.</p>\n</li>\n</ul>\n<h3 id=\"importe-template\" class=\"wysiwyg-text-align-justify\">Importe Template</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To use the exported layout template for a project in another <em>EFS</em> installation, select the respective project, and switch to the <strong>Layout </strong>→ <strong>Layout templates</strong> menu.</p>\n</li>\n<li>\n<p>Subsequently, select the <strong>Import template</strong> button.</p>\n</li>\n<li>\n<p>In the “File” field, you can enter the file path where the file you exported under the first step is located on your computer. Alternatively, you can also find and insert the file using the <strong>Browse</strong> button.</p>\n</li>\n<li>\n<p>If you wish to use your layout for the current project, tick the “Activate template” checkbox.</p>\n</li>\n<li>\n<p>Complete the work process by clicking on<strong> the Upload file</strong>.</p>\n</li>\n<li>\n<p>A green text bar containing the text “The template was successfully added” will inform you about the successful transfer of the template. On the <strong>Layout list</strong> tab, it will now also be available for all projects located on this second <em>EFS</em> installation. If you have decided to directly activate the template under Step 9, a second green text bar will report the successful activation.</p>\n</li>\n</ul>\n<h3 id=\"actions\" class=\"wysiwyg-text-align-justify\">Actions</h3>\n<p class=\"wysiwyg-text-align-justify\">Use the action icons to rename the <em>layout template</em>, <em>change rights</em>, <em>export the layout template</em>, and <em>delete the layout template.</em></p>\n<h4 id=\"exporting-the-template\" class=\"wysiwyg-text-align-justify\">Exporting the Template</h4>\n<p class=\"wysiwyg-text-align-justify\">You can transfer a layout template from one installation to another by exporting the template as a zip file and importing it into the destination installation.</p>\n<p class=\"wysiwyg-text-align-justify\">The work process required for this consists of three sections which are described below:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Saving the layout setting as a template</p>\n</li>\n<li>\n<p>Exporting the layout template from the original EFS installation</p>\n<ul>\n<li>\n<p>Switch to the <strong>Layout templates </strong>menu.</p>\n</li>\n<li>\n<p>Select the desired template from the <strong>Layout list </strong>tab and click on the <strong>Export </strong>icon.</p>\n</li>\n<li>\n<p>The “File Download” dialog will open. Check that “Save file to disk” is selected, and confirm by clicking on <strong>OK</strong>.</p>\n</li>\n<li>\n<p>In the window that will then open, select the folder on your hard disk to which you want to store the layout file, and specify the name of the file.</p>\n</li>\n<li>\n<p>The layout template will now be stored on your hard disk as a zip file. The export operation is completed.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Importing the layout template into another EFS installation</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.0, all layout settings are closely associated with the selected layout generation (“Responsive layout” or traditional system layout). When exporting a layout template, its layout generation will be transferred as well. I.e. on the target installation, the template will only be available for projects of the appropriate generation, too.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"layout-migration\" class=\"wysiwyg-text-align-justify\">Layout Migration</h2>\n<p class=\"wysiwyg-text-align-justify\">Sometimes we will make changes to a survey layout version to apply security updates, bug fixes, and enhancements. In the past these changes have been applied directly to the layout version and therefore all projects using that layout version. In some cases, this has led to issues with the project where local changes or customizations have not been compatible with the new version. From now on, any changes Tivian makes to a layout version will be introduced as a new layout version. For example, changes to Responsive Layout 3 included in this release will now be introduced as Responsive Layout 3.1.</p>\n<p class=\"wysiwyg-text-align-justify\">This means you can now control when you would like to apply the latest layout version to your live projects, for example, after the field phase has ended, using our <em>Layout migration</em> feature. It is also possible to revert projects to earlier layout versions, so should you have local changes in your project that are not compatible with the latest layout version you can simply migrate the project back to a previous version with which the project was compatible.</p>\n<p class=\"wysiwyg-text-align-justify\">It is possible to migrate a layout version to an earlier version or a later version within the same major version (e.g. moving between Responsive Layout 3 and 3.1) but not between major versions (e.g. you cannot migrate a survey’s layout from Responsive Layout 2 to Responsive Layout 3).</p>\n<p class=\"wysiwyg-text-align-justify\">Please note, that customized layouts are not automatically updated with a new version release, and custom question types are not automatically available in later versions (these must be manually updated to support a later layout version).</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_customized_layouts\" class=\"wysiwyg-text-align-justify\">Are customized layouts automatically updated with new version releases?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, customized layouts are not automatically updated with a new version release. Custom question types are also not automatically available in later versions and must be manually updated to support a later layout version.</p>\n<h3 id=\"faq_layout_generations\" class=\"wysiwyg-text-align-justify\">How are layout settings associated with layout generations?</h3>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.0, all layout settings are closely associated with the selected layout generation (\"Responsive layout\" or traditional system layout). When exporting a layout template, its layout generation will be transferred as well. This means that on the target installation, the template will only be available for projects of the appropriate generation.</p>",
    "user_segment_ids": []
}