{
    "id": 20371076859410,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371076859410.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371076859410-Mail-Report",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:48:18Z",
    "updated_at": "2024-08-19T19:56:44Z",
    "name": "Mail Report",
    "title": "Mail Report",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T10:01:55Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">The Mail Report is a feature in the survey menu that provides an overview of all emails sent during a survey. It helps manage large numbers of emails in bigger projects and offers various editing options for email dispatch processes.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This article explains the Mail Report feature, its functionality, and how to use it effectively for managing email and SMS communications in survey projects.</p>\n<ul>\n<li><a href=\"#e-mail\">E-mail</a></li>\n<li><a href=\"#sms\">SMS</a></li>\n<li><a href=\"#viewing-archived-mails\">Viewing Archived Mails</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Mail report</strong>, which is located in the survey menu, gives an overview of all e-mails that were sent during the survey. The <strong>Mail report</strong> is designed to assist you in properly managing the large numbers of e-mails needed for bigger projects. The mail report displays all mails in the outgoing queue, sorted by sending operations. You have the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>View</strong>: Allows you to display a mail that has been selected from the respective dispatch process at random with the wildcards replaced.</p>\n</li>\n<li>\n<p><strong>Release</strong>: Allows you to release and execute a dispatch process with “Hold” status.</p>\n</li>\n<li>\n<p><strong>Hold</strong>: The mail dispatch is interrupted, e.g. if a questionnaire requires re-editing.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: Mails are removed from the queue. In EFS Panel installations, this work process includes the option of saving the recipients of the deleted e-mails in a separate group.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you delete emails, our support team can no longer determine who has already received a mail and who has not in subsequent support requests.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"e-mail\" class=\"wysiwyg-text-align-justify\"><strong>E-mail</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Every time you send one or more e-mails from participant administration, an entry is made in the report. This enables you to subsequently check whether, for example, a certain group or individual has already received an e-mail. You may view the complete mail (with placeholders) by clicking on <strong>Mail</strong>. In the overview list, the following information is displayed for the different sending processes within the respective project:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Mailing: internal mailing ID. The link displayed will provide you with detailed information on the specific process.</p>\n</li>\n<li>\n<p>Subject: e-mail subject. The link displayed will provide you with detailed information on the specific process.</p>\n</li>\n<li>\n<p>User: user who performed the dispatch.</p>\n</li>\n<li>\n<p>Date: time and date of dispatch.</p>\n</li>\n<li>\n<p>Total: a total of all e-mails.</p>\n</li>\n<li>\n<p>Queued: a total of all e-mails generated for immediate or future dispatch. Queued emails may be held, resumed, or canceled.</p>\n</li>\n<li>\n<p>Sending: total of all e-mails delivered to the dispatching mailing server yet to be delivered to the respective recipient(s). Please note this process might take up to several days.</p>\n</li>\n<li>\n<p>Sent: The number of e-mails that were successfully delivered to the receiving mailing server.</p>\n</li>\n<li>\n<p>Rejected: a total of all e-mails rejected and classified as spam-mail.</p>\n</li>\n<li>\n<p>Delivery failed: a total of e-mails that could not be delivered due to trouble on the part of the recipient address.</p>\n</li>\n<li>\n<p>Not reachable: a total of all e-mails that could not be delivered because the recipient‘s address or the domain does not exist.</p>\n</li>\n<li>\n<p>Canceled: The number of e-mails canceled.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you click on the ID of a dispatch process in the “Mailing” column, you will see detailed information on all individual processes.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"sms\" class=\"wysiwyg-text-align-justify\">SMS</h2>\n<p class=\"wysiwyg-text-align-justify\">Every time you send one or more SMSes from participant administration, an entry is made in the report. This enables you to subsequently check whether, for example, a certain group or individual has already received an SMS You may view the complete mail (with placeholders) by clicking on the <strong>SMS</strong> tab.</p>\n<p class=\"wysiwyg-text-align-justify\">In the overview list, the following information is displayed for the different sending processes within the respective project:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Mailing: internal mailing ID. The link displayed will provide you with detailed information on the specific process.</p>\n</li>\n<li>\n<p>Subject: SMS subject. The link displayed will provide you with detailed information on the specific process.</p>\n</li>\n<li>\n<p>User: user who performed the dispatch.</p>\n</li>\n<li>\n<p>Date: time and date of dispatch.</p>\n</li>\n<li>\n<p>Total: a total of all SMSes.</p>\n</li>\n<li>\n<p>Queued: a total of all SMSes generated for immediate or future dispatch. Queued SMSes may be held, resumed, or canceled.</p>\n</li>\n<li>\n<p>Sending: total of all SMSes delivered to the dispatching mailing server yet to be delivered to the respective recipient(s). Please note this process might take up to several days.</p>\n</li>\n<li>\n<p>Sent: The number of SMSes that were successfully delivered to the receiving mailing server.</p>\n</li>\n<li>\n<p>Delivery failed: a total of SMSes could not be delivered due to trouble on the part of the recipient address.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you click on the ID of a dispatch process in the “Mailing” column, you will see detailed information on all individual processes.</p>\n<p class=\"wysiwyg-text-align-justify\">To send SMS notifications via EFS, you need the SMS Extension module.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"viewing-archived-mails\" class=\"wysiwyg-text-align-justify\">Viewing Archived Mails</h2>\n<p class=\"wysiwyg-text-align-justify\">Most of the emails sent from <em>EFS</em> are archived and can be viewed for six months:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Personalized surveys, employee surveys, multi-source feedback, panel surveys, and master data surveys feature an overview of all sent emails.</p>\n</li>\n<li>\n<p>In personalized surveys, employee surveys, and multi-source feedback, the mails are listed in the detailed view of the respective participant.</p>\n</li>\n<li>\n<p>In panel and master data surveys, the mails are listed on the Contacts by System mail tab in the detail view of the respective panelist.</p>\n</li>\n<li>\n<p>With the appropriate rights you can view all project-specific mail processes of the installation in a centralized manner</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the long run, the data volumes involved in the sending of emails will put an unnecessary strain on the installation’s performance. Once the project is over, the archived emails are usually not needed ever again. The mail archives will therefore be cleaned automatically at regular intervals: Archived mail will be deleted six months after dispatch (depending on the size of the installation this may be executed earlier).</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What happens if I delete emails from the queue?</h3>\n<p class=\"wysiwyg-text-align-justify\">If you delete emails, the support team can no longer determine who has already received a mail and who has not in subsequent support requests.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">How long are archived emails kept?</h3>\n<p class=\"wysiwyg-text-align-justify\">Archived emails are typically kept for six months after dispatch. However, depending on the size of the installation, they may be deleted earlier to maintain system performance.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">Do I need any special module to send SMS notifications?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, to send SMS notifications via EFS, you need the SMS Extension module.</p>",
    "user_segment_ids": []
}