{
    "id": 20371042970386,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371042970386.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371042970386-Test-and-Validation",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:47:38Z",
    "updated_at": "2024-08-28T11:27:29Z",
    "name": "Test and Validation",
    "title": "Test and Validation",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T09:53:33Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers various tools and methods for testing and validating surveys in EFS, including media checks, consistency checks, project tests, and project checks. It also explains how to reset a survey before launching it.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on the different features available in the Test and Validation menu of EFS, which help ensure the quality and functionality of surveys before they go live.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#media-check\">Media check</a></li>\n<li><a href=\"#consistency-check\">Consistency check</a></li>\n<li><a href=\"#project-test\">Project test</a></li>\n<li><a href=\"#project-check\">Project check</a></li>\n<li><a href=\"#reset-survey\">Reset survey</a></li>\n</ul>\n<h2 id=\"media-check\" class=\"wysiwyg-text-align-justify\">Media Check</h2>\n<p class=\"wysiwyg-text-align-justify\">Identifying problems with links to images and other media files is quite time-consuming, particularly for questionnaires that contain large numbers of images. The check functions located in the <strong>Test and Validation</strong> → <strong>Media check</strong> menu will make your work easier.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226457874\" alt=\"Media check.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">You can display either all media, only valid media, or only media that are not available. This process will check not only multimedia elements from the questionnaire but also buttons, layout elements, and images used in the templates. The display contains the following information for each media file:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>URL</p>\n</li>\n<li>\n<p>Preview</p>\n</li>\n<li>\n<p>Source element</p>\n</li>\n<li>\n<p>Context of use</p>\n</li>\n<li>\n<p>Media type</p>\n</li>\n<li>\n<p>Language: In the case of multilingual projects, this column contains the language of the questionnaire in which the file is used.</p>\n</li>\n<li>\n<p>Status: The traffic light icon indicates whether a media file is available or invalid.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Using the link in the “Actions” column, you are able to open the menus and edit the respective media file.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"consistency-check\" class=\"wysiwyg-text-align-justify\">Consistency check</h2>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Test and validation</strong> menu contains the <strong>Consistency check</strong> function. Clicking on this menu item will open an additional window with a codebook displaying the conditions for filters, hiding conditions, triggers, and plausibility checks and containing information on the consistency of the setting. Traffic-light icons will tell you whether the setting is consistent:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Green: The setting is consistent (i.e. all variables used exist in the project).</p>\n</li>\n<li>\n<p>Yellow: The yellow color is only used with filters. It indicates that the filter conditions are consistent but the filter has not yet been checked using the filter test.</p>\n</li>\n<li>\n<p>Red: The setting is not consistent (i.e., for example, it accesses variables that no longer exist).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The consistency check covers project variables (v_100n), user-defined variables (c_000n), and URL parameters (p_000n).</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"project-test\" class=\"wysiwyg-text-align-justify\">Project test</h2>\n<p class=\"wysiwyg-text-align-justify\">The<strong> Project test</strong> function, located in the <strong>Test and Validation</strong> menu, makes it easier for you to test the setting of the filter by automatically simulating a large number of test sessions. The resulting statistics make it easy to detect setting problems with filters and internal quotas. The following explains the usage options offered by this function:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Producing test data</p>\n</li>\n<li>\n<p>Interpreting test data</p>\n</li>\n<li>\n<p>Deleting test data</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017213593618\" alt=\"Project test.jpg\"></p>\n<h3 id=\"producing-test-data\" class=\"wysiwyg-text-align-justify\">Producing test data</h3>\n<p class=\"wysiwyg-text-align-justify\">After you have finished your questionnaire, open the <strong>Test and Validation</strong> → <strong>Project test</strong> menu. This will open the entry page of the <strong>Project test</strong> menu which provides an overview of the filters and variables used in the project. Click on the<strong> Produce test data</strong> tab and enter the conditions for the automatically generated<br>test runs:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the “Number of interviews to create” field, enter the number of questionnaire sessions that are to be automatically generated. The advisable number of sessions depends on the complexity of the project and the robustness of the server. On the one hand, high numbers of sessions (in the hundreds) deliver more meaningful results. On the other hand, projects with a complex filter structure can cause a considerable server load even with one hundred sessions. Before you enter a larger number of times participated, you should therefore make sure that there is no survey with a high number of participants running at the same time on the same installation.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017213590802\" alt=\"Bildschirmfoto 2021-09-14 um 09.51.16.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the second field, you can specify the “Maximum number of pages sent per session”. The number entered should be greater than 0.</p>\n</li>\n<li>\n<p>If the “Delete test data before execution?” option is enabled, data generated in preliminary test runs or automatically generated test participants are deleted.</p>\n</li>\n<li>\n<p>“Personalized survey” project type only: If the “Use copies of existing participants?” option is enabled, EFS will use existing participants, with disposition codes lower than 20, as template for creating new test participants and will loop sequentially through them until the specified amount of interviews has been created. This function allows you to test surveys, where e.g. filters and other conditions are accessing specific participant variables for routing.</p>\n</li>\n<li>\n<p>If the project contains numeric URL parameters, you can specify individual values or number ranges for them. Please note that “Project test” does not support nonnumeric URL parameters. With projects containing such parameters, a “Project test” must be run before the URL parameters are configured.</p>\n</li>\n<li>\n<p>If the project contains triggers, you can choose separately whether these may be activated during the project test. Before activating the trigger test function, make sure that this cannot inadvertently trigger infinite loops or the bulk dispatch of mails. Usually, however, a manual test is more advisable for checking the functionality of triggers than using the automatic project test.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Please note that EFS does not generate test data for the <em>User-defined (911)</em> question type and all other question types that are based on it, namely <em>Audio player (911), Video player (911), Slider (numbers) (911), and LUA question type (911)</em>.</p>\n<h3 id=\"routing-statistics\" class=\"wysiwyg-text-align-justify\">Routing statistics</h3>\n<p class=\"wysiwyg-text-align-justify\">The routing statistics are located on the <strong>Routing Statistics</strong> tab. The following guiding questions will help you to interpret them. After the test run, first check whether the number of sessions completed (disposition code 31, 32) equals the number of times participated you originally entered. To do so, open the<strong> Routing statistics</strong> tab and click on the <strong>Evaluate complete data records only</strong> link.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226462994\" alt=\"Routing.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If all sessions were completed successfully, you can limit your analysis to these statistics, labeled <strong>Evaluate completed data records</strong> only.</p>\n</li>\n<li>\n<p>If test sessions were interrupted as in the example shown, you should first identify the cause of the drop-outs. To do so, click on the <strong>Evaluate all data records</strong> link. Note that drop-outs do not necessarily indicate problems. In the example shown, for instance, the drop-outs are participants who were screened out after a quota was fulfilled.</p>\n</li>\n</ul>\n<h3 id=\"delete-test-data\" class=\"wysiwyg-text-align-justify\">Delete test data</h3>\n<p class=\"wysiwyg-text-align-justify\">The automatically generated data must be deleted if you have completed the evaluation of the routing statistics and field report. Otherwise, the data will be maintained and included in the next test session or even in the evaluation of the field phase, thus influencing the results. To do so, click on the <strong>Delete test data</strong> tab, and then confirm by clicking on <strong>Delete test data</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In projects with internal quotas, the test run will change the current allocation and the status of the quota under <strong>Questionnaire editor</strong> → <strong>Quotas</strong>. To reset the allocation to zero, the project must be newly compiled after completion of the test. For this, the “Reset survey completely” option must be selected</p>\n</li>\n<li>\n<p>If “Use copies of existing participants” was disabled for a test run in a personalized survey, then an automatically generated participant is automatically entered for each participant in the project’s participant administration. The test persons will then receive the e-mail address of the user who launched the test. You should delete these automatically generated persons and their test data before the project goes into the field phase. To do so click on the <strong>Delete test data</strong> tab, and then confirm by clicking on <strong>Delete test data</strong>.</p>\n</li>\n<li>\n<p>If in a test run in a personalized survey “Use existing participants” was enabled or if it is an employee survey, datasets of existing participants are used for the project test. This artificially generated test data must be deleted before the project enters the field phase. To do so, you can either apply the “Reset with data deletion” action to all participants in participant administration or compile the project anew (navigate to <strong>Projects</strong> → {Selected project} → <strong>Compile</strong> and select the “Reset survey completely” option).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"project-check\" class=\"wysiwyg-text-align-justify\">Project check</h2>\n<p class=\"wysiwyg-text-align-justify\">The project check informs you about the progress and faults made during project creation.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The upper part of the dialog contains an overview of central topics.</p>\n</li>\n<li>\n<p>Furthermore, questionnaire structure, filter conditions, timing etc. are checked for logical consistency. Potential problems are listed with the respective problem grade.</p>\n</li>\n<li>\n<p>The Project check or Check layout cannot be used for the “Responsive Layout”. The checks are optimized for the scope of the classic system layout.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017213595538\" alt=\"Project check.jpg\"></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\" data-table-width=\"760\">\n<colgroup> <col style=\"width: 325.0px;\"> <col style=\"width: 435.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Check</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Errors while processing the survey</p>\n</td>\n<td>\n<p><em>EFS</em> checks for errors in LUA filters, quotas, and triggers while processing the survey.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Current selected language</p>\n</td>\n<td>\n<p>Indicates the standard language.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>In multilingual projects: Translation status</p>\n</td>\n<td>\n<p>Indicates whether all of the text elements of the different survey languages have been filled and has a link to the overview of the To-dos.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Only for projects with classic system layout: Layout status</p>\n</td>\n<td>\n<p>Provides information on the correctness of the layouts in use.</p>\n<p>If the layout is no longer current, you have the option of clicking on the <strong>Check layout</strong> link to switch to the Pro editor, where you can fix the problem.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Number of variables in the survey table</p>\n</td>\n<td>\n<p>Several variables. The number may change when compiling the project.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"reset-survey\" class=\"wysiwyg-text-align-justify\">Reset survey</h2>\n<p class=\"wysiwyg-text-align-justify\">All data created e.g. by tests in productive mode must be deleted before the start of the survey. Open the <strong>Test and Validation → Reset survey</strong> menu. Select “...reset survey completely...” and click on Reset survey. Now the database is cleaned and all test data is deleted.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017213598738\" alt=\"Reset survey.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Complete resetting of a survey before starting into the field</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Before starting into the field, i.e. the start of the proper data collection phase, the survey is usually reset completely to clean various types of unwanted data from the database. For this purpose, the option “Reset survey completely and delete all survey data collected so far” is used.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Usually, projects are reset completely before starting into the field to remove any results created during the test phase. This is recommendable, in particular, if you have created real data records while testing an anonymous project or if you have used not only dedicated test accounts but true participant accounts when testing a personalized project.</p>\n</li>\n<li>\n<p>If superfluous questions or pages were created and deleted later, the variables of these questions or pages are kept in the database. When resetting prior to the field start, these superfluous variables are displayed and you can optionally delete them. They can also be used to restore data. In principle, it is no problem to keep superfluous variables in the database. But in big, complex projects this clean-up may improve the performance.</p>\n</li>\n<li>\n<p>If you have used the pretest feature, it is optionally possible to delete the comments as well.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Resetting in later stages</strong></p>\n<p class=\"wysiwyg-text-align-justify\">As soon as the survey is in the field, i.e. as soon as the data collection starts, <strong>the Reset feature should in principle not be used anymore</strong>. In exceptional situations, it may be necessary: then, you must use the option “Keep result data collected so far”.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Should anybody use “Reset survey completely and delete all survey data collected so far” by mistake in a running project, all results would be lost irrevocably!</p>\n</li>\n<li>\n<p>Variables that already contain information should not be deleted under any circumstances, too.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you need to reset the data records of specific participants, please use the dedicated actions in participant administration and the member list of samples.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Resetting test accounts in projects with participant administration or sample</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In personalized projects, the option “Delete test participants and their result data” can be used to selectively remove all participants flagged as testers and the respective result data. In panel surveys and master data surveys, survey status and result data of panelist test accounts will be reset, but the testers will remain in the sample.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What should I do if test sessions are interrupted during a Project Test?</h3>\n<p class=\"wysiwyg-text-align-justify\">If test sessions were interrupted, click on the \"Evaluate all data records\" link to identify the cause of the dropouts. Note that drop-outs don't always indicate problems; they might be due to fulfilled quotas or other intended screenouts.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I use the Project Check for Responsive Layout?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, the Project Check and Check Layout functions are not optimized for the Responsive Layout. These checks are designed for the classic system layout.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">What happens to internal quotas after a test run?</h3>\n<p class=\"wysiwyg-text-align-justify\">In projects with internal quotas, the test run will change the current allocation and status of the quota. To reset the allocation to zero, you must recompile the project after completing the test, selecting the \"Reset survey completely\" option.</p>",
    "user_segment_ids": []
}