{
    "id": 20371020592146,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371020592146.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371020592146-Org-Processor",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:45:26Z",
    "updated_at": "2024-08-28T10:01:55Z",
    "name": "Org Processor",
    "title": "Org Processor",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T14:21:16Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide to the Org Processor, a key element of EFS Employee software. It covers organizational structure management, user administration, configuration options, and various features for employee surveys.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The key element of <em>EFS Employee</em> is the <em>Org Processor</em>, which allows you to map your corporate structure in the software and to supplement it with all kinds of data required in the survey (e.g., position, and address data of the employees). Thus all these data become available for the survey process, i.e., it is possible, for example, to present your employees with questionnaires that are tailored to their respective role, or you can evaluate the survey results separately for each individual department. The Org Processor is activated by default in new employee surveys. It can be found in the <strong>Projects</strong> → {Selected project} → <strong>Org Processor</strong> menu. This guide explains how to use the Org Processor effectively, from setting up the organizational structure to managing users and configuring various options.</p>\n<ul>\n<li><a href=\"#organizational-structure\">Organizational structure</a></li>\n<li><a href=\"#org-processor-users\">Org Processor users</a></li>\n<li><a href=\"#configuration\">Configuration</a></li>\n<li><a href=\"#accessing-org-processor-data-in-condition-editor\">Accessing Org Processor Data in Condition Editor</a></li>\n</ul>\n<p> </p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"organizational-structure\" class=\"wysiwyg-text-align-justify\"><strong>Organizational structure</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">When you open the <em>Org Processor</em>, the <strong>Organizational Structure</strong> tab will be displayed automatically. It shows the organizational structure with the key characteristics of the units and forms the starting point for all subsequent work.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039443730\" alt=\"Organizational structure.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>By summing up the values for online participants and/or paper-pencil questionnaires and comparing them with the preset values you can easily check whether the stored data are correct.</p>\n</li>\n<li>\n<p>By clicking a unit in the organizational structure you can access all the data stored for this unit, i.e., properties such as name or process status, contacts, preset value, participant data, or requisition notes concerning paper-pencil questionnaires.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The data in the overview are updated every five minutes. If necessary, use the Update Participant Numbers icon to trigger an update manually.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing the view</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Above the organizational structure you will find four buttons with which you can change the display:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Expand all</strong>: All branches of the organizational structure are opened entirely so that you can see every unit. In large structures, this action requires considerable time: The auto-expansion feature described below presents a time-saving alternative. For very large structures, i.e. structures with 1,000 or more units, both features are hidden for performance reasons. Use the search function to find the desired units in such large structures!</p>\n</li>\n<li>\n<p><strong>Collapse all</strong>: All branches of the organizational structure are closed entirely. Only the topmost unit of the hierarchy remains visible.</p>\n</li>\n<li>\n<p><strong>Activate</strong> / <strong>Deactivate auto-expansion</strong>: This function makes sure that the respective branch is always completely expanded upon clicking. You no longer have to click every single node to see the whole branch in its entirety. This function is disabled again by clicking <strong>Deactivate auto-expansion</strong>. Please mind that auto-expansion is not available for very large structures, i.e. structures with 1,000 or more units, for performance reasons.</p>\n</li>\n<li>\n<p><strong>View</strong>: Clicking this button will open a dialog where you can activate or deactivate various table columns (except for the permanent columns “Short form of unit name” and “Actions”). After you have confirmed by clicking on <strong>Save settings</strong> the table will be modified accordingly.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Opening other structure views</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If several structure views are used, you will find a drop-down list above the menu where you can switch back and forth between the different structure views. As soon as you change the setting, the desired structure view will be displayed.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Searching for units</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Above the organizational structure, you will find a search function that allows you to browse the structure for a particular unit. This makes it much easier to locate units in complex organizational structures. Depending on the composition of the unit names, you can also use the search function to limit the display to groups of units. Please proceed as follows: Enter the name or part of the name of the desired unit in the field “Organizational unit” and trigger the search process by clicking on <strong>Search</strong>. The results show all units containing the search term, including their path upwards to the main unit (root unit) - i.e., all units one level up. To display all units again, you have to delete the entry in the text field and click on <strong>Search</strong> again.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The content of the organizational structure in detail</strong></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 262.0px;\"> <col style=\"width: 498.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Column heading</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Short form of the unit name</p>\n</td>\n<td>\n<p>Name of the respective unit.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Metaname</p>\n</td>\n<td>\n<p>Unique identifier of the unit.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Participants</p>\n</td>\n<td>\n<p>Employees of this unit completed the questionnaire online. This column is only visible for the survey types “Online survey” and “Hybrid survey”</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>The sum of the online participants</p>\n</td>\n<td>\n<p>Sum of the employees of this unit and all subunits completing the questionnaire online. This column is only visible for the survey types “Online survey” and “Hybrid survey”.</p>\n<p>Participants with disposition codes 13, 14, and 15 are included.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Paper-pencil questionnaires</p>\n</td>\n<td>\n<p>The number of paper-pencil questionnaires to be distributed in this unit. This column is only visible if either of the survey types “Paper-pencil survey” or “Hybrid survey” has been selected</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Sum of paper-pencil questionnaires</p>\n</td>\n<td>\n<p>The sum of the paper-pencil questionnaires to be distributed in this unit and all its subunits. This column is only visible if either of the survey types “Paper-pencil survey” or “Hybrid survey” has been selected.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>If adjustment of target figures is activated: Correction factor</p>\n</td>\n<td>\n<p>The direct correction factor, i.e. the value entered for this unit.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>If adjustment of target figures is activated: Correction factor abs.</p>\n</td>\n<td>\n<p>Aggregated correction factor, i.e. the sum of correction values for this unit and all its subunits.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>N</p>\n</td>\n<td>\n<p>Depending on the survey type chosen and the activation of target figure adjustment, this column contains the following sum:</p>\n<p>(aggregated target value paper-pencil questionnaire data) + (aggregated target value participant data) + (correction factor abs.)</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Staff (preset value)</p>\n</td>\n<td>\n<p>Preset number of employees of the respective unit to participate in the survey.</p>\n<p>This value is preset when creating the unit and serves to check the target numbers calculated based on the list of participants and the number of requested questionnaires.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Process status</p>\n</td>\n<td>\n<p>The icons help you to identify the process status of the units and potential problems at a glance:</p>\n<ul>\n<li>\n<p>A white F icon signals that a unit has been released for filtering. If a unit is actually used in a filter definition, the icon is lilac.</p>\n</li>\n<li>\n<p>The lock icon indicates whether the unit is still released for editing or is already locked.</p>\n</li>\n<li>\n<p>The traffic light icon indicates the editing status. The symbols have the following meanings:</p>\n</li>\n</ul>\n<p>Red: No preset number of employees has been defined yet, no participant data have been stored, and/or no paper-pencil questionnaires have been requested.</p>\n<p>Yellow: No participant data have been stored for the current unit and/or no paper-pencil questionnaires have been requested. The preset number has already been defined, though. Also, participant data have been stored, and/or paper-pencil questionnaires have been requested for the subunits.</p>\n<p>Green: The preset number of employees has been defined for the current unit, participant data have been stored and paper-pencil questionnaires have been requested.</p>\n<p>Exclamation point: The preset number of employees for this unit is considerably lower than the number of requested paper-pencil questionnaires or the number of registered participants.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Actions</p>\n</td>\n<td>\n<p>The icons and checkboxes in this column provide access to a variety of actions</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">The calculation of the sum of all participants in HR Reporting differs slightly from the Org Processor values. Participants with disposition codes 13, 14, and 15 are not included in this sum in the Org Processor but are included in HR reporting.</p>\n<h3 id=\"actions\" class=\"wysiwyg-text-align-justify\"><strong>Actions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">A variety of actions are available that can be applied to individual, selected, or all units of the organizational structure.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Actions for editing individual units</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following actions are used to edit individual units, e.g., to subsequently edit or to move units to another position. They are mostly used during the construction phase.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Edit</strong>: Opens the dialog with the data of the respective unit for subsequent editing.</p>\n</li>\n<li>\n<p><strong>Create unit</strong>: Opens the dialog where you can enter the data for a new unit. By default, this unit is created below the respective unit.</p>\n</li>\n<li>\n<p><strong>Export to Excel</strong>: Triggers the export of the respective unit and all subunits.</p>\n</li>\n<li>\n<p><strong>Import structure</strong>: Allows the import of new substructures under the respective unit.</p>\n</li>\n<li>\n<p><strong>Participants</strong>: Opens the <strong>Participants</strong> tab in the detailed view of the respective unit.</p>\n</li>\n<li>\n<p><strong>Move up</strong> / <strong>down</strong>: Moves the respective unit and all its subunits up or down one position in its branch. Please note that this will merely modify the display while the structure remains unchanged.</p>\n</li>\n<li>\n<p><strong>Adjust target figure</strong>: You can define a correction value that will be applied to the aggregated participant numbers of the respective unit.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: This option allows you to delete the respective unit while moving any existing participant data or subunits to another position.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">These actions are located in a layer that opens when you click on the <strong>Actions</strong> icon.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Actions for editing all or selected units</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following actions can be applied to selected or all units. They serve primarily for process control, e.g., for locking units against further editing or for sending e-mails to users<strong>.</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Lock units: With this action, you can protect units against further editing.</p>\n</li>\n<li>\n<p>Lock units and subunits.</p>\n</li>\n<li>\n<p>Release units: With this action, you can undo the locking of units.</p>\n</li>\n<li>\n<p>Release units and subunits.</p>\n</li>\n<li>\n<p>Mail users.</p>\n</li>\n<li>\n<p>Mail users of the selected unit and its subunits.</p>\n</li>\n<li>\n<p>Release units for filtering: Allows access to these units from the condition editor when defining filters and hiding conditions.</p>\n</li>\n<li>\n<p>Revoke filter release for units: Deactivates access to these units from the condition editor.</p>\n</li>\n<li>\n<p>Delete units: This action allows you to delete several units en bloc if these do not yet contain any participant data or subunits.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">These actions can be found in the drop-down list below the organizational structure. Select the desired units by ticking the checkboxes in the “Actions” column or via the checkbox “Apply action to the whole organizational structure”. Then specify the desired action and confirm by clicking on <strong>Execute</strong>.</p>\n<h3 id=\"detail-view\" class=\"wysiwyg-text-align-justify\"><strong>Detail view</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">By clicking on a unit in the organizational structure you open its corresponding detail view. The detail view contains all the data stored for the unit, arranged on various tabs.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Status information</strong>: This tab contains the following information and functions:</p>\n<ul>\n<li>\n<p>Name, short form of name, and meta name of the unit. These data can be edited on the <strong>Edit unit</strong> tab.</p>\n</li>\n<li>\n<p>Buttons for locking and releasing the unit or its subunits for editing.</p>\n</li>\n<li>\n<p>Data that indicate the status of the survey for the unit and its subunits.</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Edit unit</strong>: On this tab, you can subsequently edit basic properties of the unit such as name, meta name, or preset number of staff.</p>\n</li>\n<li>\n<p><strong>Text elements</strong>: Unit-specific Org Processor data, such as names and other unit properties, can be inserted into the questionnaire using wildcards. On this tab, the desired data - and in multilingual surveys, their translation - are entered.</p>\n</li>\n<li>\n<p><strong>Participants</strong>: On this tab, you create and manage the survey participants of the unit.</p>\n</li>\n<li>\n<p><strong>User management</strong>: On this tab, you can view the responsible persons of the unit or define new responsible persons.</p>\n</li>\n<li>\n<p><strong>Paper-pencil questionnaires</strong>: If the logistics functions of EFS Employees are activated, you can register your paper-pencil questionnaire requirements or view already existing requisition notes.</p>\n</li>\n<li>\n<p><strong>Import structure</strong>: The import dialog on this tab allows the import of new substructures under the current unit.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The tabs of the detail view provide access to a wide range of data and functions. You will find detailed explanations in the respective chapters mentioned above.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>View</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the <strong>Show Tree view</strong> button you can have the tree view displayed for better orientation. The current unit will be marked with a red arrow. To hide the tree view again, simply click on<strong> Hide tree view</strong>. The <strong>arrow</strong> icons allow you to switch to the units located directly above or below the current unit in the tree.</p>\n<h3 id=\"manually-building-the-organizational-structure\" class=\"wysiwyg-text-align-justify\"><strong>Manually building the organizational structure</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The organizational structure in the <em>Org Processor</em> is created top-down, i.e., starting with the topmost unit, the entire corporation, and the corporate structure is mapped down to the smallest unit (depending on the desired level of detail). The organizational structure can either be built up manually, created by import, or<br>created by a combination of both manual build-up and import. The manual build-up of organizational structures may be rather time-consuming but also offers valuable insight into how to store which data. This will improve your understanding of the import process and facilitate any subsequent manual editing.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to create units, you need to assign the right<em> structure_add_del_nodes</em> to the appropriate roles.</p>\n<p class=\"wysiwyg-text-align-justify\">Up to 40,000 units can be created in a project. But please keep in mind that very complex structures are confusing and difficult to navigate. Also, server performance is negatively affected by very large structures.</p>\n<h3 id=\"creating-units\" class=\"wysiwyg-text-align-justify\"><strong>Creating units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To create a new unit, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the dialog for creating a new unit. There are two ways to do this:</p>\n<ul>\n<li>\n<p>By clicking on the <strong>Create unit</strong> button you can invoke the dialog directly. If the organizational structure is still empty, then this is how you create the main unit (root unit).</p>\n</li>\n<li>\n<p>Look for the unit in the organizational structure below which you want to create the new unit. Click on the <strong>Actions</strong> icon to open the selection layer and then click on the link <strong>Create unit</strong>. This approach has the advantage that the correct unit one level up will automatically be preset in the edit dialog.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Enter the required data</p>\n<ul>\n<li>\n<p>Name of unit: Name of the respective unit</p>\n</li>\n<li>\n<p>Short form of unit name: Name of the respective organizational unit as it is to be displayed in the organizational structure. For greater clarity, a shortened form of the actual name is usually used.</p>\n</li>\n<li>\n<p>Meta name: Unique identifier of the unit. The meta name may contain only the following characters: a-z, A-Z, 0-9, \"_\", \"-\"</p>\n</li>\n<li>\n<p>Parent unit: In this field, you specify the parent unit. If you have opened the dialog via the <strong>Actions</strong> layer, the correct unit should be preset automatically. If you have used the <strong>Create Unit</strong> button, you may have to specify the correct unit first. Clicking on the <strong>binoculars</strong> icon will open a list of all organizational units.</p>\n</li>\n<li>\n<p>Staff (preset value): Preset number of employees for this unit.</p>\n</li>\n<li>\n<p>Permit allocation to units in the questionnaire: Activate this action if participants are to be able to allocate themselves to the units.</p>\n</li>\n<li>\n<p>Create another unit afterward: Activate this option if you wish to manually create further units. Upon saving, the dialog for creating units will open again automatically.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Click on<strong> Save</strong>.</p>\n</li>\n<li>\n<p>After <strong>Saving</strong> the unit, switch back to the overview by clicking on the link <strong>Back to organizational structure</strong>. You will see the new unit in the Organizational structure.</p>\n</li>\n</ul>\n<h3 id=\"importing-an-organizational-structure\" class=\"wysiwyg-text-align-justify\"><strong>Importing an organizational structure</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Instead of manually building the structure you can also import the entire structure or parts of it using a CSV or Excel file.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Do not start preparing the import before you have created all the required structure variables.</p>\n</li>\n<li>\n<p>The organizational structure may have any number of levels.</p>\n</li>\n<li>\n<p>When using Excel, you have to observe the following restrictions due to the specifications of the manufacturer:</p>\n<ul>\n<li>\n<p>Only the first sheet of the file will be processed. The maximum number of 256 columns and the maximum number of 65,000 rows should not be exceeded. If you require more columns or rows, choose another program and save the import file in CSV format.</p>\n</li>\n<li>\n<p>When using very large numbers as meta names, please note the following: Depending on the operating system, large numbers may be stored as<br>exponential numbers in Excel. When importing, EFS will adopt these exponential numbers as the meta names. You can easily avoid this problem by saving your Excel table in CSV format and then importing this CSV file.</p>\n</li>\n<li>\n<p>Excel import is only possible when using files created or stored with Excel 97+. Excel files that have been created or stored with “Excel for Mac”, “Neo Office”, or “Numbers” cannot be imported as a matter of principle.</p>\n</li>\n<li>\n<p>The file format XLSX, newly introduced by Microsoft with Office 2007, is not supported by EFS. Please save your files as XLS files before starting the import process.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to import structures, you need to assign the right <em>structure_import</em> to the appropriate roles.</p>\n<h3 id=\"import-process-in-detail\" class=\"wysiwyg-text-align-justify\"><strong>Import process in detail</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><strong>Download import template</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Open the import dialog. There are three different methods to choose from:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If there is no organizational structure yet, use the<strong> Import structure</strong> button. The illustrations in this chapter show such a complete import.</p>\n</li>\n<li>\n<p>Otherwise, you need to locate the reference unit within the organizational structure, i.e., the unit under which to import the new structural portion. Open the<strong> Actions</strong> layer and click on the link <strong>Import structure</strong>.</p>\n</li>\n<li>\n<p>If you are already in the detail view of the unit under which to import the new structural portion, open the <strong>Import Structure</strong> tab.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For each import format, i.e. level import and connected list, there is an already preformatted import template available, containing all the required columns. This<br>template can be downloaded by clicking on the Import template “Level import” or Import template “Connected list” respectively. The illustrations in this chapter show a level of import.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Format the import file</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Open the file in a suitable program, e.g., in Excel.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Enter the data.</p>\n</li>\n<li>\n<p>Save the file in Excel or CSV format.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Match the fields of the import file with the database fields</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Again, open the import dialog.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you import into an already existing structure instead of performing a complete import, the field “Update existing structure data” will be displayed. Tick this checkbox if you wish to perform an update.</p>\n</li>\n<li>\n<p>Select the appropriate character set.</p>\n</li>\n<li>\n<p>Use the <strong>Browse</strong> function to select the import file on your PC.</p>\n</li>\n<li>\n<p>Make sure that the checkbox in the field “First row includes column labels” is ticked or unticked accordingly. Usually, it should be ticked.</p>\n</li>\n<li>\n<p>If your import file is formatted as a “Connected list”, activate the checkbox.</p>\n</li>\n<li>\n<p>Automatically generate meta name prefixes: If you are importing an already existing structure, you can modify the meta names and render them unique by entering a prefix in this field. This can be helpful when two subareas of a company have identical substructures which are duplicated by export and import.</p>\n</li>\n<li>\n<p>To start the import process click on <strong>Send file</strong>.</p>\n</li>\n<li>\n<p>In the next step, the columns of the import file have to be matched to appropriate fields of the database. If you have retained the column labels as recommended, then the software will perform the allocation automatically.</p>\n</li>\n<li>\n<p>After checking the allocation, confirm by clicking on <strong>Open Preview</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Check the import data in the preview</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The import preview shows all data records as they are imported into the project.  This step allows you to subsequently change data with the aid of the following new information and edit options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Status</strong>: The traffic light icon in the “Status” column tells you whether the data record is complete and logically coherent. A red icon indicates an error. Move your mouse pointer over the icon to display the reason for this error.</p>\n</li>\n<li>\n<p><strong>Edit</strong>: By clicking on this actions icon you can open a dialog to subsequently change the respective data record.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: The respective data record will be deleted after a confirmation prompt.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Perform the import and download the results</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you are satisfied with your data in the preview, click on<strong> Import</strong> to trigger the actual import process. Following the completion of the import process, the program will indicate how many data records were successfully created and how many were not created due to certain problems. An Excel file containing the following information can be downloaded by clicking on the<strong> Download results</strong> button:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>all the data in the import file</p>\n</li>\n<li>\n<p>The “result” column contains the result of the import, i.e., either the message “Data record import successful” or “Data record not imported”.</p>\n</li>\n<li>\n<p>If any problems occur, the reason will be indicated in the “messages” column.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If necessary, you can correct the data records that were not successfully created directly in this file, delete the successfully created data records, and then use the file again for a new import attempt.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Columns of the import file</strong></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 164.0px;\"> <col style=\"width: 142.0px;\"> <col style=\"width: 239.0px;\"> <col style=\"width: 99.0px;\"> <col style=\"width: 116.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Column</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Label</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Explanation</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Data type</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Size</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>metaname</p>\n</td>\n<td>\n<p>Meta name</p>\n</td>\n<td>\n<p>Unique identifier of the unit. The meta name may contain only the following<br>characters: a-z, A-Z, 0-9, \"_\", \"-\"</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>65,536 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>label</p>\n</td>\n<td>\n<p>Short form of the unit name</p>\n</td>\n<td>\n<p>Name of the respective organizational unit as it is to be displayed in the organizational structure. For greater clarity, a shortened form of the actual name is usually used.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>256 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>label_extern</p>\n</td>\n<td>\n<p>Name of unit</p>\n</td>\n<td>\n<p>Name of the unit</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>256 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>level_1, level_2,...level_12</p>\n</td>\n<td>\n<ul>\n<li>\n<p> </p>\n</li>\n</ul>\n</td>\n<td>\n<p>Levels of the organizational structure.</p>\n<p>The short form of the unit described in the respective row is always entered in the<br>column corresponding to the level of the unit relative to the reference unit.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>65,536 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>status</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Process status. Indicates whether the unit is released or locked.</p>\n<p>Available options are:</p>\n<ul>\n<li>\n<p>0: Unit is released, i.e., it can be edited.</p>\n</li>\n<li>\n<p>1: Unit is locked.</p>\n</li>\n</ul>\n</td>\n<td>\n<p>Checkbox</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>co_target</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>Preset number of employees for this unit.</p>\n</td>\n<td>\n<p>int(11)</p>\n</td>\n<td>\n<p>max 2,147,483,647</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>visible</p>\n</td>\n<td>\n<p>Permit allocation<br>to unit in the<br>questionnaire</p>\n</td>\n<td>\n<p>This variable is only relevant in combination with the special programming for self-allocation. It specifies whether a<br>participant who is allowed to allocate himself may view and select the respective unit in the questionnaire. Available options are:</p>\n<ul>\n<li>\n<p>0: Unit is not offered.</p>\n</li>\n<li>\n<p>1: Unit is offered.</p>\n</li>\n</ul>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>historic_code</p>\n</td>\n<td>\n<p>Comparison unit of the preceding year</p>\n</td>\n<td>\n<p>In the past, the code of the comparison unit from the previous survey was stored in this variable. The meta names are used to identify comparison units</p>\n</td>\n<td>\n<p>int(11)</p>\n</td>\n<td>\n<p>max<br>2,147,483,647</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>hide_unit</p>\n</td>\n<td>\n<p>Hide unit in questionnaire (including subunits)</p>\n</td>\n<td>\n<p>This variable is only relevant in combination with the selfallocation. It<br>specifies whether a participant who is allowed to allocate himself may see the respective unit and its subunits in the questionnaire. Available options are:</p>\n<ul>\n<li>\n<p>0: The unit including its subunits is displayed.</p>\n</li>\n<li>\n<p>1: The unit including its subunits is hidden.</p>\n</li>\n</ul>\n</td>\n<td>\n<p>Checkbox</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"formatting-of-the-import-file-in-detail-connected-list\" class=\"wysiwyg-text-align-justify\"><strong>Formatting of the import file in detail: Connected List</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can export and if necessary, externally edit and reimport the organizational structure or parts thereof. This can be useful in various situations:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You want to check the stored structures and/or numbers or relay these data to third parties for verification.</p>\n</li>\n<li>\n<p>You want to change the names of the units or update already stored numerical values in an already existing structure.</p>\n</li>\n<li>\n<p>You want to reuse parts of the organizational structure elsewhere in the same project. If, for example, two departments have the same or very similar<br>substructures, then you can export the completed substructure of the first department, adjust the names and values for the second department in the export file, and subsequently import it into this second department.</p>\n</li>\n<li>\n<p>You want to reuse the entire organizational structure or parts thereof in another project (e.g., in an intermediate survey).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Please note: Via import you can insert new substructures in already existing structures, change the names of existing units, or update stored numbers. It is not possible, however, to move, merge, or delete existing units via import.</p>\n<h3 id=\"exporting-modifying-and-reimporting-an-existing-structure\" class=\"wysiwyg-text-align-justify\"><strong>Exporting, modifying, and reimporting an existing structure</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you want to modify a structure or parts thereof and reuse it elsewhere in the project, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You want to check the stored structures and/or numbers or relay these data to third parties for verification.</p>\n</li>\n<li>\n<p>You want to change the names of the units or update already stored numerical values in an already existing structure.</p>\n</li>\n<li>\n<p>You want to reuse parts of the organizational structure elsewhere in the same project. If, for example, two departments have the same or very similar substructures, then you can export the completed substructure of the first department, adjust the names and values for the second department in the export file, and subsequently import it into this second department.</p>\n</li>\n<li>\n<p>You want to reuse the entire organizational structure or parts thereof in another project (e.g., in an intermediate survey).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Via import, you can insert new substructures in already existing structures, change the names of existing units, or update stored numbers. It is not possible, however, to move, merge, or delete existing units via import.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to export return data, you need to assign the right <em>structure_export</em> and/or <em>structure_export_full</em> to the appropriate roles</p>\n<h3 id=\"exporting-modifying-and-reimporting-an-existing-structure-1\" class=\"wysiwyg-text-align-justify\"><strong>Exporting, modifying, and reimporting an existing structure</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you want to modify a structure or parts thereof and reuse it elsewhere in the project, please proceed as follows:</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the desired unit in the organizational structure. Click on the <strong>Actions</strong> icon to open the selection layer and then click on the link <strong>Export to Excel</strong>.</p>\n</li>\n<li>\n<p>Specify the extent of the export data record. The following options are available:</p>\n<ul>\n<li>\n<p>Standard export</p>\n</li>\n<li>\n<p>Standard export and user-defined variables: If you have created additional structure variables (see Chapter 4.4, p. 56), this option may be useful.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Select the character set.</p>\n</li>\n<li>\n<p>Trigger the export process by clicking on <strong>Send</strong>.</p>\n</li>\n<li>\n<p>Save the Excel file to your PC.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If an Excel file is opened on a computer running with Windows 7 and Excel 2007, depending on the circumstances, a message may be displayed that notifies you that the file is corrupted. This problem is caused by an extension provided by a third party supplier. Until further notice, please proceed as follows: Save the file locally. Then, open the saved file, allowing Excel to repair it. Finally, save the file again.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing the export file</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Edit the export file. Please pay special attention to the following:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The second row, directly under the column labels, contains the reference unit, i.e., the unit under which the new structure is to be imported.</p>\n</li>\n<li>\n<p>The levels are indicated in relation to this reference unit.</p>\n</li>\n<li>\n<p>If you duplicate an already existing substructure in the same project, e.g. in another department or in another structure view, you have to change the meta names. If you do not want to change each meta name by hand, you can use the option “Automatically generate meta name prefixes” when reimporting.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Importing</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Locate the reference unit in the organizational structure, i.e., the unit under which the structure is to be imported. Click on the<strong> Actions</strong> icon to open the selection layer and then click on the link<strong> Import structure</strong>.</p>\n<h3 id=\"using-the-import-function-for-updating-values-in-an-existing-structure\" class=\"wysiwyg-text-align-justify\"><strong>Using the import function for updating values in an existing structure</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you only wish to update an existing (sub-)structure, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Export the (sub-)structure as described above.</p>\n</li>\n<li>\n<p>Update the desired data in the export file.</p>\n</li>\n<li>\n<p>Afterward, import the (sub-)structure again under the same parent unit. The option “Update existing structure data” in the import dialog has to be activated during the import process.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The existing structure will now be updated with the contents of the import file. Units that were not part of the existing structure before will be newly inserted. The structure of existing nodes remains unchanged.</p>\n<p class=\"wysiwyg-text-align-justify\">If you do not tick the option “Update existing structure data”, the entire import structure will be newly inserted under the specified reference unit as described above in Chapter 4.9.2, p. 80. If there have been units already, they will be newly created nonetheless and automatically assigned new system-generated meta names.</p>\n<h3 id=\"subsequently-editing-units\" class=\"wysiwyg-text-align-justify\"><strong>Subsequently editing units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Frequently, stored data need to be subsequently edited due to changing numbers of participants or changed structures in certain business areas, for example. So long as the units have not been locked for editing by the project management or a higher-level responsible person, this can be done without difficulty. You have the following options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can reopen the edit dialogs and change data in there.</p>\n</li>\n<li>\n<p>You can move units to another position within the structure.</p>\n</li>\n<li>\n<p>You can merge units.</p>\n</li>\n<li>\n<p>You can delete units.</p>\n</li>\n</ul>\n<h3 id=\"changing-data-of-a-unit\" class=\"wysiwyg-text-align-justify\"><strong>Changing data of a unit</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can subsequently change the data of a unit. There are two ways to open the editing dialogs above:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the desired unit in the organizational structure. Click on the <strong>Actions</strong> icon to open the selection layer and then click on the link <strong>Edit</strong>. This opens the detailed view of the unit. The<strong> Edit</strong> <strong>unit</strong> tab with the dialog is displayed automatically. If you want to edit data on another tab, click on that tab.</p>\n</li>\n<li>\n<p>Locate the desired unit in the organizational structure and click on the title. The detail view is opened, and the <strong>Status information</strong> tab is displayed automatically. Switch to the desired tab.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to edit units subsequently, you need to assign the right <em>structure_edit_node</em> to the appropriate roles</p>\n<h3 id=\"moving-units\" class=\"wysiwyg-text-align-justify\"><strong>Moving units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">It may be necessary to move individual units or entire structures within the organizational structure. This is the case, for example, when certain parts of the company have been restructured and the structure needs to be updated accordingly. Instead of deleting the entire affected structure and recreating it elsewhere, you can also move it.</p>\n<p class=\"wysiwyg-text-align-justify\">There are two functions for moving files:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>the function described here allows you to move a unit under another parent unit, i.e., you modify the structure.</p>\n</li>\n<li>\n<p>with the “move up / down” function in the <strong>Actions</strong> layer you merely change the order in which the units of a branch are displayed in the organizational structure.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the unit you want to move to another position along with its subunits.</p>\n</li>\n<li>\n<p>Click on the title of the unit to open its detail view and select the <strong>Edit Unit</strong> tab.</p>\n</li>\n<li>\n<p>This takes you to the dialog. In the field “Parent unit” you can select another parent unit. To do so, click on the<strong> binoculars</strong> icon.</p>\n</li>\n<li>\n<p>This prompts a list of all available units. Browse this list and select the desired new parent unit by clicking on <strong>Select</strong>.</p>\n</li>\n<li>\n<p>Confirm by clicking on Save.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If there is no <strong>Select</strong> icon displayed next to a unit, this is usually because it is either the current unit or the currently assigned parent unit.</p>\n<h3 id=\"merging-units\" class=\"wysiwyg-text-align-justify\"><strong>Merging units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">It may be necessary to merge units. This is the case, for example, if parts of a company have been restructured or if, for logistical reasons, a particular department along with its subdepartments is to be mapped as one single unit. The function <strong>Merge units</strong> allow you to perform two actions in one step: The already existing participants and paper-pencil questionnaire data of the source unit are imported into the target unit and the source unit is then deleted. If the source unit consists of further subunits, then you can either move the contents of these subunits into the target unit as well, subsequently deleting the subunits, or adopt the subunits unchanged into the target unit.</p>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Merge Units</strong> button.</p>\n</li>\n<li>\n<p>Select the target unit, i.e., the unit where you want to move the contents of the source unit.</p>\n</li>\n<li>\n<p>Select the source unit, i.e., the unit the contents of which are to be moved or that is to be deleted itself.</p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Save</strong>.</p>\n</li>\n<li>\n<p>In case the source units have subunits, there are two options:</p>\n<ul>\n<li>\n<p>Merge units: The online participants and paper-pencil questionnaire data of the subunits are moved to the target unit, and the subunits themselves are deleted. The users of the subunits are not adopted.</p>\n</li>\n<li>\n<p>Move units: The subunits complete with online participants, paper-pencil questionnaire data, and users are moved below the target unit.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Confirm again by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to merge units, you need to assign the right <em>structure_combine_nodes</em> to the appropriate roles.</p>\n<p class=\"wysiwyg-text-align-justify\">The users of the source unit are not adopted in the merging process.</p>\n<h3 id=\"deleting-units\" class=\"wysiwyg-text-align-justify\"><strong>Deleting units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Units can be deleted, for example, if they have been created inadvertently or if the corporate structure has changed and needs to be mapped accordingly. There are two ways to do this, depending on whether you want to delete one or several units and whether these are units with participants and/or subunits:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can delete these units individually and, if necessary, move existing participants, paper-pencil questionnaires, and subunits.</p>\n</li>\n<li>\n<p>If you have to delete several units, you can delete them en bloc. Any existing subunits or requisition notes for paper-pencil questionnaires will be deleted as well. Participants will not be deleted, but the allocation to the deleted unit is lost.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Deleting a unit, but moving subunits and participant data</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you wish to delete a unit without losing any already existing participant data, paperpencil questionnaire data, and/or subunits, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the desired unit in the organizational structure. Click on the <strong>Actions</strong> icon to open the selection layer and then click on the link <strong>Delete</strong>.</p>\n</li>\n<li>\n<p>If the unit contains subunits and/or if participants have already been entered for the online questionnaire, you will be asked how the data is to be handled:</p>\n<ul>\n<li>\n<p>If you want to move the participants and the paper-pencil questionnaire data of the current unit, then select the desired target unit in the field “Move the participants of the unit to”.</p>\n</li>\n<li>\n<p>If you do not want to delete the subunits, then leave the checkbox in the field “Delete subunits” unticked. The subunits with their participants will be moved under the next higher unit.</p>\n</li>\n<li>\n<p>If you tick the checkbox “Delete subunits”, the subunits will be deleted and their participants will either be assigned to the specified target unit or also deleted, depending on the setting for the option “Move the participants of the unit to”.</p>\n</li>\n<li>\n<p>The default setting is “Delete assigned participants” and the option “Delete subunits” is deactivated, i.e., the subunits and their participants are moved under the next higher unit.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Delete unit now</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Deleting several units en bloc</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can easily delete several units en bloc. Any existing subunits or requisition notes for paper-pencil questionnaires will be deleted as well. Participants are not deleted, but the allocation to the deleted unit is lost.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the units to be deleted in the organizational structure and tick the checkboxes in the “Actions” column.</p>\n</li>\n<li>\n<p>Select the “Delete unit” action from the drop-down list.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to delete units, you need to assign the right <em>structure_add_del_nodes</em> to the appropriate roles.</p>\n<h3 id=\"locking-units-after-finishing\" class=\"wysiwyg-text-align-justify\"><strong>Locking units after finishing</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Units, subareas, or the entire structure can be locked, i.e., the units in the organizational structure are then clickable and it is no longer possible to view the data or to edit the locked area. This locking is usually done at the end of the preparation stage: It allows for the checking of the structure and the stored data without anybody changing any values in the background.</p>\n<h3 id=\"locking-units\" class=\"wysiwyg-text-align-justify\"><strong>Locking units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">There are two options, depending on whether you want to lock one or several units with or without subunits:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the desired unit in the organizational structure and click on the title. This opens the detailed view of the unit. The <strong>Status information</strong> tab is displayed automatically. Select the appropriate button in the section “Locking and releasing units”. Available options are:</p>\n<ul>\n<li>\n<p>Lock current unit: Locks the current unit, but not the subunits.</p>\n</li>\n<li>\n<p>Lock subunits: Does not lock the current unit, but its subunits.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Locate the units to be locked in the organizational structure and tick the checkboxes in the “Actions” column. Select either the action “Lock units” or “Lock units and subunits” from the drop-down list. Confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to lock units, you need to assign the right <em>structure_lock</em> to the appropriate roles</p>\n<h3 id=\"releasing-locked-units\" class=\"wysiwyg-text-align-justify\"><strong>Releasing locked units</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To re-release locked units, you need to proceed exactly as described above, except for choosing different actions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the desired unit in the organizational structure and click on the title. This opens the detailed view of the unit. The <strong>Status information</strong> tab  is displayed automatically, however, in the case of locked units and/or subunits there are different buttons in the section “Locking and releasing units”:</p>\n<ul>\n<li>\n<p>Release current unit: Releases the current unit, but not the subunits.</p>\n</li>\n<li>\n<p>Release subunits: Does not release the current unit, but its subunits.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Locate the units to be released in the organizational structure and tick the checkboxes in the “Actions” column. Select either the action “Release units” or<br>“Release units and subunits” from the drop-down list. Confirm by clicking on<strong> Execute</strong>.</p>\n</li>\n</ul>\n<h3 id=\"return\" class=\"wysiwyg-text-align-justify\"><strong>Return</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Your users can open the Return tab only if it has been activated for their role in the current phase. In order to allow your users to open not only their respective units but also the corresponding subunits, and to access the return data, you need to activate the right <em>structure_view_down</em> for the appropriate roles. The return view is located on the <strong>Return</strong> tab of the <em>Org Processor</em>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The organizational structure gives an overview of the return rates.</p>\n</li>\n<li>\n<p>In the detail view, you will find detailed data on the return of online and paperpencil questionnaires for the respective unit and their subunits. Additionally, you can access the user management of the unit from the detail view.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Above the organizational structure you will find the same features for modifying the display that you are already familiar with from the<strong> Organizational structure</strong> tab:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Selection of the structure view, Search, <strong>Expand all</strong> / <strong>Collapse all</strong>, <strong>Activate auto-expansion</strong>, and <strong>View</strong>.</p>\n</li>\n<li>\n<p>The data in the return overview are updated every five minutes. If necessary, use the <strong>Update Participant Numbers</strong> icon to trigger an update manually.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can define a special anonymity criterion for the return. As long as a unit and/or its subunits do not satisfy this criterion, some or all data for this unit and/or its subunits will be hidden in the return view. This is to prevent users with access to the return view can limit the display of survey results to a very small set of participants or even to individual participants. The following hiding conditions apply:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Return direct less than anonymity criterion → no display of return direct</p>\n</li>\n<li>\n<p>Accumulated return sum less than anonymity criterion → no display of accumulated return sum</p>\n</li>\n<li>\n<p>Difference of accumulated return sum and return direct less than anonymity criterion → no display of return direct</p>\n</li>\n<li>\n<p>Accumulated return sum less than anonymity criterion → no display of return direct and accumulated for subunits</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>The overview of the return data in detail</strong></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 287.0px;\"> <col style=\"width: 473.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Column heading</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Sum of the participants direct</p>\n</td>\n<td>\n<p>Sum of the existing online participants, the existing offline participants (i.e. participants with “Offline” flag) and requested paper-pencil questionnaires directly allocated to this unit.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Return direct</p>\n</td>\n<td>\n<p>Direct return of this unit, i.e., the sum of those online participants who have already completed the survey with disposition codes 31 or 32, and of those paper-pencil questionnaires whose data have already been scanned or imported into the system (with disposition codes 31 or 32).</p>\n<p>This sum includes the completed paper-pencil questionnaires: When scanning or importing the data, participant accounts with offline flag are created.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Return rate direct</p>\n</td>\n<td>\n<p>Direct return rate in percent, i.e., (Return direct / Sum of the participants direct) * 100</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Sum of the participants</p>\n</td>\n<td>\n<p>Sum of the existing online participants, the existing offline participants (i.e. participants with “Offline” flag) and requested paper-pencil questionnaires allocated to this unit and all subunits.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>N</p>\n</td>\n<td>\n<p>Corrected sum of online participants and paper-pencil questionnaires, if target figure adjustment is activated.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Accumulated return sum</p>\n</td>\n<td>\n<p>Accumulated return for this unit and all subunits, i.e., the sum of those online participants who have already completed the survey with disposition codes 31 or 32, and of those paper-pencil questionnaires whose data have already been scanned or imported into the system (with disposition codes 31 or 32).</p>\n<p>This sum includes the completed paper-pencil questionnaires: When scanning or importing the data, participant accounts with offline flags are created.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Accumulated return rate</p>\n</td>\n<td>\n<p>Accumulated return rate in percent, i.e., (Accumulated return sum / Sum of the online participants) * 100</p>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Actions</p>\n</td>\n<td>\n<p>By clicking on the icons in this column you can trigger the actions</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">The calculation of the sum of all participants in HR Reporting differs slightly from the Org Processor values. Participants with disposition codes 13, 14 and 15 are not included in this sum in the Org Processor, but are included in HR reporting.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The overview with a separate display of online and offline participants</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In hybrid surveys, you can optionally activate an alternative return view which displays the data of online and offline participants separately.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In this view, the sum of existing online participants and those offline participants for whom a participant account already exists is used as the base value when calculating the return rate. I.e. it is assumed that participant accounts with the “Offline” flag have already been created for the offline participants, for example via project data import. Date from logistics, i.e. in particular numbers for requested paper-pencil questionnaires, are not considered, in contrast to the default return view.</p>\n</li>\n<li>\n<p>To be considered as completed interviews for the return and the return rate, the offline interviews must have disposition code 31 or 32.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The alternative return view is activated in the <strong>Org Processor</strong> → <strong>Configuration</strong> menu on the Options tab in the „Display return of online and offline participants separately“ field.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 265.0px;\"> <col style=\"width: 495.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Column heading</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Sum of the participants direct</p>\n</td>\n<td>\n<p>Sum of the online participants and offline participants directly allocated to the current unit.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Online return</p>\n</td>\n<td>\n<p>Direct return of the current unit, i.e., the sum of those online participants who have already completed the survey with disposition codes 31 and 32.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Online return rate</p>\n</td>\n<td>\n<p>Direct online return rate in percent, i.e. (Online return / Sum of the participants direct) * 100</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Return of unit for paperpencil questionnaires</p>\n</td>\n<td>\n<p>Direct offline return of the current unit, i.e. the sum of offline participants (characterized by flag “Offline”) with disposition codes 31 or 32.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Return rate of unit for paper-pencil questionnaires</p>\n</td>\n<td>\n<p>Direct offline return rate in percent, i.e., (Return of unit for paper-pencil questionnaires / Sum of the participants direct) * 100</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Sum of the participants</p>\n</td>\n<td>\n<p>Sum of the existing online participants and the existing offline participants allocated to the current unit and all subunits.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Online total return</p>\n</td>\n<td>\n<p>Accumulated online return, i.e., the sum of those online participants who have already completed the survey with disposition codes 31 or 32, for the current unit and all subunits.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Accumulated online total return rate</p>\n</td>\n<td>\n<p>Accumulated return rate in percent, i.e., (Online total return / Sum of the participants) * 100</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Total return paper-pencil questionnaires</p>\n</td>\n<td>\n<p>Accumulated offline return, i.e. the sum of offline participants (characterized by flag “Offline”) with disposition codes 31 and 32 for the current unit and all subunits.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Accumulated total return rate paper-pencil questionnaires</p>\n</td>\n<td>\n<p>Accumulated return rate in percent, i.e., (Total return paper-pencil questionnaires / Sum of the participants) * 100</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Actions</p>\n</td>\n<td>\n<p>By clicking on the icons in this column, you can trigger the actions</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"><strong>Actions</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following Action icons are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Participants</strong>: This icon takes you directly to the desired unit’s return statistics.</p>\n</li>\n<li>\n<p><strong>Export</strong>: This icon takes you directly to the export options.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Return data of a unit</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the name of a unit you can open the unit-specific detail view. This view contains</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>the respective unit’s return statistics described below.</p>\n</li>\n<li>\n<p>the export options.</p>\n</li>\n<li>\n<p>the user management.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Viewing the return statistics of a unit</strong></p>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Return</strong> tab of the detail view, you will find the return statistics of the respective unit. Listed are the number of employees, the return, and the return rate for the unit itself (i.e., “directly assigned”) and also accumulated for the unit including all subunits. In the case of hybrid surveys, the values for online and paper-pencil questionnaires are listed separately in addition to the aggregate values.</p>\n<p class=\"wysiwyg-text-align-justify\">The return rates for the paper-pencil questionnaires always refer to those paper-pencil questionnaires whose data have already been scanned or imported into the system.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting return data</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The return data can be exported. This may be useful, for example, if you want to evaluate or present the data using third-party applications.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>There are two export options:</p>\n<ul>\n<li>\n<p>Small export: This data record contains the aggregate values for all units (return overview: accumulated sum of the participants, accumulated return, accumulated return rate).</p>\n</li>\n<li>\n<p>Expanded export: This data record lists all data in detail (return overview, return of the respective unit, and separate values for online and paper-pencil questionnaires).</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The export always comprises the current unit and all subunits to which you hold the relevant access rights.</p>\n</li>\n<li>\n<p>The formatting of the Excel files allows them to be presented or relayed to third parties without further preparation.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To export the return data, locate the desired unit on the<strong> Return</strong> tab. Click on the <strong>Export</strong> icon. Select the desired export option and the character set, and confirm by clicking on <strong>Send</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to export return data, you need to assign the right f<em>ield_export_response_short</em> and/or <em>field_export_response_full</em> to the appropriate roles.</p>\n<p class=\"wysiwyg-text-align-justify\">When presenting or relaying survey data, please observe the data protection regulations applying to your employee survey.</p>\n<h3 id=\"report-overview\" class=\"wysiwyg-text-align-justify\"><strong>Report Overview</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Upon completion of the survey, results reports are generated and made available for download to the responsible persons. The distribution process is usually managed directly in the <em>Org Processor</em> via the <strong>Report Overview</strong> tab. Your users can open the <strong>Report Overview</strong> tab only if it has been activated for their role in the current phase. To allow your users to open and edit not only their respective units but also the corresponding subunits, you need to activate the right structure_view_down for the appropriate roles.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The organizational structure, which opens automatically, will show you whether there are any reports for the individual units and if so, how many.</p>\n</li>\n<li>\n<p>In the detail view, you will find the list of reports and the user management of the respective unit.</p>\n</li>\n<li>\n<p>As a project manager, you can download all available reports.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Above the organizational structure, you will find the same features for modifying the display that you are already familiar with from the <strong>Organizational structure</strong> tab: Selection of the structure view, Search, <strong>Expand all</strong> / <strong>Collapse all</strong>, <strong>Activate auto-expansion</strong>, and <strong>View</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">The data in the report overview are updated every five minutes.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The report overview in detail</strong></p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 139.0px;\"> <col style=\"width: 352.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Column heading</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Number of reports</p>\n</td>\n<td>\n<p>Number of available reports for this unit.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Accumulated return sum</p>\n</td>\n<td>\n<p>Return of this unit and all subunits.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Actions</p>\n</td>\n<td>\n<p>By clicking on the icon in this column you can call up the actions</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"><strong>Actions</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following actions are available in the <strong>Actions</strong> layer:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Reports</strong>: This link takes you directly to the selected unit’s report overview.</p>\n</li>\n<li>\n<p><strong>Export list of reports</strong>: This link takes you to the export options for the list of reports</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Reports of a unit</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the name of a unit you can open the unit-specific detail view. This view contains</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>the reports of the unit.</p>\n</li>\n<li>\n<p>the list of reports </p>\n</li>\n<li>\n<p>the user management </p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Downloading reports</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Select the desired report and the desired language, then click on <strong>Download</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to download reports, you need to assign the right <em>reporting_download</em> to the appropriate roles. The users will then be able to download the reports that are available for their role in their units in the current phase.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting the list of reports</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can export a list of the available reports. This is useful, for example, if you want to check whether all the required reports are available as desired.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The export always comprises the current unit and all subunits to which you hold the relevant access rights.</p>\n</li>\n<li>\n<p>There are two export options:</p>\n<ul>\n<li>\n<p>The standard list of reports: This data record contains the report ID, unit, report type, and name, status, date of creation, file type, and language for each report.</p>\n</li>\n<li>\n<p>Expanded list of reports: This data record also lists report size and number of downloads. (The number of downloads includes both the downloads via the <em>Org Processor</em> and the download platform.)</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To export the list of reports, locate the desired unit on the <strong>Report Overview</strong> tab. Click on the<strong> Actions</strong> icon and select the link Export list of reports. Select the desired export option and the character set, and confirm by clicking on <strong>Send</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">Alternatively, you can download the list via the <strong>Export List of Reports</strong> button on the <strong>Reports</strong> tab.</p>\n<h2 id=\"org-processor-users\" class=\"wysiwyg-text-align-justify\">\n<em><strong>Org Processor</strong></em><strong> users</strong>\n</h2>\n<p class=\"wysiwyg-text-align-justify\"><em>EFS Employee</em> allows you to delegate data entry and maintenance for individual organizational units to staff that usually belong to the respective units. Via the separate <em>Org Processor</em> login, these staff members - the so-called users - have access to those <em>Org Processor</em> views and functions required for their work, restricted to their respective areas of responsibility. This chapter tells you how to manage the users of your project in their everyday work.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The </strong><em><strong>Org Processor</strong></em><strong> from the user’s perspective</strong></p>\n<p class=\"wysiwyg-text-align-justify\">As a member of the project management, you have an administrator account for <em>EFS Employee</em>. This allows you to log into the admin area of EFS Employee and, for example, configure the survey process, work on the questionnaire, or view the list of participants for the entire project. Staff members who merely maintain or retrieve data of a specific unit have a different type of account: the so-called user account. This account allows them to log into the <em>Org Processor</em> and, within the confines of their role, view and maintain data for their area of responsibility. However, they are not granted access to the admin area. In order to allow the optimum management of these users, you should know how they access the Org Processor and which features are available to them.</p>\n<h3 id=\"opening-the-org-processor-from-the-user-s-perspective\" class=\"wysiwyg-text-align-justify\"><strong>Opening the Org Processor from the user’s perspective</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">By default, there is always a user account for you in the Org Processor. If you have created the project and activated Logistics, this account is also the person responsible for the default logistics site. You can use this account to test the separate<em> Org Processor</em> login:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the<strong> Survey menu</strong> of the project, you see the URL of the questionnaire. Open a second browser window. Copy the URL into the address bar, add /orgprocessor, and click on <strong>Enter</strong>: This opens the<em> Org Processor</em> login.</p>\n</li>\n<li>\n<p>Open the menu <strong>Org Processor → Org Processor users</strong>. Locate your user account and open the detail view by clicking on the<strong> Edit</strong> icon. Use the given initial password to log in.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">This will take you to the start page of the separate <em>Org Processor</em> area where the users work. Usually, there will be no other tabs activated besides the start page. To activate more tabs, you have to allocate an area of responsibility and a role to your test user. The example below shows the start page of an owner, who can access <strong>Organizational structure</strong>, <strong>Return</strong>, and <strong>Report overview</strong> during the pre-test phase.</p>\n<p class=\"wysiwyg-text-align-justify\">Your automatically created user account exists separately from your staff account for the www area of <em>EFS Employee</em>, i.e., the accounts have different<br>passwords, among other things. You can't log into the separate <em>Org Processor</em> area with your staff account.</p>\n<h3 id=\"differences-between-project-manager-and-user-perspective\" class=\"wysiwyg-text-align-justify\"><strong>Differences between project manager and user perspective</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The table provides an overview of the most important differences between the project manager and user perspective.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 361.0px;\"> <col style=\"width: 239.0px;\"> <col style=\"width: 160.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p> </p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Project manager</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>User</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Work area: Admin area (www login)</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<ul>\n<li>\n<p> </p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Work area: Org Processor (separate login)</p>\n</td>\n<td>\n<p>with automatically created user account</p>\n</td>\n<td>\n<p>x</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Work area: Download platform)</p>\n</td>\n<td>\n<p>with automatically created user account</p>\n</td>\n<td>\n<p>x</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Access rights: ACL rights and object rights define the rights for teams</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Access rights: The <em>Org Processor</em> rights administration defines the rights for roles</p>\n</td>\n<td>\n<ul>\n<li>\n<p> </p>\n</li>\n</ul>\n</td>\n<td>\n<p>x</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Centralized participant administration</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<ul>\n<li>\n<p> </p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Unit-specific list of participants</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<p>x</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Centralized user management</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<ul>\n<li>\n<p> </p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Unit-specific user management</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<p>x</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Importing users</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<ul>\n<li>\n<p> </p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>Org Processor</em> start page</p>\n</td>\n<td>\n<p>Configuration in the<br>menu <strong>Org Processor→ Configuration</strong> → <strong>Org Processor</strong><br>interface</p>\n</td>\n<td>\n<p>x</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Writing e-mails to users</p>\n</td>\n<td>\n<p>x</p>\n</td>\n<td>\n<p>Only using the mail templates provided by the project manager</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"editing-user-variables\" class=\"wysiwyg-text-align-justify\">\n<br><strong>Editing user variables</strong>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">Before creating users, you should adjust the structure of the user management to the requirements of your current project. This is done in the menu <strong>Org Processor</strong> → <strong>Org Processor users</strong> → <strong>User variables</strong>. The following table lists the variables of the user management in the standard configuration.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 130.0px;\"> <col style=\"width: 136.0px;\"> <col style=\"width: 219.0px;\"> <col style=\"width: 119.0px;\"> <col style=\"width: 156.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Variable</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Label</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>File type</strong></p>\n</th>\n<th data-highlight-colour=\"#57d9a3\">\n<p><strong>Size</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p><em>u_firstname</em></p>\n</td>\n<td>\n<p>First name</p>\n</td>\n<td>\n<p>First name</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_name</em></p>\n</td>\n<td>\n<p>Name</p>\n</td>\n<td>\n<p>Name</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_email</em></p>\n</td>\n<td>\n<p>E-Mail</p>\n</td>\n<td>\n<p>E-mail. Serves as the unique identifier in the system.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_gender</em></p>\n</td>\n<td>\n<p>Gender</p>\n</td>\n<td>\n<p>Gender</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_unit</em></p>\n</td>\n<td>\n<p>Organizational unit</p>\n</td>\n<td>\n<p>This field can be used to specify the membership in a subsidiary or a department.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_city</em></p>\n</td>\n<td>\n<p>City</p>\n</td>\n<td>\n<p>City</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_country</em></p>\n</td>\n<td>\n<p>Country</p>\n</td>\n<td>\n<p>Country</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>lang</em></p>\n</td>\n<td>\n<p>lang</p>\n</td>\n<td>\n<p>The language of the user interface in the <em>Org Processor</em> upon login. You can choose between:</p>\n<ul>\n<li>\n<p>English (code: en)</p>\n</li>\n<li>\n<p>German (code: de)</p>\n</li>\n</ul>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>m_date</em></p>\n</td>\n<td>\n<p>Date of change</p>\n</td>\n<td>\n<p>The date of the last change.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>255 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_initial_password</em></p>\n</td>\n<td>\n<p>Initial password</p>\n</td>\n<td>\n<p>Initial password of the users. You can view the initial password via the user<br>interface. Once the users have<br>changed the initial password, you cannot see it anymore. Then you can only reset the password or generate a new one.</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>c_date</em></p>\n</td>\n<td>\n<p>Date of creation</p>\n</td>\n<td>\n<p>Date of creation</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"the-central-user-list\" class=\"wysiwyg-text-align-justify\"><strong>The central user list</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You will find the centralized user management in the<strong> Projects</strong> → {Selected project} → <strong>Org Processor → Org Processor users</strong> menu. It allows you to view and edit all users in the project. The complete user list is displayed automatically when you open the menu. The table lists each user along with the following additional information and actions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The user’s login status, is indicated by the traffic-light icon in the “Info” column (white: did not login yet; green: login possible; red: login not possible).</p>\n</li>\n<li>\n<p>All user data</p>\n</li>\n<li>\n<p>An overview of the user’s roles. If the logistics are activated, the allocations to logistics sites and reshipment points are also listed.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Edit</strong> icon to view the details of a particular user.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Display</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Above the user list, you will find the simple and extended search functions, as usual. Clicking on the <strong>View</strong> button will open a dialog where you can activate or deactivate various table columns (except for the permanent columns “Short form of unit name” and “Actions”). After you have confirmed by clicking on <strong>Save settings</strong> the table will be expanded accordingly.</p>\n<h3 id=\"detail-view-in-the-centralized-user-management\" class=\"wysiwyg-text-align-justify\"><strong>Detailed view in the centralized user management</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the centralized user management, you open the detail view by clicking on the <strong>Edit</strong> icon. The detail view contains all the data stored for the user, arranged on various tabs.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Edit user</strong>: This tab contains the following information and functions:</p>\n<ul>\n<li>\n<p>The account data.</p>\n</li>\n<li>\n<p>The initial password and a function for resetting or generating a new password</p>\n</li>\n<li>\n<p>Login information and a function for locking the account.</p>\n</li>\n</ul>\n</li>\n<li>\n<p><strong>Organizational units</strong>: Via this tab you can view and change the allocation of the user to his units.</p>\n</li>\n<li>\n<p><strong>Reports</strong>: On this tab, you can see which reports have been stored for the user.</p>\n</li>\n</ul>\n<h3 id=\"the-unit-specific-user-list\" class=\"wysiwyg-text-align-justify\"><strong>The unit-specific User List</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To view or edit the users of a particular unit, open the <strong>User Management</strong> tab in the detail view of this unit. The user list lists all the participants of the unit with their first names, last names, email addresses, and roles. Click on the <strong>Edit</strong> icon to view the details of a particular user.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Display and search functions</strong></p>\n<p class=\"wysiwyg-text-align-justify\">As usual, you can modify the list display with the help of different display and search functions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The search function above the list allows you to easily locate any particular user.</p>\n</li>\n<li>\n<p>By clicking on the <strong>View</strong> button you can display a dialog that allows you to specify whether the various table columns are to be shown or hidden. You can also change the number of rows per page. After you have confirmed by clicking on <strong>Send</strong> the table will be expanded accordingly.</p>\n</li>\n<li>\n<p>With the<strong> Show users from subunits</strong> button, you can expand the display by the users of the subunit. (This button is only visible if you hold access rights to the subunits.)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to view the user list, you need to assign the right <em>manager_view</em> to the appropriate roles.</p>\n<h3 id=\"detail-view-in-the-unit-specific-user-list\" class=\"wysiwyg-text-align-justify\"><strong>Detail view in the unit-specific User List</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the unit-specific user management, you also open the detail view by clicking on the <strong>Edit</strong> icon. Here you will find:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>the account data</p>\n</li>\n<li>\n<p>the role in the current unit</p>\n</li>\n</ul>\n<h3 id=\"actions-of-the-user-management\" class=\"wysiwyg-text-align-justify\"><strong>Actions of the user management</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Both in the centralized user management and in the unit-specific lists various actions are available to be applied to individual, selected, or all users.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Actions for editing individual users</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following actions that you can call up by clicking the icons in the “Actions” column are used for editing individual users, such as, for example, to subsequently edit or view the allocated units.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Edit</strong>: Opens the edit dialog</p>\n</li>\n<li>\n<p><strong>Show allocated reports</strong>: A pop-up window shows a list of the reports stored for the respective user. If you want users to be able to use this function, you need to assign the right <em>manager_view_report_alloc</em> to the appropriate roles.</p>\n</li>\n<li>\n<p><strong>Show allocated units</strong>: A pop-up window shows a list of the units that the respective user is allocated to. If you want users to be able to use this function, you need to assign the right<em> manager_view_node_alloc</em> to the appropriate roles.</p>\n</li>\n<li>\n<p><strong>Delete user allocations</strong>: This function is located in the unit-specific user management. The function removes the allocation of the users to the current unit. Please note: The user accounts are not deleted, the users can still log into the <em>Org Processor</em> and see at least the start page, and maybe also other units that they have not allocated to yet. If you want to prevent this, use the action “Lock accounts” (see below). If you want to remove users from the system completely,_use the<strong> Delete</strong> function of the centralized user management.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: This function is only available in the centralized user management. The desired users are deleted from the system following a security prompt. Please note: Users that are allocated to a reshipment point or a logistics site cannot be deleted. You have to assign the responsibility to another user first.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Actions for editing all or selected users</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following actions can be applied to selected or all users:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Mail users</strong>: This function allows you to contact the selected users via e-mail. How you can enable your users to e-mail other users in turn.</p>\n</li>\n<li>\n<p><strong>Generate passwords</strong>: This function allows you to change the selected users’ passwords or to generate new ones. If you want users to be able to use this function, you need to assign the right <em>manager_set_pw</em> to the appropriate roles.</p>\n</li>\n<li>\n<p><strong>Reset passwords</strong>: This function allows you to reset the selected users’ passwords to the initial password. If you want users to be able to use this function, you need to assign the right <em>manager_reset_pw</em> to the appropriate roles.</p>\n</li>\n<li>\n<p><strong>Lock accounts</strong>: The locked users can no longer log into the <em>Org Processor</em>. This function is only available to the project management in the centralized user management.</p>\n</li>\n<li>\n<p><strong>Unlock accounts</strong>: This function is only available to the project management in the centralized user management.</p>\n</li>\n<li>\n<p><strong>Export users</strong>: This function allows you to download the account data of the selected users. This can be useful, for example, if you want to communicate not just via email but also via regular mail. Thus you can download the stored address data. If you want users to be able to use this function, you need to assign the right <em>manager_export</em> to the appropriate roles. If the password is also to be included in the export, this requires the right <em>manager_export_with_pw</em>.</p>\n</li>\n<li>\n<p><strong>Delete user allocations</strong>: This function is located in the unit-specific user management. The function removes the allocation of the users to the current unit. The user accounts will remain intact. Please note: The user accounts are not deleted, the users can still log into the Org Processor and see at least the start page, and maybe also other units that they have not allocated to yet. If you want to prevent this, use the action “Lock accounts” (see above). If you want to remove users from the system completely,_use the <strong>Delete</strong> function of the centralized user management. If you want users to be able to use this function, you need to assign the right manager_alloc to the appropriate roles.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: This function is only available in the centralized user management. The desired users are deleted from the system following a security prompt. Please note: Users that are allocated to a reshipment point or a logistics site cannot be deleted. You have to assign the responsibility to another user first.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">These actions are located in the drop-down list below the user list. Select the desired users by ticking the checkboxes in the “Actions” column. Alternatively, you can also use the options “Mark all users on this page” or “Mark all found users”. Then specify the desired action and confirm by clicking on<strong> Execute</strong>.</p>\n<h3 id=\"creating-users\" class=\"wysiwyg-text-align-justify\"><strong>Creating users</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">As a project manager, you can both add new users individually and import them.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Manual creation is useful, for example, if you want to subsequently add individual persons.</p>\n</li>\n<li>\n<p>Otherwise, using the import function is more effective in most cases.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Depending on whether you work in the centralized user management or a particular unit, the process may be slightly different. If you work in centralized user management, you have to explicitly allocate the users to one or several units, whereas the allocation is done automatically in unit-specific user management. The allocations can also be imported.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The system is designed for up to 10,000 users. With higher numbers, depending on the circumstances, you might experience performance issues.</p>\n</li>\n<li>\n<p>If you partly delegate the creation of user accounts to users, please note that your users have no access to the import function but have to create all user accounts manually.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating users manually in the centralized user management</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Creating user accounts from the centralized user management - whether manually or by import - requires two steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>the actual creation of the accounts.</p>\n</li>\n<li>\n<p>the allocation to units. (Depending on how the project is organized, the allocation may be done by import, at a later date, or delegated to users.)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating user accounts manually</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the <strong>Projects</strong> → {Selected project} → <strong>Org Processor</strong> → <strong>Org Processor users</strong> menu.</p>\n</li>\n<li>\n<p>Use the search function to check whether there is already a user account for the respective person.</p>\n</li>\n<li>\n<p>If this is not the case, click on the <strong>Add User</strong> button.</p>\n</li>\n<li>\n<p>Enter the data. The following rules apply:</p>\n<ul>\n<li>\n<p>First name, last name, and e-mail address are mandatory.</p>\n</li>\n<li>\n<p>Use of the other fields is optional.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If the project management has activated the semi-automatic delivery of login details, you will also find a checkbox “Send account data automatically when saving”. If you tick this checkbox, the new user will automatically receive an e-mail with his login details.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Allocating users to a unit manually</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The user account has been created but has not been allocated to any units yet.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can perform this allocation on the <strong>Organizational Units</strong> tab. Locate the desired unit(s) and tick the respective “Action” checkbox(es). Select the respective role from the drop-down list that you want the user to have in this unit, and confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n<li>\n<p>If another user already has the desired unit allocation, <em>EFS</em> allows you to adopt this for new users. For users that have not been allocated to any unit yet, the corresponding function “Copy role of following account” can also be found on the <strong>Organizational Units</strong> tab. With the <strong>binocular</strong> icon, you can select the user account with the desired unit and role allocation. Please note: The purpose of this function is to copy the unit allocations listed on the <strong>Organizational Units</strong> tab. Allocations of users to logistics sites or reshipment points cannot be adopted.</p>\n</li>\n<li>\n<p>You can also perform this allocation by import for all users of the entire project.</p>\n</li>\n<li>\n<p>Alternatively, you can also leave it to already existing users of the higher levels to allocate additional users within their areas of responsibility.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating users Manually in the unit-specific user management</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To create a new user in the unit-specific user management, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the desired unit.</p>\n</li>\n<li>\n<p>Click on the <strong>User Management</strong> tab in the detail view.</p>\n</li>\n<li>\n<p>Click on the <strong>Add user</strong> button.</p>\n</li>\n<li>\n<p>Check first whether an account already exists for the respective person.</p>\n<ul>\n<li>\n<p>To do so, click on the<strong> binoculars</strong> icon in the “Name” field.</p>\n</li>\n<li>\n<p>This will prompt a list of all the users that have already been stored to be displayed. Search this list. If the desired person is present on this list, transfer the data by clicking on <strong>Select</strong>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Enter the data if the desired user does not exist yet. The following rules apply:</p>\n<ul>\n<li>\n<p>First name, last name, and e-mail address are mandatory.</p>\n</li>\n<li>\n<p>Use of the other fields is optional: Please follow the instructions of the project management regarding the data to be maintained.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Select the role you want the user to have in the current unit.</p>\n</li>\n<li>\n<p>If the project management has activated the semi-automatic delivery of login details, you will also find a checkbox “Send account data automatically when saving”. If you tick this checkbox, the new user will automatically receive an e-mail with his login details.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to manually create other user accounts, you need to assign the right <em>manager_add</em> to the appropriate roles.</p>\n<p class=\"wysiwyg-text-align-justify\">If there is no <strong>Select</strong> icon available for a user, this usually means that this user has already been allocated to the current unit: Double allocation to the same unit is not possible.</p>\n<h3 id=\"importing-users\" class=\"wysiwyg-text-align-justify\"><strong>Importing users</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">As a project manager, you can import new user accounts instead of creating each account individually. The import process is analogous to the participant import: To open the import dialog click on the Import users button in the <strong>Projects</strong> → {Selected project} → Org Processor →<strong> Org Processor users</strong> menu. Here, click on<strong> the Download import template</strong> to download the already pre-formatted import template. Fill this out and then import as usual. The formatting of the import file is also similar to that of the participant import file and follows the same rules.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Importing the allocation of users to units</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The allocation of the users to the units can also be defined by import. The import process is analogous to the participant import. Only the formatting of the import file differs from the usual procedure: There are no account data to be entered, but allocations between user accounts, units, and roles. The import file contains the following columns:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The column “u_email”: The e-mail address serves as the linking variable.</p>\n</li>\n<li>\n<p>The column “metaname”: The meta name indicates which unit the user is to be allocated to.</p>\n</li>\n<li>\n<p>The column “role”: In this column, you enter the abbreviation for the role the user is to assume in the unit identified by the meta name.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The rows list the individual allocations user:unit.</p>\n<p class=\"wysiwyg-text-align-justify\">If a user is to be allocated to multiple units, you have to list him multiple times. In the example shown, the user “Frank Sample” is allocated to one unit as owner and to a second unit as a report recipient.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A user can not assume multiple roles within one unit.</p>\n</li>\n<li>\n<p>A user cannot assume the same role twice within a branch of the structure, i.e., he cannot have the same role in a unit and in its parent unit.</p>\n</li>\n</ul>\n<h3 id=\"subsequently-editing-user-data\" class=\"wysiwyg-text-align-justify\"><strong>Subsequently editing user data</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">From time to time, you may have to edit existing user accounts, for example, due to changes in the roles of users. The most important edit options are described in the following.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing account data</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to change the account data of a user, open the detail view of this user (either in the centralized user management or in the unit-specific user list). Here you can edit the account data of the user.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing roles and allocations to units</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to change or delete the unit allocation of a user, there are two alternatives to choose from, depending on whether only the allocation to one unit is to be changed or multiple allocations.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you want to change the role of a user within a particular unit, locate this user in the user list.</p>\n<ul>\n<li>\n<p>Open the detail view as described above (either in the centralized user management or in the unit-specific user list). Here you can change the role of this user within the current unit.</p>\n</li>\n<li>\n<p>If you want to delete this allocation altogether, select the user from the list and use either the <strong>Delete</strong> icon or the action <strong>Delete user allocations</strong>.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If you want to view and edit the allocations of a user to organizational units in a centralized manner, do this via the <strong>Organizational Units</strong> tab in the detail view in the centralized user management. The search function in the upper section allows you to restrict the list of organizational units. For example, with “Show only linked units” you can restrict the list to those units that the user is already allocated to.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing passwords</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Occasionally, you may have to provide “first aid” to users working with the <em>Org Processor</em>. One of the most common problems is forgotten passwords. In this case, you can help by resetting the initial password or generating a new password and then mailing it to the user:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you want to reset the initial passwords of one or more users, or if you want to generate a new password, locate the respective users in the user list and then use either the action “Generate passwords” or the action “Reset passwords”. After that, mail the passwords to the users again.</p>\n</li>\n<li>\n<p>The detailed view of the users offers you additional edit options:</p>\n<ul>\n<li>\n<p>As long as the user has not logged in, i.e., as long as he has not changed his initial password, you can view the initial password.</p>\n</li>\n<li>\n<p>As soon as the user has changed the password, you cannot view it any longer. So, if the user loses or forgets his password, you have to either reset the password or generate a new one and mail it to the user.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Alternatively, refer your users to the “Reset password” dialog.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to change the account data and allocations of other users, you need to assign the right manager_edit and/or manager_alloc to the appropriate roles.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A user can not assume multiple roles within one unit.</p>\n</li>\n<li>\n<p>A user cannot assume the same role twice within a branch of the structure, i.e., he cannot have the same role in a unit and in its parent unit.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you want users to be able to (re-)generate or reset the passwords of other users, you need to assign the right <em>manager_set_pw</em> and/or <em>manager_reset_pw</em> to the appropriate roles.</p>\n<p class=\"wysiwyg-text-align-justify\">Initial passwords and passwords that were generated anew are visible for the project managers in the admin area and can be dispatched by mail. As soon as a user has changed their password, though, you can not access it via the admin area anymore. Dispatch per mail is not possible anymore, either: the characters are replaced by *****.</p>\n<h3 id=\"viewing-a-user-s-reports-in-a-centralized-manner\" class=\"wysiwyg-text-align-justify\"><strong>Viewing a user’s reports in a centralized manner</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Reports</strong> tab in the detail view in the centralized user management, you can see which reports have been stored for the respective user.</p>\n<h3 id=\"sending-e-mail-in-org-processor\" class=\"wysiwyg-text-align-justify\">\n<strong>Sending E-Mail in </strong><em><strong>Org Processor</strong></em>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">In the course of the project, you will both write to users and manage users who in turn write to other users. You usually write to users in the following situations:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You have created new user accounts and want to provide the owners with their login information.</p>\n</li>\n<li>\n<p>If the login information is not delivered by e-mail but by other means, you might use e-mail to notify the new users that they will soon receive a letter with their login information through their company's in-house mail.</p>\n</li>\n<li>\n<p>You want to notify the users of the project start or the start of a new phase.</p>\n</li>\n<li>\n<p>You want to ask the users to start with a particular job or to finish a job in due time.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The necessary tasks are presented in the following:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Creating mail templates to be used in the Org Processor and linking them with the project.</p>\n</li>\n<li>\n<p>Mailing users from the admin area</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Depending on how you organize your project, your users may be required to e-mail other users in turn:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The users have created new user accounts for their area of responsibility and want to provide these new users with their login information.</p>\n</li>\n<li>\n<p>The owner of a higher-level unit wants to ask the users in the subunits to conclude a particular work phase.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">This is also possible in the Org Processor: You can create mail templates for typical contact situations and make these available to the users. You have access to the main function of the Org Processor from all views and menus where the sending of e-mail makes sense (e.g. organizational structure, user management, logistics sites).</p>\n<h3 id=\"mailing-users\" class=\"wysiwyg-text-align-justify\"><strong>Mailing users</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you want to e-mail users in your area of responsibility, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the appropriate area of the<em> Org Processor</em>. In the example shown a project manager e-mails a user from the <strong>Organizational Structure</strong> tab.</p>\n</li>\n<li>\n<p>Select the units (or logistics sites) whose users you wish to contact, and tick the respective checkboxes in the “Actions” column.</p>\n</li>\n<li>\n<p>Select the action “Mail users” or “Mail users from the selected unit and its subunits”.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n<li>\n<p>This prompts a list of users meeting your criteria.</p>\n</li>\n<li>\n<p>Optionally, you can restrict this list further with the help of the <strong>Extended search</strong> function by setting stricter criteria and confirming your selection with <strong>Search</strong>: You can, for example, have only users with a specific role displayed.</p>\n</li>\n<li>\n<p>Tick the “Actions” checkbox for those users that you really wish to e-mail.</p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Execute</strong>.</p>\n</li>\n<li>\n<p>The standard mail form will open. Select the appropriate mail template and upload the template by clicking on <strong>Apply</strong>.</p>\n</li>\n<li>\n<p>Make all the required additional settings and enter the contents.</p>\n</li>\n<li>\n<p>Click on the <strong>Preview mail</strong> button to check the result. In particular, check whether the wildcards are replaced correctly.</p>\n</li>\n<li>\n<p>If you are satisfied, click on <strong>Send</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note: Batches of more than 10 mails are not sent directly, but are first placed in a queue to reduce server load, and processed successively. By default, EFS sends up to 1,000 emails from this queue every ten minutes.</p>\n<h3 id=\"allowing-users-to-mail-other-users\" class=\"wysiwyg-text-align-justify\"><strong>Allowing users to mail other users</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can allow your users to e-mail other users. To prevent errors and abuse the following restrictions apply:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Access to the mail function is protected by the right <em>manager_email_readonly</em>. Assign this right only to those roles that are allowed to send mail.</p>\n</li>\n<li>\n<p>Users can only e-mail users within their own area of responsibility.</p>\n</li>\n<li>\n<p>The users do not really write mails themselves but select from mail templates provided by you.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following illustrations show what your users are able to see in such a mailing process. Two preparatory steps are necessary, which are described in the following:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Creating mail templates</p>\n</li>\n<li>\n<p>Assigning mail templates to the project</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating mail templates to be used in the </strong><em><strong>Org Processor</strong></em></p>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Options</strong> → <strong>Mail templates</strong> menu, create a new mail template of the “Org Processor mail” type. Make all the necessary settings, select an appropriate mail sender, and enter the contents. Please pay special attention to the following:#</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The mail templates should have meaningful titles.</p>\n</li>\n<li>\n<p>They should contain all the necessary wildcards. An overview of the available wildcards is given in the mail form below the <strong>question mark</strong> icon.</p>\n</li>\n<li>\n<p>Often, you will want to insert the URL of the Org Processor. From EFS 7.0 on, insert it using the wildcard #url_orgprocessor#. In older versions of EFS, proceed as follows to construct the URL: Copy the URL of the project from the <strong>Survey menu</strong>. Add the string /orgprocessor. This is the URL of the Org Processor login. (The otherwise frequently used wildcard #code_complete# is not supported in the <em>Org Processor</em>.)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Assigning mail templates to a project</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Switch back to your project and open the project’s <strong>Mail templates</strong> menu. Mail templates of the “Org Processor mail” type which you assign to your project in this menu can be used by the users in the Org Processor. Locate the mail template you have just created. Its current status is indicated in the column “Project template”:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Yes = linked to the current project</p>\n</li>\n<li>\n<p>No = not linked to the current project</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Usually, a new template has the status “No”. If you click on the status link, it will change to “Yes”.</p>\n<h2 id=\"configuration\" class=\"wysiwyg-text-align-justify\"><strong>Configuration</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The <em>Org Processor</em> allows you to realize different survey types that are described in the table below. First, you select the type that suits your requirements on the Options tab in the <em><strong>Org</strong> Processor → </em><strong>Configurations options</strong> menu, the appropriate functions will then be released.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 121.0px;\"> <col style=\"width: 236.0px;\"> <col style=\"width: 199.0px;\"> <col style=\"width: 204.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Survey type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Explanation</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Functions activated automatically</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Additionally required</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Hybrid survey</p>\n</td>\n<td>\n<p>The survey is conducted partly online and partly using paper-pencil questionnaires.</p>\n</td>\n<td>\n<p>The following functions are activated automatically:</p>\n<ul>\n<li>\n<p>Participant administration: Allows you to manage the data of those respondents who participate online.</p>\n</li>\n<li>\n<p>Logistics: Supports the distribution of paper-pencil questionnaires.</p>\n</li>\n</ul>\n</td>\n<td>\n<p>The following additional tools should also be activated:</p>\n<ul>\n<li>\n<p>EFS Hybrid Extension: Additional module for generating paperpencil questionnaires, mandatory when using the logistics tool.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Online survey</p>\n</td>\n<td>\n<p>The survey is conducted exclusively online, no paper-pencil questionnaires are used.</p>\n</td>\n<td>\n<p>The following functions are activated automatically:</p>\n<ul>\n<li>\n<p>Participant administration: Allows you to manage the data of those respondents who participate online.</p>\n</li>\n<li>\n<p>Logistics: Supports the distribution of paper-pencil questionnaires</p>\n</li>\n</ul>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Paper-pencil survey</p>\n</td>\n<td>\n<p>The survey is conducted exclusively with paperpencil questionnaires, online participation is not possible.</p>\n</td>\n<td>\n<p>No participant administration.</p>\n</td>\n<td>\n<p>The following additional tools should also be activated:</p>\n<ul>\n<li>\n<p>EFS Hybrid Extension: Additional module for generating paperpencil questionnaires,<br>mandatory when using the logistics tool.</p>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Consider carefully which survey type fits for your project, and select the appropriate type now at the very start of the setup phase. We strongly advise against a change of survey type at a later date: Depending of the target type already-created data might be deleted.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>When changing from a paper-pencil or hybrid to an online survey, all paper-pencil questionnaire data will be deleted: they are superfluous in an online survey.</p>\n</li>\n<li>\n<p>When changing from an online or hybrid survey to a paper-pencil questionnaire, all data of online participants will be deleted.</p>\n</li>\n</ul>\n<h3 id=\"additional-options-in-detail\" class=\"wysiwyg-text-align-justify\"><strong>Additional options in detail</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">On the <strong>Options</strong> tab of the<strong> Org Processor</strong> → <strong>Configuration</strong> menu you can activate basic functions and extensions which are required only in certain situations.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 397.0px;\"> <col style=\"width: 363.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Field</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Only in EFS Employee installations<br>with Action Planner: Activate Action Planner</p>\n</td>\n<td>\n<p>The Action Planner is an optionally leasable additional tool for logging the follow-up measures of the employee survey.</p>\n<ul>\n<li>\n<p>When activated, the Action Planner is displayed on an additional tab in the Org<br>Proceulrissor.</p>\n</li>\n<li>\n<p>The menu <strong>Org Processor</strong> → <strong>Configuration</strong> contains the submenu <strong>Action Planner configuration</strong> where you can configure the Action Planner</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Only in<em> EFS Employee</em> installations<br>with <em>Closed Loop Feedback</em>: </p>\n</td>\n<td>\n<p><em>CLF</em> is an extension of the traditional customer survey, enabling direct customer dialog by responding individually to the specific case and solving it.</p>\n<ul>\n<li>\n<p>The menu <strong>Org Processor</strong> → <strong>Configuration</strong> contains the submenu <strong>CLF configuration overview</strong> where you can configure the<em> Action Planner</em>.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Activate manual adjustment of target figure</p>\n</td>\n<td>\n<p>Activates manual adjustment of target figures</p>\n<ul>\n<li>\n<p>When activated, the action <strong>Adjust target figures</strong> are displayed on the <strong>Organizational Structure</strong> tab.</p>\n</li>\n<li>\n<p>The adjusted figures are displayed on the<strong> Organizational Structure</strong> and <strong>Return</strong> tabs.</p>\n</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Administration mode</p>\n</td>\n<td>\n<p>By selecting the appropriate administration mode you can restrict or expand the complexity of the user management.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Activate the feature “Sending account data”</p>\n</td>\n<td>\n<p>Activates the semi-automatic dispatch of access data.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Mail template</p>\n</td>\n<td>\n<p>In this field, you select the mail template for semiautomatic dispatch of login data.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Anonymity criterion for the return</p>\n</td>\n<td>\n<p>The return is protected by a specific anonymity criterion which you can define for the entire project.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Include units with a return rate of 0 for the remainder rule</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Only in hybrid surveys: Display the return of online and offline participants separately</p>\n</td>\n<td>\n<p>Alternative return view:</p>\n<ul>\n<li>\n<p>The data of online and offline participants are displayed separately.</p>\n</li>\n<li>\n<p>The sum of online participants and those offline participants for whom a participant account exists is used as the base value when calculating the return rate. (In the default return view, on the other hand, the sum of online participants and requested paper-pencil questionnaires is used.)</p>\n</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">If you inadvertently deactivate the Action Planner, the data will be preserved. However, we strongly advise against deactivating these functions in a live project: This will limit your edit options.</p>\n<h3 id=\"security-settings\" class=\"wysiwyg-text-align-justify\"><strong>Security settings</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">On the Security settings tab in the <strong>Org Processor</strong> →<strong> Configuration</strong> menu, you can modify the behavior of the system during login. The following processes cannot be configured:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The “Recover password” function of <em>Org Processor</em>: It is the same that is used for the admin area. Processes and mails cannot be configured.</p>\n</li>\n<li>\n<p>The security routine triggered at first login: It enforces a change of password analogous to the admin area. This process cannot be modified either.</p>\n</li>\n<li>\n<p>In contrast to the admin area, a monthly change of the password is not required for <em>Org Processor</em>. This cannot be changed.</p>\n</li>\n</ul>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 124.0px;\"> <col style=\"width: 258.0px;\"> <col style=\"width: 216.0px;\"> <col style=\"width: 162.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Field</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Setting options</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Default settings</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Password check</p>\n</td>\n<td>\n<p>You can choose from several<br>sets of security requirements for<br>the password.</p>\n<p>This setting affects both <em>Org Processor</em><br>and download platform.</p>\n</td>\n<td>\n<p>Various options are available:</p>\n<ul>\n<li>\n<p>Upper and lowercase,<br>numbers or special characters and at least 8 characters long</p>\n</li>\n<li>\n<p>Characters and numbers or characters and special characters, at least 8 characters long</p>\n</li>\n<li>\n<p>Upper and lower case, numbers and at least 8 characters</p>\n</li>\n<li>\n<p>Characters, numbers, and at least 8 characters</p>\n</li>\n</ul>\n</td>\n<td>\n<p>Upper and lower<br>case, numbers, or special characters<br>and at least 8 characters long</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Number of wrong logins</p>\n</td>\n<td>\n<p>To protect the download platform against brute force attacks, you can define the maximum number of permitted wrong logins. If, after reaching this number, a further wrong login occurs, the account will be blocked for a defined period of time.</p>\n</td>\n<td>\n<p> </p>\n</td>\n<td>\n<p>0, i.e. the number of wrong logins is not limited.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>How long is the<br>account blocked?</p>\n</td>\n<td>\n<p>If the number of wrong logins exceeds the permitted maximum number defined above, the account is blocked for the period of time defined in this field.</p>\n</td>\n<td>\n<p>Seconds</p>\n</td>\n<td>\n<p>0, i.e. the account will not be blocked.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"org-processor-messages\" class=\"wysiwyg-text-align-justify\">\n<br><em><strong>Org Processor</strong></em><strong> messages</strong>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">You can also modify the info texts on the most important <em>Org Processor</em> tabs to meet the requirements of your project. These texts are visible both in the separate <em>Org Processor</em> login and in the admin area. Switch to the <strong>Org Processor</strong> → <strong>Configuration</strong> menu. Open the <strong>Org Processor messages</strong> tab. Here you will find two fields for each of the following Org Processor tabs, where you can edit the German and English info texts:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Organizational structure</strong> tab</p>\n</li>\n<li>\n<p><strong>Return</strong> tab</p>\n</li>\n<li>\n<p><strong>Report overview</strong> tab</p>\n</li>\n<li>\n<p>If Action Planner is activated: <strong>Action Planner</strong> tab and overview of the actions in the detail view of a unit.</p>\n</li>\n</ul>\n<h3 id=\"historical-assignment\" class=\"wysiwyg-text-align-justify\"><strong>Historical assignment</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">It is possible to compare the current structure to its historical version. Historical comparisons can be created automatically if both projects were created through an Orbit snapshot. Historical comparisons can be used e. g. in the Data Voyager Analyst, to compare the survey results of both structures.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Go to the Org Processor‘s <strong>Configuration settings</strong> and select the <strong>Historical Assignment</strong> tab.</p>\n</li>\n<li>\n<p>Choose a specific historical project from all projects available.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If the project selected has been created with Orbit, two algorithms will be available for mapping.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Historical comparison based on people: This algorithm is set to compare participants to those in units contained in the historical structure. Once a match has been found where two units are considered identical in regard to their participants, the historical comparison will be saved. You may further refine the precision of the comparison by setting a specific percentage that must be met.</p>\n</li>\n<li>\n<p>Historical comparison based on identical metanames: The second algorithm creates a mapping based on identical meta names. Metanames can be selected individually, additionally, additionally added information from re-imported Excel files can be available for selection.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In historical comparisons, both algorithms fill their results into empty fields only. However, note that the order of the execution will influence your results. The first algorithm selected and executed will provide results for the variable concerning the historical meta names, while the second algorithm executed will apply only to the remaining empty fields.</p>\n<h3 id=\"structure-administration\" class=\"wysiwyg-text-align-justify\"><strong>Structure administration</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">By default, the <em>Org Processor</em> shows the primary structure. If further views are available, you will find a drop-down list in the upper sections of the tabs <strong>Organizational Structure</strong>, <strong>Return</strong>, and <strong>Report Overview</strong>, where you can select the desired view.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Administrating structure views</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The structure views are administrated in the menu <strong>Projects</strong> → {Selected project} →<strong> Org Processor → Configuration → Structure administration</strong>. The overview table provides the following information for each view.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>ID</p>\n</li>\n<li>\n<p>Name</p>\n</li>\n<li>\n<p>Type</p>\n</li>\n<li>\n<p>Identifier</p>\n</li>\n<li>\n<p>Multiple allocations of participants allowed?</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can open the views for editing or delete them (except for the primary structure).</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating additional structure views</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Create Structure view</strong> button.</p>\n</li>\n<li>\n<p>You have to specify:</p>\n<ul>\n<li>\n<p>Name</p>\n</li>\n<li>\n<p>Identifier: The identifier is used, for example, for the import. The identifier must not contain any special characters or blank spaces. It must be unique. Example: “FunctionalStructure”.</p>\n</li>\n<li>\n<p>Multiple allocation of participants allowed: Activates additional features that allow you to allocate individual participants to multiple units within the same structure.</p>\n</li>\n<li>\n<p>Use “Function”: Activates additional features that allow you, in the matrix representation, to differentiate between the various functions a participant<br>has. For example, a participant may be the “Manager” in one department while counting only as “Staff” within the product line.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save settings</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Manual allocation to multiple structure views</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If there are multiple structure views, additional functions allowing you the manual allocation of the participants to the structures will be displayed in the following locations:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Centralized participant administration-&gt;Form for adding a new participant → Section “Allocation of the participant to structure views”: In this section, you can<br>allocate the participants to one node per structure view (more nodes are possible when using multiple allocations, see below).</p>\n</li>\n<li>\n<p>Centralized participant administration-&gt;Detail view of the participant → Section “Allocation of participant to structure views”: Here you can also allocate the participants to one node per structure view.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Importing into multiple structure views</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Via the centralized participant administration, you can import participants into multiple views simultaneously. When doing so, the variable containing the unit allocation - usually metaname - is formatted as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Multiple structure views and/or multiple allocation: metaname1;metaname2</p>\n</li>\n<li>\n<p>Multiple structure views, multiple allocation, and/or function: metaname1:u_function:code;metaname2:u_function:code;metaname3:u_function:code</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note that every participant data record can only be imported once: All the desired allocations should be performed in this one permitted import. Decentralized import is not possible, i.e. you cannot separately import the same participants into the lists of participants of units in different structure views. If you want to subsequently allocate an already imported participant to additional units, you can do so in the participant’s detail view in the centralized participant administration as described above.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting the allocation to multiple views</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to export the allocation of the participants to the various structure views, download the central list of participants from the menu <strong>Projects</strong> → {Selected project} → <strong>Participant administration </strong>by clicking on either of the buttons labeled <strong>Excel export</strong> or <strong>CSV</strong> export. The column metaname contains the comma-separated meta names of the units to which the participant is allocated.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Multiple allocation of participants within one structure</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Optionally, you can modify the organization as to allow the allocation of individual participants to multiple units within the same structure. Such duplicate allocations can be useful, for example, in product or project structures: The multiply allocated participant continues to receive only one questionnaire, but all his allocations are available to you for filtering or report generation.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Activation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">This additional feature is activated via the field “Multiple allocation of participants allowed” in the detailed view of the desired structure.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Manual multiple allocation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If multiple allocation is activated, then additional functions allowing you the manual allocation of participants will be displayed in the following locations:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Centralized participant administration → Form for adding a new participant → Section “Allocation of participant to structure views”: In the structure for which multiple allocation is activated, you can allocate the participants to any number of nodes.</p>\n</li>\n<li>\n<p>Centralized participant administration → Detail view of the participant → Section “Allocation of the participant to structure views”: Here you can also allocate the participants to any number of nodes.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Importing multiple allocations</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Multiple allocations can be imported into the centralized participant administration. When doing so, the variable containing the unit allocation - usually metaname - is formatted as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Multiple structure views and/or multiple allocation: metaname1;metaname2</p>\n</li>\n<li>\n<p>Multiple structure views, multiple allocation, and/or function: metaname1:u_function:code;metaname2:u_function:code;metaname3:u_function:code</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note that every participant data record can only be imported once: All the desired allocations should be performed in this one permitted import. Decentralized import of multiple allocations is not possible, i.e. you cannot separately import the same participants into the lists of participants of different units. If you want to subsequently allocate an already imported participant to additional units, you can do so in the participant’s detail view in the centralized participant administration as described above.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting multiple allocations</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Download the central list of participants as already described for the allocation to multiple structure views. The column metaname contains the comma-separated meta names of the units to which the participants are allocated.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Additional Feature: allocation of functions to the participants</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you are using multiple structure views and/or multiple allocations, you can differentiate between the different functions that a participant may have. The following functions can be allocated:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Staff</p>\n</li>\n<li>\n<p>Manager</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Thus, for example, you can mark a participant as “Manager” in a hierarchical structure view while counting him only as “Staff” in a project structure.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Activation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">This additional feature is activated via the field “Use Function” in the detailed view of the desired structure.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Manual function allocation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If function allocation is activated, then additional functions permitting the manual allocation of participants will be displayed in the following locations:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Centralized participant administration → Form for adding a new participant → Section “Allocation of the participant to structure views”: In the structure for which the function allocation is activated you can allocate a function to the participants.</p>\n</li>\n<li>\n<p>Centralized participant administration → Detail view of the participant → Section “Allocation of the participant to structure views”: Here you can also allocate a function to the participants.</p>\n</li>\n<li>\n<p>Decentralized participant administration (both in the www area and in the Org Processor) → Detail view of the participant → Section “Functions”: Both you and the users can allocate a function to the participants.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Importing function allocations</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Function allocations can be imported into the centralized participant administration. When doing so, the variable containing the unit allocation - usually metaname - is formatted as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Multiple structure views, multiple allocation, and/or function: metaname1:u_function:code;metaname2:u_function:code;metaname3:u_function:code</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Decentralized import of function allocations is not possible. If you want to subsequently change the function allocation of an already imported participant, you can do so in the participant’s detail view in the centralized participant administration as described above.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Exporting function allocations</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Download the central list of participants as already described for the allocation to multiple structure views. In addition to the meta names of the units, the column metaname also contains the function(s).</p>\n<h3 id=\"structure-variables\" class=\"wysiwyg-text-align-justify\"><strong>Structure variables</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Prior to building the organizational structure, check whether the data structure meets the requirements of your current project, and adjust it if necessary.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Variables for storing basic properties of the units, such as name or target number, can be relabeled or otherwise modified.</p>\n</li>\n<li>\n<p>If you want to store additional unit-specific properties, you can create additional variables. If, for example, you want to label the organizational units in a second language, you can create a specific variable for this purpose. Properties common to all participants of a unit can also be stored in user-defined variables on the unit level.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The editing of the variables and the creation of additional variables is done in the menu <strong>Org Processor</strong> → <strong>Configuration → Structure variables</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the existing structure variables</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Switch to the menu <strong>Org Processor</strong> →<strong> Configuration → Structure variables</strong>. Here you will find an overview table listing the already existing structure variables.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 161.0px;\"> <col style=\"width: 150.0px;\"> <col style=\"width: 230.0px;\"> <col style=\"width: 100.0px;\"> <col style=\"width: 119.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Variable</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Label</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Meaning</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Data type</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Size</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p><em>label_extern</em></p>\n</td>\n<td>\n<p>Name of unit</p>\n</td>\n<td>\n<p>Name of the respective organizational unit.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>256 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>label</em></p>\n</td>\n<td>\n<p>Short form of unit name</p>\n</td>\n<td>\n<p>Name of the respective organizational unit as it is to be displayed in the organizational structure. For greater clarity, a shortened form of the actual name is usually used.</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>256 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>metaname</em></p>\n</td>\n<td>\n<p>Meta name (Unique Ident.)</p>\n</td>\n<td>\n<p>Unique identifier of the unit. The meta name may contain only the following characters: a-z, A-Z, 0-9, \"_\", \"-\"</p>\n</td>\n<td>\n<p>Text field</p>\n</td>\n<td>\n<p>65,536 characters</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>co_target</em></p>\n</td>\n<td>\n<p>Staff (preset value)</p>\n</td>\n<td>\n<p>Preset number of employees for this unit.</p>\n</td>\n<td>\n<p>int(11)</p>\n</td>\n<td>\n<p>max 2,147,483,647</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>visible</em></p>\n</td>\n<td>\n<p>Permit allocation to unit in the questionnaire</p>\n</td>\n<td>\n<p>This variable is only relevant in combination with the selfallocation. It specifies whether a participant who is allowed to allocate himself may select<br>the respective unit in the questionnaire. Available options are:</p>\n<ul>\n<li>\n<p>0: The unit cannot be selected. If the participants can see it at all, depends of the value of “Hide unit in questionnaire (including subunits)”.</p>\n</li>\n<li>\n<p>1: It is possible to select the unit.</p>\n</li>\n</ul>\n</td>\n<td>\n<p>Checkbox</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>historic_code</em></p>\n</td>\n<td>\n<p>Comparison unit of the preceding year</p>\n</td>\n<td>\n<p>This variable was used for storing the code of the comparison unit from the previous survey in the past. The meta<br>names are used for comparison.</p>\n</td>\n<td>\n<p>int(11)</p>\n</td>\n<td>\n<p>max 2,147,483,647</p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>u_adjust_members</em></p>\n</td>\n<td>\n<p>Correction factor</p>\n</td>\n<td>\n<p>This variable is only relevant in combination with the manual adjustment of target figures. It contains the direct correction factor.</p>\n</td>\n<td>\n<p>Text</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p>u_adjust_members_agg</p>\n</td>\n<td>\n<p>Correction factor abs.</p>\n</td>\n<td>\n<p>This variable is only relevant in combination with manual adjustment of target figures, It contains the absolute correction factor.</p>\n</td>\n<td>\n<p>Text</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n<tr>\n<td>\n<p><em>hide_unit</em></p>\n</td>\n<td>\n<p>Hide unit in questionnaire (including subunits)</p>\n</td>\n<td>\n<p>This variable is only relevant in combination with the selfallocation. It<br>specifies whether a participant who is allowed to allocate himself may see the respective unit and its<br>subunits in the questionnaire. Available options are:</p>\n<ul>\n<li>\n<p>0: The unit including its subunits is displayed.</p>\n</li>\n<li>\n<p>1: The unit including its subunits is hidden.</p>\n</li>\n</ul>\n</td>\n<td>\n<p>Checkbox</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"action-planner-configuration\" class=\"wysiwyg-text-align-justify\"><strong>Action Planner configuration</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <em>Action Planner</em> and the add-on module <em>CLF</em> are activated. In the sidebar, two new menus are displayed: the <em><strong>Action Planner</strong></em><strong> configuration</strong> menu and the <em><strong>CLF</strong></em><strong> configuration overview</strong>. Also, if you go back to the<strong> Org Processor</strong> menu, you will find the <em>Action Planner</em> itself on a newly inserted tab. The configuration options in this menu, which will be introduced in the following Chapters, enable you to adapt the Action Planner to your specific survey process. The <em>CLF </em>configuration overview gives you an overview of the configuration process of <em>CLF</em> related applications in the context of preparing the Action Planner. With the <em>Action Planner</em>, you can create new tasks in <em>Portals</em>. Furthermore, you gain insight into statistic overviews of your tasks. You can export your tasks and statistics to organizational units and have additional access to the user administration.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039445778\" alt=\"Action Planner configuration.jpg\"></p>\n<h3 id=\"clf-configuration-overview\" class=\"wysiwyg-text-align-justify\"><strong>CLF configuration overview</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">After activating the add-on module <em>CLF</em>, you can consult the<em> CLF</em> configuration overview as a guideline when preparing the Action Planner and implementing <em>CLF</em> in your project settings. This <em>EFS</em> page gives you an overview of required and optional settings. The fields are highlighted in color to show the status of each setting in your current project: blue fields indicate settings in your Employee project which already have been configured, red fields indicate settings (still) not set. All settings required should be highlighted in blue at the end of the configuration process.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069484178\" alt=\"CLF overview.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">You can reach the CLF configuration overview over two different paths:</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Path 1:</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the EFS admin area, open <strong>Projects</strong> → {Selected project} → <strong>Org Processor</strong> → <strong>Configuration</strong>.</p>\n</li>\n<li>\n<p>In the sidebar <strong>Configuration</strong>, click on the button <strong>CLF configuration overview</strong>.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">The CLF configuration overview of your Employee project is displayed.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Path 2:</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the header menu, hover over the tab <strong>System</strong> and click on the button <strong>Options</strong>.</p>\n</li>\n<li>\n<p>In the sidebar <strong>Options</strong>, click on the button <strong>CLF configuration overview</strong>.</p>\n</li>\n<li>\n<p>Select your <strong>Employee project</strong> from the drop-down list.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">The CLF configuration overview of your Employee project is displayed.</p>\n<p class=\"wysiwyg-text-align-justify\">For access to the CLF configuration overview, the prior activation of the add-on module CLF is required</p>\n<h2 id=\"accessing-org-processor-data-in-condition-editor\" class=\"wysiwyg-text-align-justify\"><strong>Accessing Org Processor Data in Condition Editor</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You can access Org Processor data when defining filters, hiding conditions, etc. in the condition editor. The following Org Processor data are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>org_code_structureID (Primary Structure.OrgCodePreAllocation): Unit in the named structure to which the participants have been allocated. E.g. org_code_1 is the unit of the participants in the primary view (structure ID = 1).</p>\n</li>\n<li>\n<p>org_allocation_structureID (Primary Structure.OrgCodeSelfAllocation): Unit in the named structure to which the participants have allocated themselves. E.g. org_allocation_1 is the self-allocated unit of the participants in the primary view (structure ID = 1.</p>\n</li>\n<li>\n<p>org_function_structureID (Primary Structure.OrgFunction): Function of a participant in the named structure. E.g. org_function_1 is the function of the participant in the primary structure (Struktur-ID = 1).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following operators have been created specifically for filtering on Org Processor data:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>in: The variable selected must contain the unit named in the “code” field.</p>\n</li>\n<li>\n<p>in or below: The variable selected must contain either the variable named in the “code” field or one of its subunits.</p>\n</li>\n<li>\n<p>in branch: The variable selected must contain either the unit named in the “code” field or any other unit from the complete branch (from the root unit down to the lowest level). This operator is usually not used for routing purposes in the questionnaire but for report definitions.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Releasing units for filtering</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Only project management can release units for filtering. Users can not access this function.</p>\n<p class=\"wysiwyg-text-align-justify\">To display the Org Processor data described above in the code drop-down list in the condition editor, you have to explicitly release the unit(s) required for filtering. Otherwise, you have to enter the data manually, you cannot select them from the list.</p>\n<p class=\"wysiwyg-text-align-justify\">This limitation has been introduced for two reasons. First, it helps to improve the performance: querying all possible units in complex structures requires considerable server resources. Second, by releasing only units that are actually required, you can improve transparency in the condition editor.</p>\n<p class=\"wysiwyg-text-align-justify\">The actions “Release units for filtering” and “Revoke filter release for units” on the <strong>Organizational Structure</strong> tab are used to release units. If a unit has been released, it is marked by a white F icon in the organizational structure.</p>\n<p class=\"wysiwyg-text-align-justify\">If a unit has been released and you select one of the variables named above in the condition editor, you can access the units as usual via the <strong>Binoculars</strong> icon. Units used in a filter definition are marked by a lilac <strong>F</strong> icon in the organizational structure.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">How many users can the system handle?</h3>\n<p class=\"wysiwyg-text-align-justify\">The system is designed for up to 10,000 users. With higher numbers, you might experience performance issues depending on the circumstances.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can users have multiple roles within a unit?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, a user cannot assume multiple roles within one unit. Additionally, a user cannot have the same role twice within a branch of the structure.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">How often are return data updated?</h3>\n<p class=\"wysiwyg-text-align-justify\">The data in the return overview are updated every five minutes. You can use the \"Update participant numbers\" icon to trigger a manual update if necessary.</p>",
    "user_segment_ids": []
}