{
    "id": 20370821863698,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370821863698.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370821863698-Project-Properties",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:31:24Z",
    "updated_at": "2024-08-28T09:54:56Z",
    "name": "Project Properties",
    "title": "Project Properties",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T11:06:36Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers the Project Properties section in the EFS Survey, focusing on various settings and configurations for survey projects. It includes information on survey options, messages, languages, variable data import, website settings, and more.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The Project Properties menu in EFS Survey allows users to configure various aspects of their survey projects, including survey options, messages, languages, and other important settings.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#survey-options\">Survey Options</a></li>\n<li><a href=\"#survey-messages\">Survey Messages</a></li>\n<li><a href=\"#survey-languages\">Survey Languages</a></li>\n<li><a href=\"#variable-data-import\">Variable Data Import</a></li>\n<li><a href=\"#website-settings\">Website Settings</a></li>\n<li><a href=\"#portal-settings\">Portal Settings</a></li>\n<li><a href=\"#bonus-points-configuration\">Bonus points configuration</a></li>\n<li><a href=\"#template-configuration\">Template configuration</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"survey-options\" class=\"wysiwyg-text-align-justify\"><strong>Survey Options</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Open the <em>Projects</em> → {Selected project} → <em>Project properties</em> menu. The tabs of the <strong>Survey options</strong> submenu will be automatically displayed in the content area.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014884211858\" alt=\"Survey options.jpg\"></p>\n<h3 id=\"general-options\" class=\"wysiwyg-text-align-justify\"><strong>General Options</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The tab General options in the Survey options menu relate to the Internet location (i.e. the URL) of your survey, to an extended log for changes made to the questionnaire, and certain aspects concerning the behavior of the survey.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"internal-organization\" class=\"wysiwyg-text-align-justify\"><strong>Internal Organization</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">On this tab, you can activate features that help you with the internal organization and testing of your project.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837349906\" alt=\"Internal organization.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">Please note: for several of these features, it is taken for granted that you or your testers are logged into the admin area while skipping through the questionnaire.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"login-options\" class=\"wysiwyg-text-align-justify\"><strong>Login Options</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Online surveys can be equipped with diverse access mechanisms. The tab<strong> Login options</strong> define the type of access to the survey in combination with the selected project type.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Switch to the <strong>Projects</strong> → {Selected project} → <strong>Project properties → Survey options</strong> menu → <strong>Login options</strong> tab</p>\n</li>\n<li>\n<p>Select the type of access protection in the “Login type” row. Depending on the project type, different options are available.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837358226\" alt=\"Login options.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Cookies are used:</p>\n<ul>\n<li>\n<p>Only in anonymous surveys: Cookies are used in anonymous surveys to make resumption possible and to make multiple participation more difficult.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Session validity period (in seconds):</p>\n<ul>\n<li>\n<p>In this field, you can set the session period for surveys. The session validity period, or “session time”, is the period between a participant’s actions during which the software can recognize the participant and permit editing of a survey that has begun. It is measured as the difference between those actions of participants that require a connection between browser and web server, i.e. from the submission of a questionnaire page to the submission of the next page, for example, or from the time participants leave an uncompleted survey until they resume editing of the survey.</p>\n</li>\n<li>\n<p>Entering the <strong>Session validity period</strong>: You can either enter the total value or a mathematical operation (e.g. “3600 * 24” for one day). The default session validity period in anonymous surveys is 1,209,600 seconds, i.e. two weeks. In all other project types, it is 7,200 seconds, i.e. two hours.</p>\n</li>\n<li>\n<p>The following tips will help you to choose an adequate session time:</p>\n<ul>\n<li>\n<p>Increasing the session time is recommendable if you have to assume that participants will not complete the survey in one go.</p>\n</li>\n<li>\n<p>If a questionnaire page contains numerous or highly complex questions, make sure that the session time is sufficient for editing this page.</p>\n</li>\n<li>\n<p>If participants are redirected to another survey project with the help of an external survey start and then jump back to the primary EFS Survey project, the time they took to complete the external project is treated as if it were an individual questionnaire page. The primary project’s session time should therefore be greater than the time it takes participants to complete the entire external project.</p>\n</li>\n<li>\n<p>For anonymous surveys in which cookies are used, you can use the session validity period to influence how and when a participant can take part in a completed survey again (provided the participant has activated cookies). For example, if you do not want the participant to repeat the survey within the next fortnight, set the validity period to two weeks.</p>\n</li>\n<li>\n<p>If URL parameters are used in an anonymous survey and a participant’s session times out, a message will be displayed that points out that the number of URL parameters is not correct. You can find this message in the Project properties-&gt; Survey messages menu in the „Error message if number of URL parameters is wrong“ field.</p>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Cookies</strong></p>\n<p class=\"wysiwyg-text-align-justify\">For anonymous surveys, you must specify whether you wish to set cookies or not. A cookie is a short text file stored on the respondent’s computer. In EFS Survey projects, the text file saves an internal survey title and the respondent’s session ID. The session ID is an anonymous, unguessable number that is assigned when the respondent first accesses the survey and ensures that the respondent can be recognized from submitting one page to submitting the next page.</p>\n<p class=\"wysiwyg-text-align-justify\">If the session ID has been stored on the respondent’s computer (in a cookie), EFS Survey can recognize the respondent throughout Internet sessions and enable the resumption of an anonymous survey.</p>\n<p class=\"wysiwyg-text-align-justify\">As some Internet users do not permit the storage of cookies, the session ID can be transferred as a so-called GET parameter as an alternative/fallback, i.e. it is attached to the survey URL, thus avoiding the storage of information on the respondent’s computer. Resumption without a cookie set is only possible for personalized or panel surveys.</p>\n<p class=\"wysiwyg-text-align-justify\">Summary:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Although you have activated cookies, each respondent will individually decide whether they wish to permit cookies or not. Respondents who do not accept the cookie can participate in anonymous surveys more than once.</p>\n</li>\n<li>\n<p>Deactivate cookies if you want to allow yourself or others to participate in the same survey more than once in succession. This is especially recommended if you want to use the EFS Survey as an input tool for CATI surveys and the telephone interviewer enters several interviews in succession / at once.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The project info of an anonymous project will contain the “participate again” link. Clicking on this link will delete a set cookie and thus enable multiple participation in / repeated tests of the project. Do <em>not </em>pass this link on to “real” respondents as a survey URL.</p>\n<h3 id=\"user-defined-variables\" class=\"wysiwyg-text-align-justify\"><strong>User-defined variables</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><em>The survey</em> creates the survey variables for you. The necessary variables will be generated for each question. Additional variables are required in some cases. These variables (user-defined variables and URL parameters) are determined centrally in the<strong> Project properties</strong> menu on the <strong>User-defined Variables</strong> tab.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837359122\" alt=\"User-defined variables.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">URL parameters allow you to transfer variables from outside to a survey. These variables are automatically stored in the respondent’s records and can be used for filtering or dynamic output. The field report can be configured according to URL parameters.</p>\n<p class=\"wysiwyg-text-align-justify\">The parameter “a” at the end of the URL <a href=\"http://www.your-domain.com/uc/surveys/?a=3\">http://www.your-domain.com/uc/surveys/?a=3</a> indicates from which website the participant logged in. The “?” indicates the occurrence of parameters.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating URL parameters</strong></p>\n<p class=\"wysiwyg-text-align-justify\">URL parameters can be created in the <strong>User-defined variables</strong> tab of the Survey options menu.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select the number of variables from the drop-down list in the line entitled “Number of URL parameters”.</p>\n</li>\n<li>\n<p>Then click on the <strong>Submit</strong> button. The URL parameters have now been defined.</p>\n</li>\n<li>\n<p>By clicking on the<strong> Labels and data type</strong> link in the “Number of URL parameters” row, you can change the type (see the following section) and label the URL parameter. Names are used for your orientation as well as for labeling in the export record.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If, for example, texts are used instead of numbers in the URL parameter, you will need to adjust the type. Otherwise, the URL parameter will be stored incorrectly.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating user-defined variables</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Similar to the URL parameters user-defined variables are created on the tab with the same name.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select the number of variables from the drop-down list in the line entitled “Number of user-defined variables”.</p>\n</li>\n<li>\n<p>Then click on the <strong>Submit</strong> button.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing variable types and labeling</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Labels and data type</strong> link to edit the properties of the user-defined variables. By default, user-defined variables have the “Big integer” variable type; possible alternatives are “Text” and “Integer or floating point numbers” (see Table 3.9). User-defined variables can also be labeled for export at a later stage.</p>\n<p class=\"wysiwyg-text-align-justify\">The newly created user-defined variables (c_000n) are now available for questionnaire screening and will be exported along with the defined label.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"configuring-the-relevantid\" class=\"wysiwyg-text-align-justify\"><strong>Configuring the RelevantID</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><strong>EFS</strong> supports an external validation of survey participants by the service provider Imperium for a special charge. If this check has been enabled for an installation, the additional tab <strong>RelevantID configuration </strong>is displayed in anonymous and personalized surveys, panel surveys, and master data surveys. If you want to check participants of a survey on an installation with an active RelevantID check, please proceed as follows:</p>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Projects</strong> → {Selected project} → <strong>Project properties</strong> menu on the User-defined variables tab, create a variable for each data that you wish to use.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Activate the function “Check whether the respondent has JavaScript activated?” on the <strong>General Options </strong>tab.</p>\n</li>\n<li>\n<p>Tick the checkbox “Activate RelevantID check for this survey” on the relevant configuration tab.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you use Geo IP verification, you must enter the codes of the permitted countries, regions, or cities. Please contact support to receive an up-to-date list of codes.</p>\n<p class=\"wysiwyg-text-align-justify\">When using RelevantID, please pay special attention to your company’s applicable privacy regulations and the privacy regulations governing the respective survey.</p>\n<p class=\"wysiwyg-text-align-justify\">Perform the remaining settings on the tab RelevantID configuration.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Save</strong> your settings.</p>\n</li>\n</ul>\n<h2 id=\"survey-messages\" class=\"wysiwyg-text-align-justify\"><strong>Survey Messages</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In addition to the actual questionnaire texts, self-administered electronic surveys require further texts such as button labels, the labeling of progress bars and other optional elements, or error messages in case of incorrect participant entries or situations not provided for in the survey process. In <em>EFS</em> all these texts are grouped under the name<strong> Survey messages</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837365650\" alt=\"Survey messages.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>All messages required by default are available in 29 languages. If you want to conduct a project in one or more of these languages, simply select and upload the translated default version.</p>\n</li>\n<li>\n<p>You can adapt the survey messages to the specific requirements of your project. For example, you can address specific target groups using slang or more informal language.</p>\n</li>\n<li>\n<p>Survey messages can be stored in an installation-wide library and, if necessary, also used in other projects.</p>\n</li>\n<li>\n<p>Survey messages can be exported and imported into another EFS installation).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the following, you will first learn how to define and edit the survey messages for your project and, if necessary, how to store them for further use elsewhere. After that, you will be introduced to the library.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Viewing survey messages of the project</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You will find the survey messages of your project in the <strong>Projects</strong> → {Selected project} → <strong>Project properties</strong> → <strong>Survey messages</strong> menu.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The entry dialog normally shows the survey messages that are currently defined for the default language of the selected project. Please note: The button labels defined in this menu are used both for HTML buttons and for graphical form elements.</p>\n</li>\n<li>\n<p>In multilingual projects, you define a different set of survey messages for each language: use the <strong>View</strong> feature to additionally display these messages.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing survey messages of the project</strong></p>\n<p class=\"wysiwyg-text-align-justify\">There are the following options, depending on whether you want to edit individual messages or the entire set:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you merely want to change individual messages, simply overwrite the existing text and click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>If you want to replace the existing messages entirely with another set of messages from the library, please proceed as follows: Specify the correct target language in the field “Which language do you want to fill with text elements from the library?”. Then, specify the desired set in the field “Text elements you wish to copy from the survey messages library:” and confirm by clicking on <strong>Apply</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Storing survey messages of the project in the library</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to use the messages of your project in other projects, too, you can store them in the library. Click on the button <strong>Save survey messages in the library</strong>. In the subsequent dialog, enter your name and description. You also have to specify the survey messages of which project language you want to be stored. Click on <strong>Save</strong>. The messages will be added to the menu <strong>Libraries → Survey messages</strong>, where they will be available independent of the project.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"overview-of-survey-messages\" class=\"wysiwyg-text-align-justify\"><strong>Overview of Survey Messages</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">An overview of all the available survey messages can be found <a href=\"https://qbdocs.atlassian.net/wiki/spaces/DOC/pages/1421476210/Survey+Messages+Table+Overview\">here</a>.</p>\n<h3 id=\"setting-up-the-right-character-set-for-your-survey-language\" class=\"wysiwyg-text-align-justify\"><strong>Setting Up the Right Character Set for Your Survey Language</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Under<strong> Projects</strong> → {Selected project} → <strong>Project properties</strong> → <strong>Survey messages </strong>you cannot only change the text of your survey messages, but you can also choose the right character set for your survey language. Additional information, including a list of all available character sets, can be found here.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"survey-languages\" class=\"wysiwyg-text-align-justify\"><strong>Survey Languages</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Language administration can be found in the tab in the <strong>Projects → </strong>{Selected project} →<strong> Project properties</strong> → <strong>Survey languages</strong> menu. It includes the following functions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Create and edit languages</p>\n</li>\n<li>\n<p>Assign language identifier</p>\n</li>\n<li>\n<p>Set active default language</p>\n</li>\n<li>\n<p>Set language selection variable</p>\n</li>\n<li>\n<p>Copy language elements</p>\n</li>\n<li>\n<p>Language selection log</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837368082\" alt=\"Survey languages.jpg\"></p>\n<h3 id=\"overview-of-existing-languages\" class=\"wysiwyg-text-align-justify\"><strong>Overview of Existing Languages</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The overview table in the “Edit languages” section lists all existing languages of the project along with the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>ID</strong>: Each language receives an identification number from the system. This number cannot be changed. In the export data record, you will find this language identification number in the form of the “language” variable indicating the language version of the questionnaire that was displayed to the respondent.</p>\n</li>\n<li>\n<p><strong>Language</strong>: Language label. The default language is marked accordingly.</p>\n</li>\n<li>\n<p><strong>Language identifier</strong>: Serves as unique identification of language and region.</p>\n</li>\n<li>\n<p><strong>Default language</strong>: This column indicates the current default language of the project.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Depending on your access rights the following actions are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Edit languages</strong>: This opens a dialog where you can change the label and identifier of the respective language.</p>\n</li>\n<li>\n<p><strong>Print</strong>: Opens a view of the questionnaire in the respective language optimized for printing.</p>\n</li>\n<li>\n<p><strong>Rights</strong>: Opens the dialog for assigning read or write rights for the respective language to particular user teams in a targeted manner.</p>\n</li>\n<li>\n<p><strong>Use as default language</strong>:</p>\n</li>\n<li>\n<p><strong>Delete</strong>: The respective language will be deleted after a confirmation prompt.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Once you delete a language, all text elements and other settings of this language will be deleted and cannot be restored. Deleting a language will also cause errors in settings already made for the language selection question and language selection variable, as well as for language information entered in participant administration. The ID of the deleted language will no longer be subsequently re-assigned. If you re-create the same language, it will be assigned a new language ID.</p>\n<p class=\"wysiwyg-text-align-justify\">You can use the <strong>View</strong> button to hide particular columns of the table or limit the number of rows.</p>\n<h3 id=\"creating-languages\" class=\"wysiwyg-text-align-justify\"><strong>Creating Languages</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To create a new language, proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Create language</strong> button.</p>\n</li>\n<li>\n<p>In the “label” field, assign a name to the new language.</p>\n</li>\n<li>\n<p>Optionally, you can initialize the new language with phrases from an already existing language. To do so, specify your desired source language in the field “Copy language phrases from”.</p>\n</li>\n<li>\n<p>Assign a language identifier to the new language.</p>\n</li>\n<li>\n<p>Finally, confirm by clicking on <strong>Save</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837371410\" alt=\"Add new language.jpg\"></p>\n<h3 id=\"copying-language-elements\" class=\"wysiwyg-text-align-justify\"><strong>Copying Language Elements</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><em>A survey</em> allows you to copy texts from an already existing language into another language.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The “Copy language phrases from” function allows you to initialize a new language with existing phrases from another language. See the section “Create language” above.</p>\n</li>\n<li>\n<p>To fill or overwrite an already existing language with language elements from another language, specify the source and target languages in the “Copy language elements” field and confirm by clicking on <strong>Execute</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The copy function is useful if, for example, many answer categories are identical and do not require translation, e.g. if questions concern products that are marketed internationally or the names of music artists and song titles.</p>\n<h3 id=\"setting-the-active-default-language\" class=\"wysiwyg-text-align-justify\"><strong>Setting the Active Default Language</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Among the existing languages of a multilingual project, one language will be treated as the default language. That means the following:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This language will automatically be used in the output questionnaire, unless an individual language preference for the respondent has been set by defining a language selection variable or unless a language selection page has been set up.</p>\n</li>\n<li>\n<p>The language elements of the default language will appear in the questionnaire editor, whereas you can only edit the language elements of the other languages via the language editor.</p>\n</li>\n<li>\n<p>The language elements of the default language will always appear in the first column of the language editor.</p>\n</li>\n<li>\n<p>If a language element has not been filled in for another language, the finished questionnaire will show the corresponding language element of the default language instead.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To find out which language performs the function of default language, check the column “Default language” in the overview of languages. When creating a project, the system will automatically set the language that is used in the admin area by the user creating the project as the default language. I.e. if the project is created by a staff member using the English-language admin area, the default language will automatically be set to English.</p>\n<h3 id=\"changing-the-default-language\" class=\"wysiwyg-text-align-justify\"><strong>Changing the Default Language</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you wish to make edits in various languages directly in the questionnaire editor instead of using simultaneous central access to the language elements of all languages via the language element editor, you will need to change the default language. It is usually not advisable to proceed in this way because the <strong>Language editor</strong> provides convenient central access to the language elements of the various languages.</p>\n<p class=\"wysiwyg-text-align-justify\">To change the default language, find the desired new default language in the list and click on the <strong>Use as default language</strong> icon. This change will simultaneously trigger a language selection blocker. Please observe the notes on this feature in the following section.</p>\n<p class=\"wysiwyg-text-align-justify\">If the new default language was not yet fully translated before the default language change, the #undefined# marker will appear in the text elements in the <strong>questionnaire</strong> and<strong> language editors</strong> which are still empty. Missing logos and buttons will be filled with #undefined#. If no character set has been specified before the change, the character set will also be set to \"#undefined#\" and needs to be defined.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Blocking changes to the default language</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If several staff members are working in the admin area at the same time, problems might occur. These can be prevented by incorporating the language selection blocker:</p>\n<p class=\"wysiwyg-text-align-justify\">Let us assume that user A sets his or her native language, German, as the default language and starts work in the questionnaire editor. User B does not know about this and changes the default language to English. Now, user A wants to save his or her changes to the German-language questionnaire. However, while saving, the changes will not be entered in the originally set default language of German, but will instead overwrite the English text elements.</p>\n<p class=\"wysiwyg-text-align-justify\">To avoid such overlapping, the change function will be blocked for all users after a change of the default language, and the<strong> Activate language</strong> button will no longer appear.</p>\n<p class=\"wysiwyg-text-align-justify\">Only the user who last made the change as well as users with “root” rights will now see a button labeled <strong>Enable language selection</strong> instead of the <strong>Use as default language</strong> icon, and can unblock language selection by clicking on this button. The blocker remains active until the user who made the change logs out or their session ends.</p>\n<p class=\"wysiwyg-text-align-justify\">After language selection has been unblocked or the last user’s session has ended, the default language can be changed again by any user.</p>\n<h3 id=\"setting-the-output-language-via-a-language-selection-variable\" class=\"wysiwyg-text-align-justify\"><strong>Setting the Output Language Via a Language Selection Variable</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The language displayed at the start of the survey can be set via a data item known in advance, such as information from participant administration. In the “Read language selection by survey start from” drop-down list, you can define the variable from which the ID of the displayed language will be read at the start of the survey. Which variables are available depends on the project type:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><em>Anonymous projects</em>: URL parameters</p>\n</li>\n<li>\n<p><em>Personalized projects</em>: The standard variables in participant administration except <em>c_date</em> and <em>m_date</em>, and all additionally created participant variables as well as URL parameters. If you would like to use a participant variable, especially for saving language information, then use the standard variable<em> u_language</em> which was introduced especially for this purpose.</p>\n</li>\n<li>\n<p><em>Panel</em> and <em>master data surveys</em>: Participant data, master data, system data, and URL parameters.</p>\n</li>\n</ul>\n<h3 id=\"entering-the-language-setting-variable-in-participant-administration\" class=\"wysiwyg-text-align-justify\"><strong>Entering the language-setting variable in participant administration</strong></h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In language administration, specify from which variable the language setting is to be read.</p>\n</li>\n<li>\n<p>Confirm your entry by clicking on<strong> Save</strong>.</p>\n</li>\n<li>\n<p>Switch to <strong>Participant administration</strong>.</p>\n</li>\n<li>\n<p>If you select the <strong>Add participant</strong> button, you will find that the data item that was defined as the language variable (in the example shown below, the language version stored in u_language) can no longer be freely entered but only selected via a drop-down list.</p>\n</li>\n<li>\n<p>Now proceed entering or importing the participant data as usual</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If the participant data were entered before setting the language variable, the drop-down list will automatically be completed and set to the default language.<br>Then, it is necessary to add the language data for the participants. Therefore it is strongly recommended to configure languages and participant variables before adding participant data.</p>\n<h3 id=\"tracing-changes-made-in-language-administration-via-the-log\" class=\"wysiwyg-text-align-justify\"><strong>Tracing Changes Made in Language Administration via the Log</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The “Language selection log” section displays important operations within language administration (e.g. creating and deleting languages and changing the default language) in chronological order. Therefore, you can also see here, among other things, who last changed the default language and is thus responsible for unblocking the language selection.</p>\n<h2 id=\"variable-data-import\" class=\"wysiwyg-text-align-justify\"><strong>Variable Data Import</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In personalized projects and panel and master data surveys on EFS Panel installations, you can transfer the contents of variables from another project, i.e. if a participant has completed the source project, you can automatically import their answers into the variables of the second project and use them there for filtering, evaluation, and other purposes. Participation is assigned via the participant’s e-mail address.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837372818\" alt=\"Import variable data.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the<strong> Project properties</strong> → <strong>Variable data import</strong> menu.</p>\n</li>\n<li>\n<p>Select the source project</p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Select source project</strong>.</p>\n</li>\n<li>\n<p>Assign the first source variable from the source project to the respective destination variable in the current project.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Repeat this operation for all variables that have to be assigned.</p>\n</li>\n</ul>\n<h2 id=\"website-settings\" class=\"wysiwyg-text-align-justify\"><strong>Website Settings</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Project properties</strong> → The <strong>Website settings</strong> menu contains various features for adapting the display of the panel and master data surveys to the various language versions of the panel.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837375122\" alt=\"Website settings.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Controlling the survey display on the </strong><em><strong>Panel Website</strong></em></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>A survey can be hidden in a specific language version so that it does not appear on the personalized survey list on the panelists’ homepage.</p>\n</li>\n<li>\n<p>It is possible to group the surveys displayed in the survey list.</p>\n</li>\n<li>\n<p>Different survey names can be defined for display in different language versions.</p>\n</li>\n<li>\n<p>Multiple master data surveys may be activated at the same time. The website will automatically show the appropriate survey for each language version. If several master data surveys have been activated for the same language version, the survey with the smallest project ID will be displayed.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">When exporting and importing projects, the language version-specific configuration will not be included as the language versions are usually different in source and target installations. When copying projects, on the other hand, the settings are included.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The setting options in detail</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the overview table of the <strong>Project properties</strong> → <strong>Website settings</strong> menu, you can configure the following settings for each language version:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Name of the survey displayed on the website: The label that is used in the survey list on the panelists’ personalized homepage, among other things. If no language version-specific title is entered, the internal admin area project title will be used. Wildcard: {$s.survey_title}</p>\n</li>\n<li>\n<p>Survey description: Detailed description of the survey that can be used, for example, in the survey list on the panelists’ personalized homepage. If no language version-specific text is entered, the description from the „Change project“ dialog will be used. Wildcard: {$s.survey_description}</p>\n</li>\n<li>\n<p>Displayed user-defined label: Selected surveys can be highlighted with specific notes or icons. Wildcard: {$s.survey_extra_label}</p>\n</li>\n<li>\n<p>Sorting category: The surveys displayed in the survey list can be grouped by assigning them to one of ten predefined categories.</p>\n</li>\n<li>\n<p>Hide survey for language version: If this checkbox is ticked, the survey will not appear in the survey list on the panelists’ personalized homepage.</p>\n<ul>\n<li>\n<p>By default, all projects are activated in all language versions.</p>\n</li>\n<li>\n<p>Please note that panelists can still participate in a hidden survey if they are provided with a link to the survey: As usual, access to the survey depends only on the panelists’ sample membership.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Special programs allow to highlight of important surveys. The desired surveys are selected using the checkbox in the “Featured” column.</p>\n</li>\n<li>\n<p>Surveys can be visualized with images. To do so, select the desired image in the column “Image”.</p>\n</li>\n</ul>\n<h3 id=\"highlighting-surveys-in-the-survey-or-to-do-list\" class=\"wysiwyg-text-align-justify\"><strong>Highlighting surveys in the Survey or To-do List</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The survey or to-do list on the personalized homepage provides the panelists with an overview of the active panel and master data surveys. Usually, the titles are listed with the corresponding field times and bonus points. You can highlight selected surveys additionally with specific notes or icons. This makes sense, for example, in the case of new surveys, surveys with special incentives, or regular weekly surveys.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>There are three user-defined labels available which can be filled with different content or images in each language version.</p>\n</li>\n<li>\n<p>In each language version, one of these labels can be assigned to a survey.</p>\n</li>\n<li>\n<p>The user-defined labels are usually displayed along with the number of bonus points.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Defining user-defined labels and assigning them to the surveys</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you wish to use the user-defined labels, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>First, you have to adapt the user-defined labels to the respective language version. To do so, open the Configuration tab of the appropriate language version in the website editor. In the “Surveys” section you can enter the desired labels. Alternatively, you may also reference an image from the panel’s media library via an absolute link.</p>\n</li>\n<li>\n<p>In the “Displayed gratification type” column of the <strong>Projects</strong> → {Selected project} → <strong>Project properties → Website settings</strong> menu, you can define which label should be used for a survey in a specific language version.</p>\n</li>\n</ul>\n<h2 id=\"portal-settings\" class=\"wysiwyg-text-align-justify\"><strong>Portal Settings</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In this dialog, you can define if and how the project should be displayed in the portals of the panel.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014884227986\" alt=\"Portal settings.jpg\"></p>\n<h2 id=\"bonus-points-configuration\" class=\"wysiwyg-text-align-justify\"><strong>Bonus points configuration</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you wish to reward participation in a panel survey or a master data survey, you can choose among the following options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Allocation of bonus points on the system's final page: Usually, you want to reward the completion of the questionnaire. Specify the desired amount of bonus points in the menu<strong> Project properties</strong> →<strong> Survey messages</strong> menu in the “Number of bonus points to allot when reaching standard final page” field.</p>\n</li>\n<li>\n<p>Allocation of bonus points on additionally created intermediate final pages: If you want to allocate points on intermediate final pages as well, you can define the desired amounts for each page in the menu <strong>Project properties</strong> →<strong> Bonus points configuration</strong>.</p>\n</li>\n<li>\n<p>Bonus triggers: Using a bonus trigger, you can reward the arrival at a specific questionnaire page, the correct answering of a question, or another self-defined event with an allocation.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The same panelist can receive several rewards in one survey, if necessary, e.g. one reward per trigger and one reward on the final page.</p>\n<p class=\"wysiwyg-text-align-justify\">You can reward the completion of a survey with bonus points. Subtracting bonus points is not reasonable in this situation, and therefore not permitted.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Defining the reason for the allocation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The reason given in the panelists’ account statements and the bonus points log is defined on the <strong>Project properties</strong> →<strong> Survey messages</strong> menu in the „Entry into the panelist’s bonus points history“ field for all allocations of the project. If you allocate bonus points at several points of your questionnaire, please take care to enter a general, meaningful text: It is not possible to define a dedicated text for the bonus points log for every trigger and every final page.</p>\n<p class=\"wysiwyg-text-align-justify\">In multilingual projects, enter the translation of the reason in the <strong>Language editor</strong> → <strong>Survey messages</strong> menu.</p>\n<h2 id=\"template-configuration\" class=\"wysiwyg-text-align-justify\"><strong>Template configuration</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In the menu<strong> Project Properties → Template configuration </strong>you can create templates for the <em>Portals</em> module <em>Guides</em> and the <em>Portals</em> module <em>Feedback Assistant</em>.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Usage</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Under <strong>Usage,</strong> you define for which of the two <em>Portals</em> modules – <em>Guides</em> or <em>Feedback Assistant</em> – you want to create a template, and you also choose, on which of the two modules the used <em>PE</em> project should be based. Click <strong>Save</strong> after you have made your selection. Only after you have saved your settings, the connection between the <em>PE</em> project and the selected <em>Portals</em> module becomes effective. The selected <em>PE</em> project can naturally also be used for the other <em>Portals</em> module. Just choose the desired module and click on <strong>Save</strong>.</p>\n<h3 id=\"guides\" class=\"wysiwyg-text-align-justify\"><strong>Guides</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014884210194\" alt=\"image-20231002-084509.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">For the <em>Portals</em> module <em>Guides</em> you can configure the following options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Panelist variables</p>\n</li>\n</ul>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Manager variables</p>\n</li>\n<li>\n<p>Context variables</p>\n<ul>\n<li>\n<p>You can not only add context variables here but also create them.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Questions preview in guide setup</p>\n</li>\n<li>\n<p>Questions preview in guide setup (DEEP DIVE)</p>\n</li>\n<li>\n<p>Synchronize panelist data</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note: If you add a variable in the <strong>Template Configuration</strong> and you change the name of the respective master data variable afterward, you won’t be able to start guides anymore. To solve this problem, delete the old variable in the <strong>Template Configuration</strong> and add it again.</p>\n<h3 id=\"feedback-assistant\" class=\"wysiwyg-text-align-justify\"><strong>Feedback Assistant</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014837344402\" alt=\"image-20231002-084646.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">For the <em>Portals</em> module <em>Feedback Assistant</em> you can configure the following options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Basic information</p>\n<ul>\n<li>\n<p>Label</p>\n</li>\n<li>\n<p>Description</p>\n</li>\n<li>\n<p>Manager participation</p>\n</li>\n<li>\n<p>Image</p>\n</li>\n</ul>\n</li>\n<li>\n<p>MySight Dashboard</p>\n<ul>\n<li>\n<p>Project</p>\n</li>\n<li>\n<p>Workbook</p>\n</li>\n<li>\n<p>View</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Portals</p>\n</li>\n<li>\n<p>Invitation mail templates</p>\n</li>\n<li>\n<p>Reminder mail templates</p>\n</li>\n<li>\n<p>Panelist variables</p>\n</li>\n<li>\n<p>Manager variables</p>\n</li>\n<li>\n<p>Context variables</p>\n</li>\n<li>\n<p>Synchronize panelist data</p>\n</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">How do I change the default language of my survey?</h3>\n<p class=\"wysiwyg-text-align-justify\">To change the default language, go to the Survey Languages section, find the desired new default language in the list, and click on the \"Use as default language\" icon.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I reward participants with bonus points at different stages of the survey?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can allocate bonus points on the system final page, on intermediate final pages, and use bonus triggers for specific events within the survey.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">How can I highlight important surveys in the survey list?</h3>\n<p class=\"wysiwyg-text-align-justify\">In the Website Settings menu, you can use user-defined labels to highlight selected surveys with specific notes or icons. You can also mark surveys as \"Featured\" and add images to make them stand out.</p>",
    "user_segment_ids": []
}