{
    "id": 20371175830418,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371175830418.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371175830418-Blogs-Forums-and-Chats",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234598507282,
    "created_at": "2024-07-25T16:56:16Z",
    "updated_at": "2024-08-28T11:27:29Z",
    "name": "Blogs, Forums and Chats",
    "title": "Blogs, Forums and Chats",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T08:22:46Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers various community engagement tools available in the EFS Panel, including blogs, forums, chats, and downloads. These features allow panelists to interact, share information, and participate in discussions within the panel community.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">EFS Panel provides a range of tools to facilitate community engagement and interaction among panelists. This guide explains how to set up and manage blogs, forums, chats, and download sections, as well as how to moderate discussions and control access to these features.</p>\n<ul>\n<li><a href=\"#panelist-blogs\">Panelist Blogs</a></li>\n<li><a href=\"#forums\">Forums</a></li>\n<li><a href=\"#discussions\">Discussions</a></li>\n<li><a href=\"#chats\">Chats</a></li>\n<li><a href=\"#downloads\">Downloads</a></li>\n</ul>\n<h1 id=\"panelist-blogs\" class=\"wysiwyg-text-align-justify\">Panelist Blogs</h1>\n<p class=\"wysiwyg-text-align-justify\">You can allow the members of your panel community to keep their blogs. The functional scope in brief:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The panelists can keep their blogs. Depending on the goals of your research, you can realize diary-like, private blogs, which can be accessed only by their authors and the panel moderators, or public blogs which other panelists can comment on.</li>\n<li>It only takes you a few clicks to present a sample of the best blogs on an overview page on the website.</li>\n<li>From EFS 10.3, it is possible to create a teaser that automatically displays the most recent, best-rated, or most frequently rated blog content.</li>\n<li>\n<p>The blogs are created automatically when the panelists click on a corresponding link. You can create additional blogs for moderators and testers manually.</p>\n</li>\n<li>\n<p>Each blog is allocated to a particular blog section. You can set up and manage different blog sections for each language version of your website. The panelists may have one blog in each section.</p>\n</li>\n<li>\n<p>As in the forums, you can decide whether all visitors, only logged-in panelists, or only members of a specific panel group should have access to the blogs within a particular section.</p>\n</li>\n<li>\n<p>Various moderation features are available to moderators, some of which may also be used by the blogging panelist. For example, you can create private, diary-like blogs. Or you can enable the comment function and even allow anonymous comments.</p>\n</li>\n<li>\n<p>A post consists of a name, date, subject header, and body text. The names are links to the panelists’ profiles. This content structure can be edited via the template.</p>\n</li>\n<li>\n<p>You can integrate a WYSIWYG editor, thus encouraging the panelists to create appealing posts. Such an editor has been integrated into the sample pages of the standard panel.</p>\n</li>\n<li>\n<p>Optionally, you may integrate a rich text editor with which the panelists can create appealing posts. Such an editor has already been integrated into the sample pages of the standard panel. Furthermore, the panelists may embed multimedia content via special tags.</p>\n</li>\n<li>\n<p>Optionally, you can activate file upload and allow panelists to illustrate their posts with images. Just a few clicks are needed to set up appealing image galleries.</p>\n</li>\n<li>\n<p>If a panelist logs in, all posts added since the last login will be marked as new. The highlighting of new posts with a special icon or label is defined in the template.</p>\n<p> </p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example - A panelist creates her blog:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226480658\" alt=\"image2024-1-12_12-25-24.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The panelist defines the settings for her blog:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226478610\" alt=\"image2024-1-12_12-26-55.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Setting up panelist blogs involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Creating a blog section that will contain the panelists’ blogs.</li>\n<li>Creating a page for the panelists’ blogs and referencing the appropriate blog section. As soon as this page is published, the panelists can create their blogs themselves.</li>\n<li>Monitoring and, if necessary, actively controlling the blog activities.</li>\n</ul>\n<h2 id=\"managing-blog-sections\" class=\"wysiwyg-text-align-justify\"><strong>Managing Blog Sections</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The blogs are managed from the<strong> Website → Community content → Blogs</strong> menu. In this menu, you can edit existing blog sections, create new blog sections, and moderate the existing blogs.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">With read rights for “panel_blog_admin”, you can manage panelist blogs. With write rights, you can export the posts of a blog.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the blog sections</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The overview table lists all the blog sections created for the respective language version along with their titles, descriptions, and the number of blogs.</p>\n<p class=\"wysiwyg-text-align-justify\">If, in an installation with multiple websites and/or language versions, you want to view the blog sections of another language version, change the setting in the upper part of the dialog. With the <strong>View</strong> function, you can specify which table columns and how many rows per page will be displayed. You can search the contents of the overview table.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Create section</strong> button to open the dialog for creating a new blog section.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of a section to open the list of the blogs in this section. Clicking on the title of a blog will take you to the individual posts.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual blog sections:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit settings</strong>: This opens the dialog for editing the section properties.</li>\n<li>\n<strong>Edit blogs</strong>: This opens the list of the blogs in the respective section.</li>\n<li>\n<strong>Copy</strong>: The desired section will be copied. The posts will not be copied, though, as this is usually not very practical.</li>\n<li>\n<strong>Export posts</strong>: This triggers the export of all the posts in this section</li>\n<li>\n<strong>Delete</strong>: The selected section will be deleted following a confirmation prompt. Please bear in mind that all data will be irretrievably lost. If you do not need a particular blog section anymore, you should make use of the possibility to export the posts before deleting them.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Properties of blog sections</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the properties of blog sections.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 111.999%; margin-right: auto; margin-left: auto; height: 2509px;\" border=\"1\">\n<colgroup> <col style=\"width: 22.1052%;\"> </colgroup> <colgroup> <col style=\"width: 77.9175%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Website / Language version</td>\n<td>\n<p>Website and language version to which the blog section belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Section title</td>\n<td>\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>Brief explanation. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Allowed file types for file upload</p>\n</td>\n<td>\n<p>Optionally, you can allow the panelists to upload files. If at least one file type is marked as “allowed” in this field and a maximum upload file size &gt; 0 is defined in the next field, the entry form for posts and comments will contain a field for the file upload.</p>\n<p>Please mind:</p>\n<ul>\n<li>Only the file types named in the edit dialog are permitted.</li>\n<li>For films in “flv” format, EFS provides a player, i.e. they are embedded properly into the post. The display of other video formats depends on the operating system, browser, and the plugins of the panelists.</li>\n</ul>\n<p>As a moderator, you can upload files to a post via the admin area, regardless of these settings.</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"1\">Maximum upload file size</td>\n<td colspan=\"1\">\n<p>If you allow the panelists to upload files, you can define the maximum file size in this field.</p>\n<ul>\n<li>The default value is 100 kb.</li>\n<li>If you enter 0 or nothing, the upload function will not be displayed.</li>\n<li>The maximum technically possible value is installation-specific; it is displayed in the dialog.</li>\n</ul>\n<p>We recommend that you allow only the upload of very small files, as all uploaded files will have to be stored and increase the backup of the installation.</p>\n<p>If you upload files via the admin area as a moderator, you will not be restricted by the specified value. The maximum technically possible value for admins is installation-specific; in case of doubt, please check with Support.</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"1\">Access control</td>\n<td colspan=\"1\">\n<p>Select one of the following options:</p>\n<ul>\n<li>Public: All visitors of the panel can view the blog section, but only logged-in panelists may actively contribute to it.</li>\n<li>All logged-in panelists: All logged-in panelists can view the blog section, other visitors have no access.</li>\n<li>For logged-in panelists of a panel group only: If you choose this option, an additional drop-down list will be displayed where you can select a specific panel group. Only members of the selected group may view and use the blog section.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td colspan=\"1\">Publishing mode</td>\n<td colspan=\"1\">\n<p>You can specify whether the participants’ posts will be published immediately or only after they have been approved by a moderator. The available modes are:</p>\n<ul>\n<li>Publish immediately: All posts that are not blocked will be shown to all panelists.</li>\n<li>Publish after approval: Initially, the posts will only be shown to their respective author. Other panelists will only see them after they have been approved by the moderator.</li>\n</ul>\n<p>The default setting is “Publish immediately”.</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"1\">Panelists can change preselection</td>\n<td colspan=\"1\">Allows the panelist to change the setting described above.</td>\n</tr>\n<tr>\n<td>Visibility of blog</td>\n<td>\n<p>The following default settings can be selected:</p>\n<ul>\n<li>Not visible for other panelists</li>\n<li>Visible to other panelists</li>\n</ul>\n<p>By ticking the corresponding checkbox, you can allow your panelists to change the default setting themselves.</p>\n</td>\n</tr>\n<tr>\n<td>Panelists can change preselection</td>\n<td>Allows the panelist to change the setting described above.</td>\n</tr>\n<tr>\n<td>From EFS 10.4: Post: Active</td>\n<td>This option activates the granting of bonus points per post.</td>\n</tr>\n<tr>\n<td>\n<p>Post: Bonus points per blog post</p>\n</td>\n<td>\n<p>Every new post will be rewarded with a specified amount of bonus points.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Post: Maximum number of rewarded posts per panelist</p>\n</td>\n<td>\n<p>This option allows for restricting the amount of bonus points granted to very active panelists.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Post: Text in the bonus points history</p>\n</td>\n<td>Text entered in the bonus points history and the account balance.</td>\n</tr>\n<tr>\n<td>Post: Assigned bonus points</td>\n<td>Bonus points are granted for approved posts on this topic.</td>\n</tr>\n<tr>\n<td>Post: Pending bonus points</td>\n<td>Bonus points for posts that have not been approved yet.</td>\n</tr>\n<tr>\n<td>\n<p>From EFS 10.4: Comment: Active</p>\n</td>\n<td>This option activates the granting of bonus points per post.</td>\n</tr>\n<tr>\n<td>\n<p>Comment: Bonus points per blog comment</p>\n</td>\n<td>\n<p>Every new comment will be rewarded with a specified amount of bonus points.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Comment: Maximum number of rewarded posts per panelist</p>\n</td>\n<td>\n<p>This option allows for restricting the amount of bonus points granted to very active panelists.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Comment: Text in the bonus points history</p>\n</td>\n<td>Text entered in the bonus points history and the account balance.</td>\n</tr>\n<tr>\n<td>\n<p>Comment: Assigned bonus points</p>\n</td>\n<td>Bonus points are granted for approved comments on this topic.</td>\n</tr>\n<tr>\n<td>\n<p>Comment: Pending bonus points</p>\n</td>\n<td>Bonus points for comments which have not been approved yet.</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"managing-blogs\" class=\"wysiwyg-text-align-justify\"><strong>Managing Blogs</strong></h2>\n<p class=\"wysiwyg-text-align-justify\"><strong>Blog list of a section</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view the blogs of a particular section, simply click on the section title in the overview. Alternatively, you can also use the Edit Blogs icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The list will show you all the blogs within the selected section along with their descriptions, names of their authors, number of posts and comments, and other properties.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The blogs are created automatically when the panelists click on a corresponding link on the website. If you want to create additional blogs for moderators or testers, open the corresponding form by clicking on the <strong>Add Blog</strong> button.</p>\n<p class=\"wysiwyg-text-align-justify\">Clicking on the title of a blog takes you directly to the individual posts.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual blogs:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit settings</strong>: This opens the dialog for editing the blog properties</li>\n<li>\n<strong>Edit posts</strong>: Opens the list of posts.</li>\n<li>\n<strong>Export posts</strong>: This triggers the export of all posts in this blog.</li>\n<li>\n<p><strong>Delete:</strong> The selected blog will be deleted following a confirmation prompt. Please bear in mind that all data will be irretrievably lost. If you do not need a particular blog anymore, you should make use of the possibility to export the posts before deleting them.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Blog properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the properties a blog can have.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 109.474%; margin-right: auto; margin-left: auto; height: 944px;\" border=\"1\">\n<colgroup> <col style=\"width: 20.5369%;\"> </colgroup> <colgroup> <col style=\"width: 79.4851%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Website / Language version</td>\n<td>\n<p>Website and language version to which the blog belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Section title</td>\n<td>\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Blog owner</td>\n<td>\n<p>The author of the blog.</p>\n<p>When creating a blog via the admin area, you can choose the author: Panelists with the panel status “Moderator” or “Tester” are available in a drop-down list.</p>\n<p>The owner cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Number of ratings</td>\n<td>Number of community ratings that were submitted for the blog.</td>\n</tr>\n<tr>\n<td>Average rating</td>\n<td>Result of the community rating.</td>\n</tr>\n<tr>\n<td>Blog title</td>\n<td>\n<p>Title. This is displayed both in the admin area and on the panel page. Required field.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>Description of the blog. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Date</td>\n<td>\n<p>Date to be displayed in the blog overview both in the admin area and on the panel page. Required fields.</p>\n<p>By default, the current date is set when creating a new blog. It is possible, though, to have a different date displayed.</p>\n</td>\n</tr>\n<tr>\n<td>Featured</td>\n<td>\n<p>Tick this checkbox to add particularly interesting blogs to a list of recommendations.</p>\n</td>\n</tr>\n<tr>\n<td>Allow comments on blogs</td>\n<td>\n<p>The following default settings can be selected:</p>\n<ul>\n<li>Do not allow comments</li>\n<li>Allow personalized comments</li>\n<li>Allow personalized and anonymous comments: If this option is selected, the “Anonymous post” checkbox will be displayed in the comment section. If a commenting panelist ticks this checkbox, his name will not be displayed. However, the information will be logged and can be viewed by the moderator in the admin area.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Visibility of blog</td>\n<td>\n<p>The following default settings can be selected:</p>\n<ul>\n<li>Not visible for other panelists</li>\n<li>Visible to other panelists: As soon as the first post has been published, the content of the blog will become visible to other panelists.</li>\n</ul>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"editing-blog-posts-from-the-admin-area\" class=\"wysiwyg-text-align-justify\"><strong>Editing Blog Posts from the Admin Area</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">As a moderator, you can use additional features when posting from the admin area or, if necessary, change or delete posts by bloggers and readers.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Blog posts should not be deleted or changed subsequently without good reason. Use your edit options sparingly and observe the netiquette.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the posts and comments in a blog</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view the existing posts and comments in a blog in the admin area, click on the desired blog in the blog list. Alternatively, you can also use the Edit Posts icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The overview lists the titles and texts of all posts in the selected blog. It also shows the names of the authors, date, type, and release status.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Add Post</strong> button to open the dialog for creating a new post.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of a post to open its properties.</p>\n<p class=\"wysiwyg-text-align-justify\">The icons in the “Actions” column provide the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This also opens the dialog for editing the properties of an existing post.</li>\n<li>\n<strong>Delete</strong>: The selected post will be deleted following a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Properties of posts</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table provides a detailed list of all the properties a post can have.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: auto; margin-left: auto; height: 1141px;\" border=\"1\" width=\"766\">\n<colgroup> <col style=\"width: 129.0px;\"> </colgroup> <colgroup> <col style=\"width: 857.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 115px;\">Field</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 643.698px;\">Meaning</th>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Website / Language version</td>\n<td style=\"width: 635.677px;\">Website and language version to which the post belongs.</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Section title</td>\n<td style=\"width: 635.677px;\">Name of the section.</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Blog title</td>\n<td style=\"width: 635.677px;\">Title.</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Contributed by</td>\n<td style=\"width: 635.677px;\">\n<p>Author of the post or comment.</p>\n<p>When creating a post via the admin area, you can choose the author: Panelists with the panel status “Moderator” or “Tester” are available in a drop-down list.</p>\n<p>The author cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Anonymous post</td>\n<td style=\"width: 635.677px;\">\n<p>You, or optionally the blog authors, can allow the panelists to post anonymously. If a panelist ticks the corresponding checkbox before posting, his profile will not be linked - even if he has explicitly activated the display of his profile data. To prevent abuse, however, the identity of the poster will be logged so that you as a moderator can check it in the admin area.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Number of votes</td>\n<td style=\"width: 635.677px;\">Number of community ratings that were submitted for the post.</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Average rating</td>\n<td style=\"width: 635.677px;\">Result of the community rating.</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Release Status</td>\n<td style=\"width: 635.677px;\">\n<p>The following release statuses can be assigned:</p>\n<ul>\n<li>not checked: With the publishing mode set to “Publish immediately”, these posts are always displayed. With the publishing mode set to “Publish after approval”, they are displayed only to the author himself and to the moderator in the admin area until a moderator changes the release status to “approved”.</li>\n<li>approved: These posts are always displayed.</li>\n<li>blocked: These posts are never displayed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Title</td>\n<td style=\"width: 635.677px;\">Title of the post. Required field.</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Text</td>\n<td style=\"width: 635.677px;\">\n<p>The actual post. Required field.</p>\n<p>Files that were uploaded to accompany this post can be embedded in the body text using [file]filename[/file], e.g. [file]image.pdf[/file]</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Linked files</td>\n<td style=\"width: 635.677px;\">\n<p>If the author of the post has already uploaded one or more files, these will be listed in this field.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Date</td>\n<td style=\"width: 635.677px;\">\n<p>Date to be displayed in the post overview both in the admin area and on the panel page. Required fields.</p>\n<p>By default, the current date is set when creating a new post. It is possible, though, to have a different date displayed.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.979px;\">Upload file</td>\n<td style=\"width: 635.677px;\">\n<p>With this function you can upload files from the admin area. This is also possible if the upload by panelists described above is not permitted. The maximum technically possible value for admins is installation-specifc; in case of doubt, please check with Support.</p>\n<p>The files are automatically added to the post using the syntax [file]filename.jpg[/file].</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"exporting-posts-from-a-blog-section-or-selected-blog\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Posts from a Blog Section or Selected Blog</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You can export the posts from a blog section or a selected blog e.g. external evaluation. Images and other files which are used by the panelists to enrich their posts can be included, if necessary.</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, please proceed as follows: Locate the desired section or blog in the section overview or blog list and select the <strong>Export posts</strong> icon. Specify the file type (Excel or CSV) and the character set. If you need the uploaded files, tick “Export including attached files”. Click on <strong>Download</strong> and save the data on your PC.</p>\n<p class=\"wysiwyg-text-align-justify\">The export file contains all the posts from the selected blog section or blog with the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Selected user data: the author’s pseudonym (pseudonym), account name (u_account), first name (u_firstname), name (u_name), e-mail address (u_email), an alternative ID (u_other_id), and cell phone number (u_mobile)</li>\n<li>Selected system data: panel entry date (penter_date), panel status (pstatus)</li>\n<li>Blog-specific data: date and time of post (dt), blog ID (instance_id) and blog title (instance_title), post ID (id), position within the thread structure (parent), type (type; P = post, C = comment), anonymity status (anonymous; 0 = no, 1 = yes), title (title), text (description) and number and result of the community rating (rating_cont, rating_average).</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you have activated “Export including attached files”, the export file described above and the associated files will be exported in a compressed zip file. The associated files are named according to the following scheme: PostID_UserID_filename.extension.</p>\n<h2 id=\"integrating-panelist-blogs-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating Panelist Blogs into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you want to set up panelist blogs, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Panelist blog” type.</li>\n<li>Configure the setting options as required.<br>– Select the “func_blog” module template.<br>– As a template for media presentation select “tpl_media_display”. This controls the display of uploaded files.</li>\n</ol>\n<h2 id=\"providing-a-rich-text-editor-for-panelists-posts\" class=\"wysiwyg-text-align-justify\"><strong>Providing a Rich Text Editor for Panelists’ Posts</strong></h2>\n<p class=\"wysiwyg-text-align-justify\"><br>The TinyMCE rich text editor has been implemented in the blogs, forums, and discussions of standard panels. This allows the panelists to create appealing posts without great effort. The functional scope in brief:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>TinyMCE is a Javascript-based WYSIWYG editor. It is used quite frequently for internet applications. Detailed information is available at <span class=\"nolink\">http://tinymce.moxiecode</span>.com/.</li>\n<li>For use in community posts, the most important functions have been selected (bold, italic, underline, undo, redo, color).</li>\n<li>Also available is a bar with emoticons.</li>\n<li>TinyMCE does not support mobile devices. Therefore it is deactivated automatically for such devices, based on the browser identifier.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">TinyMCE is also used in the admin area of EFS, e.g. for the designing of Panel news or, more recently, for designing HTML emails and question texts.</p>\n<h2 id=\"integrating-images-in-posts-and-setting-up-image-galleries\" class=\"wysiwyg-text-align-justify\"><strong>Integrating Images in Posts and Setting up Image Galleries</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Blog and forum posts can be illustrated with images.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Per each blog or forum post multiple images can be uploaded. The necessary additional form fields are opened by clicking on the <strong>Add Fileupload</strong> button.</li>\n<li>With the familiar [file]file name[/file] tags, the images can be integrated into the text of a post.</li>\n<li>To ensure a uniform appearance, the images will be reduced automatically to thumbnails of uniform size during upload. When clicking on these thumbnails, the images will open in a separate layer. Both the size of the thumbnails and the maximum size of the images in the layer can be modified via the function modules for forums and blogs, if necessary.</li>\n<li>Blog authors are free to choose whether they want to present their images as usual within the text of their blog posts or in a special image gallery. To create an opened image gallery that allows you to conveniently flip back and forth between images, the panelists only have to tick the checkbox “Show image gallery” when publishing their posts.</li>\n</ul>\n<h2 id=\"integrating-multimedia-contents-in-posts-with-special-tags\" class=\"wysiwyg-text-align-justify\"><strong>Integrating Multimedia Content in Posts with Special Tags</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Simple tags allow panelists to embed YouTube videos or Flickr image galleries in blogs, forums, or discussion posts.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want to encourage panelists to make more use of multimedia, you may include a reference to these tags in or beneath the post form.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Videos or image galleries are only linked via the tags described, not uploaded. To learn about enabling the upload of multimedia content in posts or to a dedicated download page.</li>\n<li>For now, the new tags are not supported in IE 6.</li>\n</ul>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"><strong>The YouTube tags [youtube] and [/youtube]</strong></p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\">YouTube videos can be embedded in posts using the tags [youtube]URL[/youtube].</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li class=\"auto-cursor-target\">The URL of a YouTube video is inserted between those tags, e.g. [youtube]<span class=\"nolink\">http://www.youtube.com/watch?v=VIDEOID[/youtube].</span>\n</li>\n<li class=\"auto-cursor-target\">If the panelists insert the URL of a YouTube video using the Copy&amp;Paste function in the TinyMCE editor, the special tags are placed automatically.</li>\n<li class=\"auto-cursor-target\">By default, the videos will be displayed in a centered frame of 505 x 853 pixels. The display size can be adjusted via the CSS classes \".youtube-frame\" and \".youtube\".</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>The Flickr tags [flickr] and [/flickr]</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Flickr image galleries can be embedded in posts as slide shows using the tags [flickr]URL[/flickr].</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The URL of a Flickr image gallery is inserted between these tags, e.g. [flickr]http://www.flickr.com/photos/USERNAME/sets/SETID/[/flickr].</li>\n<li>If the panelists insert the URL of a Flickr image gallery using the Copy&amp;Paste function in the TinyMCE editor, the special tags are placed automatically.</li>\n<li>The image galleries are displayed with a size of 500 x 500 pixels. This size cannot be changed.</li>\n</ul>\n<h2 id=\"highlighting-selected-blogs\" class=\"wysiwyg-text-align-justify\"><strong>Highlighting Selected Blogs</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Community websites will often present particularly well-done or popular blogs of their members in special lists or on overview pages. In the EFS Panel, you can easily create such an overview list, e.g. to present the blogs of your star bloggers, to introduce the blogs of new panelists, or to highlight your blog.</p>\n<p class=\"wysiwyg-text-align-justify\">All you need to do is mark the desired blogs, create a list of these selected blogs, and display it in an appropriate place for the external view.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>An overview list of newly-created blogs:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226476690\" alt=\"image2024-1-12_12-32-13.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">You want to make one or several blogs available to the public?</p>\n<p class=\"wysiwyg-text-align-justify\">Use a separate blog section to create the blogs which are destined for the public.<br>Access control for this section should be set to “public”.</p>\n<p class=\"wysiwyg-text-align-justify\">Mark the blogs as “Featured”.</p>\n<p class=\"wysiwyg-text-align-justify\">Then, create a publically accessible page. Create a “List of featured panelist blogs\" function module. Reference the blog section which contains public blogs.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Setting up a blog list involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Selecting desired blogs. They should be located in one blog section which is already integrated via a function module on a panel page, and the access restrictions for that page should be the same or less restrictive as for the new overview list.</li>\n<li>Creating a page for the list and referencing the appropriate blog section. As soon as this page is published, it will be filled automatically with the selected blogs.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Selecting the Desired Blogs</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>In the <strong>Blogs</strong> menu, open the desired section by clicking on its title.</li>\n<li>Locate the desired blog and click on <strong>Edit</strong> to open the properties dialog.</li>\n<li>Tick the checkbox “Featured” and confirm by clicking on Save.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Integrating a List of Selected Blogs into the Website</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to integrate a blog list into the website, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “List of featured panelist blogs” type.</li>\n<li>Configure the setting options as required.<br>– Select the “func_blogs_featured” module template.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The overview list should be allocated to a specific blog section. There should be a page on which the blogs of that section are displayed via a function module as described above, and the access restrictions for this page should be the same or less restrictive as for the new overview list.</li>\n<li>To be displayed in the “List of featured panelist blogs”, a blog must contain at least one post.</li>\n</ul>\n<h2 id=\"teasering-blogs\" class=\"wysiwyg-text-align-justify\"><strong>Teasering Blogs</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The teaser feature newly introduced in EFS 10.3 allows to set up of a teaser that displays the most recent, best rated, or most frequently rated blog content. In most cases, these teasers will be positioned on the panelists‘ personal homepage or in a small extra window.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Integrating blog teasers into the website</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to integrate a blog list into the website, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Teaser” type.<br>– In many cases, teasers will be created on the dedicated „GLOBAL“ page and referenced.</li>\n<li>Configure the setting options as required.<br>– Select the “func_teaser” module template.</li>\n</ol>\n<h1 id=\"forums\" class=\"sc-iGrrsa eYmPYl wysiwyg-text-align-justify\"><strong>Forums</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">The forum discussion is one of the most frequently used qualitative feedback collection methods. Therefore, this feature is quite closely integrated with EFS’s central standard functions.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Forum discussions can be created and managed as separate projects from within the project list.</li>\n<li>The to-do list allows to display of forum discussions along with quantitative surveys on the panelists’ personal homepages.</li>\n<li>You can decide for yourself whether you want to use these display options. If you wish to use them, open the dialog Edit settings for all forum topics which are to be displayed and tick the checkbox “Treat as qualitative project”. If you create your forum topics from within the project list, this option will be enabled automatically.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For designing and operating forums, EFS opens up a wide variety of possibilities:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You can use the “Forum” function module to position one or more forums on a panel page. There can be forum discussions on several topics on each forum.</li>\n<li>There are several levels:<strong> Forum discussions &gt; Topics &gt; Threads &gt; Posts</strong>. Threads can be started by the panelists themselves. If necessary, you can lock them, keeping the content accessible but blocking further posts.</li>\n<li>New contributions and those made by moderators are specially marked.</li>\n<li>The visibility of key posts can be improved by “stickying” them above the thread.</li>\n<li>From EFS 10.3, it is possible to create a teaser that automatically displays the most recent, best rated, or most frequently rated forum threads or posts.</li>\n<li>You can award bonus points for participation in forum discussions.</li>\n<li>\n<p>Optionally, you can allow panelists to upload files to illustrate their posts. Just a few clicks are necessary to set up appealing image galleries. Furthermore, tags can be used to insert multimedia content.</p>\n</li>\n<li>\n<p>You can either allow all visitors to read forum posts, only permit logged-in panelists to do so, or even restrict access to certain panel groups. As a rule, only logged-on panelists can post contributions.</p>\n</li>\n<li>\n<p>You can use a panelist account with the special “Moderator” or “Tester” status to act as a moderator in forum discussions,. If you post using such an account from the admin area, you can make use of various additional features.</p>\n</li>\n<li>\n<p>You can create separate forums for each language version of the website(s). Copying a language version also copies the related forum. However, the posts belonging to these forums are not copied, as this is usually not advisable.</p>\n</li>\n<li>\n<p>You can use the “func_forum” template to structure the forum layout as desired. In the standard panel, which, as usual, serves as an example in the following chapters, the layout is kept simple to make editing easier.</p>\n</li>\n<li>\n<p>You can create as many forums as you like. Please mind, though, that the resulting amounts of data may affect the performance of the panel installation.<br>– Please use the following guiding values for orientation: At most 50 topics per forum, at most 100 threads per topic, at most 25 post levels inside a thread, and most 1,000 posts per thread.<br>– Furthermore, you can export the posts of old forums resp. topics and subsequently delete the forums resp. topics.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Forums are maintained with the help of a specially developed optimized GUI. This means that a user who is not familiar with the CMS can take over their maintenance without requiring a great deal of training.</p>\n<p class=\"wysiwyg-text-align-justify\">This chapter shows you how to create bulletin boards and moderate discussions from the admin area:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The forum is shown from a panelist’s perspective.</li>\n<li>You will learn how to create and maintain forums from the admin area.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The forum discussions of the selected forum are displayed on the panel page containing the “Forum” function module.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>A panelist opens the list of forum discussions:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017213611026\" alt=\"image2024-1-15_9-34-11.png\"></p>\n<h2 id=\"creating-and-managing-qualitative-projects\" class=\"wysiwyg-text-align-justify\"><strong>Creating and Managing Qualitative Projects</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Forum discussions can be created and managed as separate qualitative projects from within the project list.</p>\n<p class=\"wysiwyg-text-align-justify\">The features in brief:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Forum discussions are integrated into the project list and the field overview.</li>\n<li>Optionally, you can create the forum discussions via the familiar Create project menu.</li>\n<li>If you open a forum discussion from within the project list, the contents will be presented in a navigation structure corresponding to the familiar EFS survey projects.</li>\n<li>Possible project statuses are “active” and “inactive”.</li>\n<li>In contrast to quantitative projects, forum discussions have no project ID, no author, and no project directory. Therefore, these data cannot be retrieved by the search features in the project list and field overview. Furthermore, forum discussions cannot be sorted into folders.</li>\n<li>The forum discussions can be displayed along with quantitative surveys on the panelists’ personal homepages.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Forum discussions in the project list:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><strong><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226483986\" alt=\"forumdiscussionsinprojectlist.png\"></strong></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Please mind that only the most important features of the project list and field overview are supported for forum discussions. In particular, the actions in the project list are not available for forum discussions, furthermore, neither archiving nor import and export can be used.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Activation and access control</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Two requirements must be met to use the display options described above:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You have to activate the display of the forum discussions. To do this, enter the website editor and open the list of topics. For the topics to be displayed, open the dialog<strong> Edit settings</strong> and tick the checkbox “Treat as qualitative project”. If you create your forum topics from within the project list, this option will be enabled automatically.</li>\n<li>Access rights must be configured appropriately. Access via the project list is controlled with the same rights as in the website menu.<br>– To open a forum discussion from the project list, user teams need to write rights for “board_admin” and read rights for the forum.<br>– To create qualitative projects themselves, user teams need read rights for “cr_project”, write rights for “board_admin” and read rights for the referenced forum.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating qualitative projects</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can keep creating forum topics, as usual, via <strong>Website → Community content → Forum → {Selected forum}</strong>. Alternatively, you can also use the familiar Create project function in the<strong> Projects</strong> module.</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li class=\"auto-cursor-target\">Open the <strong>Create Projects</strong> dialog.<br><br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226483090\" alt=\"createproject_forum.png\"><br><br>\n</li>\n<li class=\"auto-cursor-target\">\n<p>Select “Forum discussion”.</p>\n</li>\n<li class=\"auto-cursor-target\">\n<p>The dialog is changed automatically.</p>\n</li>\n<li class=\"auto-cursor-target\">\n<p>Enter all usual properties of the topic. In the “Forum” drop-down list, select the forum into which you want to insert the forum discussion. If the desired forum is not selectable, check if the necessary read rights for this forum are missing.</p>\n</li>\n<li class=\"auto-cursor-target\">\n<p>Confirm with<strong> Execute</strong>.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Accessing forum features via the menu</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you open a forum discussion via the project list, the contents will be presented in a way that is analog to the other project types of EFS:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The survey menu lists the most important information on the project.</li>\n<li>The<strong> Project properties</strong> menu contains the familiar properties of forum topics.</li>\n<li>The <strong>Contents</strong> menu contains the threads and posts, in analogy to the Website menu.</li>\n<li>The <strong>Export</strong> menu contains the familiar Export options.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226481938\" alt=\"projectinformation.png\"></p>\n<h2 id=\"managing-forums\" class=\"wysiwyg-text-align-justify\"><strong>Managing Forums</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The starting point for forum management is the menu <strong>Website → Panel websites → {Selected language version} → Forums</strong>. In this menu, you can edit forums, start new topics, and administrate ongoing discussions.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Forum overview</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The forum overview contains all forums created for the specified language version including name, description, and number of topics.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want to view forums of another language version in a given installation with several websites and/or language versions, simply change the settings in the upper section of the dialog. You can use the View function to change the number of table columns displayed as well as the number of rows per page. You can search the content of the overview table.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you click on the <strong>Create Forum</strong> button, the dialog for creating a new forum is opened.</p>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the title of a forum, you open its list of topics. Click the title of the topic, and you will get to the individual posts.</p>\n<p class=\"wysiwyg-text-align-justify\">Use the icons in the “Actions” column to edit individual forums:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: Opens the dialog for changing forum properties. For detailed information on the properties.</li>\n<li>\n<strong>Edit topics</strong>: Opens the list of topics of the selected forum.</li>\n<li>\n<strong>Copy</strong>: Copies the selected forum. The posts are not copied, as this is usually not advisable.</li>\n<li>\n<strong>Export posts</strong>: Triggers an export of all posts of the forum.</li>\n<li>\n<strong>Assign bonus points</strong>: The form for assigning bonus points to the participants is open.</li>\n<li>\n<strong>Set rights</strong>: You can restrict the access rights of user teams to individual forums.</li>\n<li>\n<p><strong>Delete</strong>: The forum is deleted after a confirmation prompt. Please note that all data are irrevocably lost in the process. If you no longer need a certain forum, we recommend exporting the posts before deleting them.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Forum Properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the properties a forum can have.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: auto; margin-left: auto;\" border=\"1\">\n<colgroup> <col> <col> <col> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Wildcard</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Name of forum</td>\n<td>{$board.board_title}</td>\n<td>\n<p>Title of the forum. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>{$board.board_description}</p>\n</td>\n<td>\n<p>Brief description. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"creating-and-managing-topics\" class=\"wysiwyg-text-align-justify\"><strong>Creating and Managing Topics</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">A forum usually contains different topics for discussion, which are specified by the administrator. The panelists can start threads related to a topic and post contributions, but cannot create topics themselves.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>List of topics</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view a forum’s topics, just click on its title in the forum overview. Alternatively, use the <strong>Edit Topics</strong> icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The list of topics contains all topics of the selected forum with description, number of threads, field period, and status.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you click on the <strong>Add Topic</strong> button, the dialog for creating a new topic is opened.<br>By clicking on the title of a topic, you will get to the individual posts.</p>\n<p class=\"wysiwyg-text-align-justify\">Use the icons in the “Actions” column to edit individual topics:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: Opens the dialog for changing topic properties. For detailed information on the properties.</li>\n<li>\n<strong>Edit posts</strong>: Opens the list of posts.</li>\n<li>\n<strong>Copy</strong>: Copies the selected topic. The posts belonging to the topic are not copied, and this is usually not advisable.</li>\n<li>\n<strong>Export posts</strong>: Triggers an export of all posts of the topic.</li>\n<li>\n<strong>Delete</strong>: The topic is deleted after a confirmation prompt. Please note that all data are irrevocably lost in the process. If you no longer need a certain topic, we recommend exporting the posts before deleting them.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Topic Properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all properties a topic can have.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 100.362%; margin-right: auto; margin-left: auto; height: 2780px;\" border=\"1\">\n<colgroup> <col style=\"width: 23.8975%;\"> </colgroup> <colgroup> <col style=\"width: 16.7585%;\"> </colgroup> <colgroup> <col style=\"width: 59.3348%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Wildcard</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>\n<p>Website / Language version</p>\n</td>\n<td> </td>\n<td>\n<p>Website and language version to which the topic belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Name of forum</td>\n<td>{$board.board_title}</td>\n<td>\n<p>Forum to which the topic belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Topic</td>\n<td>{$s.topic_title}</td>\n<td>\n<p>Discussion topic. This is displayed both in the admin area and on the panel page. Mandatory entry.</p>\n</td>\n</tr>\n<tr>\n<td>Topic description</td>\n<td>{$s.topic_description</td>\n<td>\n<p>Topic description. For orientation in the admin area, but can optionally be integrated into the panel page using wildcards.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>From EFS 10.4: Image</p>\n</td>\n<td> </td>\n<td>\n<p>Optionally, an image can be used to illustrate the topic.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Field period from... / until...</p>\n</td>\n<td> </td>\n<td>\n<p>At the defined dates, the topic will be put online resp. offline automatically.</p>\n</td>\n</tr>\n<tr>\n<td>Access control</td>\n<td> </td>\n<td>\n<p>Select one of the following options:</p>\n<ul>\n<li>Public: All panel visitors can see the forum, but only logged-in panelists can post.</li>\n<li>All logged-in panelists: All logged-in panelists can see the forum, other visitors have no access.</li>\n<li>For logged-in panelists of a panel group only: If you choose this option, a drop-down list is displayed, from which you can select a certain panel group. Only members of the selected group can see and use the forum.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Treat as a qualitative project</p>\n</td>\n<td> </td>\n<td>\n<p>If the checkbox is activated, the topic will be treated as a qualitative project, i.e. it will be integrated into the project list of the admin area. If you have set up a to-do list for your panelists, it will be displayed in that list, too.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Displayed date of creation</p>\n</td>\n<td> </td>\n<td>\n<p>The date is displayed in the list of topics both in the admin area and on the panel page. Mandatory entry.</p>\n<p>By default, the current date is set when you add a topic; however, a different date can also be displayed.</p>\n</td>\n</tr>\n<tr>\n<td>Read-only</td>\n<td> </td>\n<td>\n<p>If this option is activated, panelists cannot publish new posts. Board administrators can still publish and edit posts in the admin area.</p>\n</td>\n</tr>\n<tr>\n<td>Allow threads</td>\n<td> </td>\n<td>\n<p>If this option is activated, panelists can create new threads.</p>\n</td>\n</tr>\n<tr>\n<td>Publishing mode</td>\n<td> </td>\n<td>\n<p>You can decide for yourself if the posts of the participants should be published immediately or only with the approval of a moderator. Available publishing modes are:</p>\n<ul>\n<li>Publish immediately: All posts that are not blocked are displayed to all panelists.</li>\n<li>Publish after approval: Initially, posts can only be seen by their respective author. Other panelists can only see the posts after a moderator has set their release status to “approved”.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Allowed file types for file upload</p>\n</td>\n<td> </td>\n<td>\n<p>Optionally, you can allow panelists to upload files. If you check at least one file type as “permitted” and a maximum upload file size &gt; 0 is defined in the neighboring field, a file upload field will be displayed on the panel’s board page.</p>\n<p>Please mind:</p>\n<ul>\n<li>Only the file types named in the edit dialog are permitted.</li>\n<li>For films in “flv” format, EFS provides a player, i.e. they are embedded properly into the post. The display of other video formats depends on the operating system, browser, and the plugins of the panelists.</li>\n</ul>\n<p>As a moderator, you can upload files into posts via the admin area, regardless of the settings made here.</p>\n</td>\n</tr>\n<tr>\n<td colspan=\"1\">\n<p>Maximum upload file size</p>\n</td>\n<td colspan=\"1\"> </td>\n<td colspan=\"1\">\n<p>If you enable file upload for panelists, you can specify the maximum file size in this field.</p>\n<ul>\n<li>The default value is 100 kb.</li>\n<li>If you enter “0” or do not enter anything, the file upload function will be hidden.</li>\n<li>The maximum technically possible value is installation- specifc; it is displayed in the dialog.</li>\n</ul>\n<p>We recommend only permitting the upload of very small files, as all uploaded files must be stored and increase the size of the installation’s backup.</p>\n<p>If you upload files as board administrator via the admin area, the settings made do not impose any restrictions on the size of files you upload. The maximum technically possible value for admins is installation-specifc; in case of doubt, please check with Support.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>From EFS 10.4: Active</p>\n</td>\n<td> </td>\n<td>\n<p>This option activates the granting of bonus points per post.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Bonus points per forum post</p>\n</td>\n<td> </td>\n<td>\n<p>Every new post within a topic will be rewarded with a specified amount of bonus points.</p>\n<p>When creating a new thread, the first post within the thread is created automatically, too. This initial post is rewarded, too.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Maximum number of rewarded posts per panelist</p>\n</td>\n<td> </td>\n<td>\n<p>This option allows for restricting the amount of bonus points granted to very active panelists.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Text in the bonus points history</p>\n</td>\n<td> </td>\n<td>\n<p>Text entered in the bonus points history and the account balance.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Assigned bonus points</p>\n</td>\n<td> </td>\n<td>Bonus points are granted for approved posts on this topic.</td>\n</tr>\n<tr>\n<td>\n<p>Pending bonus points</p>\n</td>\n<td> </td>\n<td>\n<p>Bonus points for posts that have not been approved yet.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"creating-and-managing-threads\" class=\"wysiwyg-text-align-justify\"><strong>Creating and Managing Threads</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">A topic usually contains different discussion threads. They are started by the moderator or, if you configure the topic accordingly, by the panelists as well.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Please mind: In panels set up with EFS 7.1 or later, threads are implemented in the forum templates from the beginning. In older upgraded panels, it is necessary to adapt the forum templates. Should this be the case in your panel, please contact Support.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of threads for a topic</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view existing threads for a topic in the admin area, just click the title of the desired topic in the topic list. Alternatively, use the<strong> Edit Posts</strong> icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The list of threads contains all threads of the selected topic with several posts, “Locked” status, and rating statistics.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you click on the Add thread button, the dialog for creating a new thread is opened.</p>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the title of a thread, you will get to the individual posts.</p>\n<p class=\"wysiwyg-text-align-justify\">If you click on the No link in the “Locked” column, the panelists keep read access to the thread, but they cannot post anymore.</p>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.4: If you click on the No link in the “Sticky” column, the thread is positioned at a fixed position at the top of the thread list and marked with a dedicated icon.</p>\n<p class=\"wysiwyg-text-align-justify\">Use the icons in the “Actions” column to edit individual threads:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Delete: The thread is deleted after a confirmation prompt. Please note that all data are irrevocably lost in the process. If you no longer need a certain thread, we recommend exporting the posts before deleting it.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">From EFS 10.6: You can bulk-delete several threads at once by ticking the checkboxes of the superfluous threads and selecting „Delete threads“ in the drop-down list below.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Thread properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all properties a thread can have in detail.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: 0px; margin-left: auto; height: 1032px;\" border=\"1\" width=\"748\">\n<colgroup> <col> <col> </colgroup>\n<tbody>\n<tr style=\"height: 22px;\">\n<th class=\"wysiwyg-text-align-center\" style=\"height: 22px; width: 120.642px;\">Field</th>\n<th class=\"wysiwyg-text-align-center\" style=\"height: 22px; width: 620.052px;\">Meaning</th>\n</tr>\n<tr style=\"height: 67px;\">\n<td style=\"height: 67px; width: 112.622px;\">\n<p>Website / Language version</p>\n</td>\n<td style=\"height: 67px; width: 612.031px;\">\n<p>Website and language version to which the thread belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr style=\"height: 44px;\">\n<td style=\"height: 44px; width: 112.622px;\">Name of forum</td>\n<td style=\"height: 44px; width: 612.031px;\">Forum to which the thread belongs. Cannot be changed subsequently.</td>\n</tr>\n<tr style=\"height: 22px;\">\n<td style=\"height: 22px; width: 112.622px;\">Topic</td>\n<td style=\"height: 22px; width: 612.031px;\">Discussion topic to which the thread belongs. Cannot be changed subsequently.</td>\n</tr>\n<tr style=\"height: 125px;\">\n<td style=\"height: 125px; width: 112.622px;\">Contributed by</td>\n<td style=\"height: 125px; width: 612.031px;\">\n<p>Author of the thread.</p>\n<p>If you add new threads via the admin area, you can select the author: In a dropdown list, panelists with “Moderator” or “Tester” panel status can be selected.</p>\n<p>The author cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr style=\"height: 197px;\">\n<td style=\"height: 197px; width: 112.622px;\">Release Status</td>\n<td style=\"height: 197px; width: 612.031px;\">\n<p>The following release statuses can be assigned:</p>\n<ul>\n<li>\n<strong>not checked</strong>: If publishing mode “Publish immediately” is selected, threads with this status will be visible to everybody. If the publishing mode “Publish after approval” is selected, they will be visible only to their author and the moderators in the admin area, until a moderator changes the release status to “approved”.</li>\n<li>\n<strong>approved</strong>: these threads are always displayed.</li>\n<li>\n<strong>blocked</strong>: these threads are never displayed.</li>\n</ul>\n</td>\n</tr>\n<tr style=\"height: 51px;\">\n<td style=\"height: 51px; width: 112.622px;\">Title</td>\n<td style=\"height: 51px; width: 612.031px;\">\n<p>Title of the threads.</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n<tr style=\"height: 103px;\">\n<td style=\"height: 103px; width: 112.622px;\">Text</td>\n<td style=\"height: 103px; width: 612.031px;\">\n<p>Actual thread.</p>\n<p>Using [file]filename[/file], you can embed files uploaded for this thread in the thread text. e.g. [file]image.pdf[/file]</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n<tr style=\"height: 44px;\">\n<td style=\"height: 44px; width: 112.622px;\">Linked files</td>\n<td style=\"height: 44px; width: 612.031px;\">\n<p>If the author of the thread has already uploaded one or more files they will be displayed in this field.</p>\n</td>\n</tr>\n<tr style=\"height: 96px;\">\n<td style=\"height: 96px; width: 112.622px;\">Date</td>\n<td style=\"height: 96px; width: 612.031px;\">\n<p>The date is displayed in the list of threads both in the admin area and on the panel page. Mandatory entry.</p>\n<p>By default, the current date is set when you create a thread, however, a different date can also be displayed.</p>\n</td>\n</tr>\n<tr style=\"height: 141px;\">\n<td style=\"text-align: left; height: 141px; width: 112.622px;\">Upload file</td>\n<td style=\"text-align: center; height: 141px; width: 612.031px;\">\n<p>This field enables you to upload files from the admin area. It allows to upload of files even if the upload option for panelists described above is not permitted. The maximum technically possible value for admins is installation-specifc; in case of doubt, please check with Support.</p>\n<p>The files are automatically added to the thread, using the syntax [file]filename.jpg[/file]</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"editing-forum-posts-from-the-admin-area\" class=\"wysiwyg-text-align-justify\"><strong>Editing Forum Posts from the Admin Area</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">As moderator you can make use of additional features for your contributions when posting via the admin area or, if required, change or remove posts of discussion participants.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">It is considered polite not to subsequently delete or edit posts of discussion participants without a good reason. You should therefore use the editing options with care and observe netiquette.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of topic posts</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view existing topic posts in the admin area, just click the title of the desired topic in the topic list. Alternatively, use the Edit Posts icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The overview lists all posts for the selected topic and their most important properties.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you click on the Add Post button, the dialog for creating a new post is opened.</p>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the title of a topic, you will get to the properties of an existing post.</p>\n<p class=\"wysiwyg-text-align-justify\">Using the yes / no links in the “Sticky” column, you can display a key post in a highly visible position above the thread.</p>\n<p class=\"wysiwyg-text-align-justify\">The icons in the “Actions” column give the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: Opens the edit dialog for the properties of an existing post.</li>\n<li>\n<strong>Delete</strong>: The post is deleted after a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Post Properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all properties a post can have in detail.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 106.428%; margin-right: auto; margin-left: auto; height: 1724px;\" border=\"1\">\n<colgroup> <col style=\"width: 28.1196%;\"> </colgroup> <colgroup> <col style=\"width: 71.871%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>\n<p>Website / Language version</p>\n</td>\n<td>\n<p>Website and language version to which the post belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Name of forum</td>\n<td>Forum to which the post belongs. Cannot be changed subsequently.</td>\n</tr>\n<tr>\n<td>Thread title</td>\n<td>Discussion thread to which the post belongs. Cannot be changed subsequently.</td>\n</tr>\n<tr>\n<td>Contributed by</td>\n<td>\n<p>Author of the post.</p>\n<p>If you add new posts via the admin area, you can select the author: In a dropdown list, panelists with “Moderator” or “Tester” panel status can be selected.</p>\n<p>In the standard panel, these panelists’ posts are marked with the abbreviation “Mod” to indicate that they are moderator posts. The abbreviation is inserted using the wildcard „board_moderator_label“, i.e. you can edit it in the menu <strong>Wildcards</strong>.</p>\n<p>The author cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Sort underneath the following post</p>\n</td>\n<td>\n<p>If you add new posts via the admin area, use this drop-down list to define the position in the thread structure.</p>\n</td>\n</tr>\n<tr>\n<td>Number of ratings</td>\n<td>Number of community ratings that were submitted for the post.</td>\n</tr>\n<tr>\n<td>Average rating</td>\n<td>Result of the community rating.</td>\n</tr>\n<tr>\n<td>Anonymous post</td>\n<td>\n<p>Optionally, you can permit anonymous posting. To prevent abuse, it will of course be logged internally who authored such anonymous posts, and moderators can access this information in the admin area. In the field “Anonymous post”, you can see if a post was made anonymously.</p>\n</td>\n</tr>\n<tr>\n<td>Release Status</td>\n<td>\n<p>The following release statuses can be assigned:</p>\n<ul>\n<li>not checked: If the publishing mode “Publish immediately” is selected, posts with this status will be visible to everybody. If the publishing mode “Publish after approval” is selected, they will be visible only to their author and the moderators in the admin area, until a moderator changes the release status to “approved”.</li>\n<li>approved: these posts are always displayed.</li>\n<li>blocked: these posts are never displayed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Only editable via the list of posts: Sticky</p>\n</td>\n<td>\n<p>A post marked as “sticky” will be displayed in a highly visible position above the discussion, in addition to its original position. If the thread is distributed on several pages, the “sticky” post will be placed above the thread on all following pages, too.</p>\n<p>Please note: Only one post per discussion can be marked as “sticky”. As soon as you mark a second post as “sticky”, the “sticky” flag will be deactivated for the first post.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Only visible in the list of posts: Date of change</p>\n</td>\n<td>\n<p>If a panelist has subsequently edited a post, the date and time of the change will be displayed.</p>\n</td>\n</tr>\n<tr>\n<td>Title</td>\n<td>\n<p>Title of the post.</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n<tr>\n<td>Text</td>\n<td>\n<p>Actual post.</p>\n<p>Using [file]filename[/file], you can embed files uploaded for this post in the post text. e.g. [file]image.pdf[/file]</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n<tr>\n<td>Linked files</td>\n<td>\n<p>If the author of the post has already uploaded one or more files they will be displayed in this field.</p>\n</td>\n</tr>\n<tr>\n<td>Date</td>\n<td>\n<p>The date is displayed in the list of posts both in the admin area and on the panel page.</p>\n<p>Mandatory entry.</p>\n<p>By default, the current date is set when you create a post, however, a different date can also be displayed.</p>\n</td>\n</tr>\n<tr>\n<td>Upload file</td>\n<td>\n<p>This field enables you to upload files from the admin area. It allows to upload of files even if the upload option for panelists described above is not permitted.</p>\n<p>The files are automatically added to the post, using the syntax [file]filename.jpg[/file]</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"linking-from-forum-posts-to-surveys\" class=\"wysiwyg-text-align-justify\"><strong>Linking from Forum Posts to Surveys</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Good community moderators keep switching between different methods of communication and surveys. For example, ideas developed during brainstorming in the forum may be tested with a quantitative survey of a larger number of participants. Afterward, interesting comments from the survey will be played back to the community and discussed in the forum. To achieve smoother transitions between different survey methods, a dedicated function allows moderators to insert direct access codes for panel surveys in their forum posts.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>When you prepare your moderator post in the admin area, you will find an <strong>Insert survey link</strong> button above the entry form. Clicking on this button will prompt a window where you can select the desired survey. The syntax for the link will then be inserted into your post automatically.</li>\n<li>If a panelist belonging to an active sample of this survey reads your post, he will see his personal clickable authentication link.</li>\n</ul>\n<h2 id=\"assigning-bonus-points\" class=\"wysiwyg-text-align-justify\"><strong>Assigning Bonus Points</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In many communities, bonus points are awarded for participation in forum discussions. From EFS 10.4, the bonus points can be awarded automatically. But manual, focused allocations are possible as well.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Assigning bonus points</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>To assign points, click on the <strong>Assign bonus points</strong> icon in the overview.</li>\n<li>Fill in the form.</li>\n<li>Confirm by clicking on <strong>Check</strong>.</li>\n<li>The software then checks how many panelists the specified criteria apply to and how many bonus points will be assigned if you proceed.</li>\n<li>Click on <strong>Assign Points</strong> to trigger the assignment of points.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Configuration options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists the configuration options for the assignment of bonus points.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: 0px; margin-left: auto;\" border=\"1\">\n<colgroup> <col> <col> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Website / Language version</td>\n<td>\n<p>Website and language version to which the forum belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Text for bonus points history</td>\n<td>\n<p>Text entered in the bonus points history and displayed on the standard panel’s “Account balance” page.</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Bonus points are creditable per post</p>\n</td>\n<td>\n<p>Number of bonus points assigned per post.</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Maximum number of points (cap) creditable per panel</p>\n</td>\n<td>\n<p>Maximum number of points that can be assigned to a panelist. Defining such a cap helps you prevent panelists from artificially inflating their number of posts.</p>\n</td>\n</tr>\n<tr>\n<td>Exclude testers from crediting</td>\n<td>\n<p>Ticking this checkbox allows you to exclude panelists with a tester status from the assignment of bonus points.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Assign points for postings from /until</p>\n</td>\n<td>\n<p>Period for which points are to be assigned. Automatically filled with the current date.</p>\n<p>Mandatory entry.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"exporting-posts-from-a-forum-or-a-selected-topic\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Posts from a Forum or a Selected Topic</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You can export the posts of a forum or a selected topic, e.g. for external analysis. Images and other files which are used by the panelists to enrich their posts can be included, if necessary.</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, please proceed as follows: Search for the forum you wish to select in the forum overview or the topic in the topic list, respectively. Specify the file type (Excel or CSV) and the character set. If you need the uploaded files, tick “Export including attached files”. Click on Download and save the data on your PC.</p>\n<p class=\"wysiwyg-text-align-justify\">The export file contains all posts of the forum or the topic, respectively, with the following details:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Selected panelist data: The author’s pseudonym (pseudonym), account name (u_account), first name (u_firstname), name (u_name), e-mail address (u_email), an alternative ID (u_other_id) and cell phone number (u_mobile)</li>\n<li>Selected system data: Panel entry date (penter_date), panel status (pstatus)</li>\n<li>Forum-specific data: Date and time of post (dt), ID (topic_id) and title (topic_title) of the topic, post ID (id), position in the thread structure (path), title (title), text (description) and number and result of the community rating (rating_cont, rating_average).</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you have activated “Export including attached files”, the export file described above and the associated files will be exported in a compressed zip file. The associated files are named according to the following scheme: TopicD_UserID_filename.extension.</p>\n<h1 id=\"discussions\" class=\"sc-iGrrsa eYmPYl wysiwyg-text-align-justify\"><strong>Discussions</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">If you want to encourage a quick exchange of ideas among your panelists or create a guestbook, you can create a discussion.</p>\n<p class=\"wysiwyg-text-align-justify\">The discussion tool is the “light” version of the forum. You can use it for types of communication that are characterized by a quick and unstructured sequence of short posts, such as a bulletin board or a guestbook, for example. For detailed discussions requiring a thread structure and features such as “reply w/quote” or embedding images, you may want to use the familiar forum.</p>\n<p class=\"wysiwyg-text-align-justify\">Due to its flexibility, the discussion tool supports a variety of different scenarios:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You can create and manage various discussions (“discussion sections”) for each language version of your website.</li>\n<li>From EFS 10.3, it is possible to create a teaser that automatically displays the most recent, best rated, or most frequently rated discussion posts.</li>\n<li>As in the forum, you can decide whether all visitors, only panelists, or only members of a specific panel group will be permitted to visit a discussion and whether the panelists may be actively involved in any discussions or merely allowed to read.</li>\n<li>The moderation features familiar from the forum (e.g. selection of publishing mode, stickying) are available as well.</li>\n<li>A simple WYSIWYG editor allows the panelists to create appealing posts. Such an editor has been integrated into the sample pages of the standard panel.</li>\n<li>A post usually consists of a name, date, and body text. It is up to you to decide whether a subject header should be used.</li>\n<li>If a panelist posts a new comment, an automatic reload of the list is triggered.</li>\n<li>You can create as many discussions as you like. Please mind, though, that the resulting amounts of data may affect the performance of the panel installation. Therefore, it is recommended to limit the discussions to at most 1,000 posts. Furthermore, you can export the posts of old discussions and subsequently delete the discussions.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Setting up a discussion involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Creating a discussion section.</li>\n<li>Publishing a first post and/or enabling the panelists to post.</li>\n<li>Creating a page for the discussion and referencing the appropriate section.</li>\n<li>Monitoring, and if necessary, actively controlling the discussion if the panelists are allowed to post.</li>\n</ul>\n<h2 id=\"managing-discussions\" class=\"wysiwyg-text-align-justify\"><strong>Managing Discussions</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The discussions are managed from the <strong>Website → Panel websites → {Selected language version} → Discussions</strong> menu. In this menu, you can edit existing discussion sections, create new sections, and moderate ongoing discussions.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">With read rights for “panel_messages”, you can manage discussions. With write rights, you can export the posts of a discussion.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of discussions</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The overview table lists all the discussion sections created for the respective language version along with their titles, descriptions, and the number of posts.</p>\n<p class=\"wysiwyg-text-align-justify\">If, in an installation with multiple websites and/or language versions, you want to view the discussions of another language version, change the setting in the upper part of the dialog. With the View function, you can specify which table columns and how many rows per page will be displayed. You can search the contents of the overview table.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Create section</strong> button to open the dialog for creating a new discussion section. .</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of a discussion section to open the list of the existing posts. Click on the topic of a post to edit its properties.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual discussion sections:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This opens the dialog for editing the section properties.</li>\n<li>\n<strong>Show posts</strong>: Opens the list of posts.</li>\n<li>\n<strong>Copy</strong>: The desired section will be copied. The posts will not be copied, though, as this is usually not very practical.</li>\n<li>\n<strong>Export posts</strong>: This triggers the export of all the posts in this section.</li>\n<li>\n<strong>Delete</strong>: The selected section will be deleted following a confirmation prompt. Please bear in mind that all data will be irretrievably lost. If you do not need a particular section anymore, you should make use of the possibility to export the posts before deleting them.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Discussion properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the properties a discussion section can have.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 108.902%; height: 1059px;\" border=\"1\">\n<colgroup> <col style=\"width: 25.1789%;\"> </colgroup> <colgroup> <col style=\"width: 74.8125%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Website / Language version</td>\n<td>\n<p>Website and language version to which the discussion section belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Section title</td>\n<td>\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>Brief explanation. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>From EFS 10.4: Image</td>\n<td>Optionally, an image can be used to illustrate the discussion.</td>\n</tr>\n<tr>\n<td>Access control</td>\n<td>\n<p>Select one of the following options:</p>\n<ul>\n<li>Public: All visitors of the panel can view the discussion, but only logged-in panelists may actively contribute to it.</li>\n<li>All logged-in panelists: All logged-in panelists can view the discussion, other visitors have no access.</li>\n<li>For logged-in panelists of a panel group only: If you choose this option, an additional drop-down list will be displayed where you can select a specific panel group. Only members of the selected group may view and use the discussion.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>Panelists can post</td>\n<td>\n<p>If this option is activated, the panel website will provide functions that allow the panelists to actively contribute to the discussion.</p>\n</td>\n</tr>\n<tr>\n<td>Publishing mode</td>\n<td>\n<p>You can specify whether the participants’ posts will be published immediately or only after they have been approved by a moderator.</p>\n<p>The available modes are:</p>\n<ul>\n<li>Publish immediately: All posts that are not blocked will be shown to all panelists.</li>\n<li>Publish after approval: Initially, the posts will only be shown to their respective author. Other panelists will only see them after they have been approved by the moderator.</li>\n</ul>\n<p>The default setting is “Publish immediately”.</p>\n</td>\n</tr>\n<tr>\n<td>From EFS 10.4: Active</td>\n<td>This option activates the granting of bonus points per post.</td>\n</tr>\n<tr>\n<td>\n<p>Bonus points per discussion post</p>\n</td>\n<td>\n<p>Every new post will be rewarded with a specified amount of bonus points.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Maximum number of rewarded posts per panelist</p>\n</td>\n<td>\n<p>This option allows for restricting the amount of bonus points granted to very active panelists.</p>\n</td>\n</tr>\n<tr>\n<td>Text in the bonus points history</td>\n<td>Text entered in the bonus points history and the account balance.</td>\n</tr>\n<tr>\n<td>Assigned bonus points</td>\n<td>Bonus points are granted for approved posts on this topic.</td>\n</tr>\n<tr>\n<td>Pending bonus points</td>\n<td>Bonus points for posts that have not been approved yet.</td>\n</tr>\n</tbody>\n</table>\n<h3 id=\"editing-discussion-posts-from-the-admin-area\" class=\"wysiwyg-text-align-justify\"><strong>Editing Discussion Posts from the Admin Area</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">As a moderator, you normally have a moderator or test account that allows you to use the same functions on the website as the panelists. For the most part, however, you will be working from the admin area: There are several moderation functions at your disposal.</p>\n<p class=\"wysiwyg-text-align-justify\">Discussion posts should not be deleted or changed subsequently without good reason. Use your edit options sparingly and observe the netiquette.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the posts in a discussion</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view the existing posts in the admin area, click on the desired discussion in the section overview. Alternatively, you can also use the<strong> Show Posts</strong> icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The overview lists the topics and contents of all posts in the selected discussion. It also shows the names of the authors, date, importance, and release status.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the Add Post button to open the dialog for creating a new post. The form is explained in detail in Table 14.7.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of a post to open a list of its properties.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual posts:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This also opens the dialog for editing the properties of an existing post.</li>\n<li>\n<strong>Delete</strong>: The selected post will be deleted following a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">With the “Actions” checkbox and the drop-down list below the table, you can also apply various actions to several posts at once:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Set release status to “approved” / “not checked” / “blocked”: Changes the release status of the selected posts.</li>\n<li>Delete posts: The selected posts will be deleted following a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Properties of posts</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table provides a detailed list of all the properties a post can have.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: auto; margin-left: auto; height: 959px;\" border=\"1\" width=\"771\">\n<colgroup> <col style=\"width: 185.0px;\"> </colgroup> <colgroup> <col style=\"width: 794.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 154.375px;\">Field</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 609.323px;\">Meaning</th>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Website / Language version</td>\n<td style=\"width: 601.302px;\">\n<p>Website and language version to which the subject belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Section title</td>\n<td style=\"width: 601.302px;\">\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Contributed by</td>\n<td style=\"width: 601.302px;\">\n<p>The author of the post.</p>\n<p>When creating a post via the admin area, you can choose the author: Panelists with the panel status “moderator” or “tester” are available in a drop-down list.</p>\n<p>In the standard panel, the posts of these panelists are labeled as moderator posts. The label “mod” is inserted via the wildcard “board_moderator_label”. It can be changed in the Wildcards menu.</p>\n<p>The author cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Number of ratings</td>\n<td style=\"width: 601.302px;\">Number of community ratings that were submitted for the post.</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Average rating</td>\n<td style=\"width: 601.302px;\">Result of the community rating.</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Release Status</td>\n<td style=\"width: 601.302px;\">\n<p>The following release statuses can be assigned:</p>\n<ul>\n<li>not checked: With the publishing mode set to “Publish immediately”, these posts are always displayed. With the publishing mode set to “Publish after approval”, they are displayed only to the author himself and to the moderator in the admin area until a moderator changes the release status to “approved”.</li>\n<li>approved: These posts are always displayed.</li>\n<li>blocked: These posts are never displayed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Sticky</td>\n<td style=\"width: 601.302px;\">\n<p>A post marked as “sticky” will be displayed highly visible above the discussion, in addition to its original position.</p>\n<p>Please note: Only one post per discussion can be marked as “sticky”. As soon as you mark a second post as “sticky”, the “sticky” flag will be deactivated for the first post.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Topic</td>\n<td style=\"width: 601.302px;\">The topic of the post.</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Content</td>\n<td style=\"width: 601.302px;\">\n<p>The actual post.</p>\n<p>Required fields.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 146.354px;\">Date</td>\n<td style=\"width: 601.302px;\">\n<p>Date to be displayed in the post overview both in the admin area and on the panel page. Required field.</p>\n<p>By default, the current date is set when creating a new post. It is possible, though, to have a different date displayed.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"exporting-discussion-posts\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Discussion Posts</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You can export the posts from a discussion e.g. external evaluation</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, locate the desired discussion section in the overview and select the <strong>Export posts</strong> icon. After specifying the file type (Excel or CSV) and the character set you can download the export file.</p>\n<p class=\"wysiwyg-text-align-justify\">The export file contains all the posts from that discussion with the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Selected panelist data: the author’s pseudonym (pseudonym), account name (u_account), first name (u_firstname), name (u_name), e-mail address (u_email), an alternative ID (u_other_id), and cell phone number (u_mobile)</li>\n<li>Selected system data: panel entry date (penter_date), panel status (pstatus)</li>\n<li>Discussion-specific data: date and time of post (dt), post ID (id), topic (title), text (description), and number and result of the community rating (rating_cont, rating_average).</li>\n</ul>\n<h2 id=\"integrating-a-discussion-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating a Discussion into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you want to set up a discussion, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Discussion” type.</li>\n<li>Configure the setting options as required.<br>– Select the “func_discussion” module template.<br>– Make sure that the appropriate discussion section is selected.</li>\n</ol>\n<h1 id=\"chats\" class=\"sc-iGrrsa eYmPYl wysiwyg-text-align-justify\"><strong>Chats</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">In addition to forums and discussions, EFS supports chats as well.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You can create and manage various chats (“chat sections”) for each language version of your website.</li>\n<li>As in the forum, you can decide whether all visitors, only panelists, or only members of a specific panel group will be permitted to visit the chat. Only logged-in panelists can contribute.</li>\n<li>A post usually consists of a name, date, and body text.</li>\n<li>If a panelist posts a new comment, an automatic reload of the list is triggered.</li>\n<li>Optionally, the panelists can auto-scroll to the latest post.</li>\n<li>You can create as many chats as you like. Please mind, though, that the resulting amounts of data may affect the performance of the panel installation. Therefore, it is recommended to limit the chats to at most 1,000 posts. Furthermore, you can export the posts of old chats and subsequently delete the chats.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Setting up a chat involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Creating a chat section.</li>\n<li>Creating a page for the chat and referencing the appropriate section.</li>\n<li>Monitoring, and if necessary, actively controlling the chat if the panelists are allowed to post.</li>\n</ul>\n<h2 id=\"managing-chats\" class=\"wysiwyg-text-align-justify\"><strong>Managing Chats</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The chats are managed from the <strong>Website → Panel websites → {Selected language version} → Chats</strong> menu. In this menu, you can edit existing chat sections, create new sections, and moderate ongoing chats.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">With read rights for “panel_chats”, you can manage chats. With write rights, you can export the posts of a chat.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of chats</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The overview table lists all the chat sections created for the respective language version along with their titles, descriptions, and the number of posts.</p>\n<p class=\"wysiwyg-text-align-justify\">If, in an installation with multiple websites and/or language versions, you want to view the chats of another language version, change the setting in the upper part of the dialog. With the <strong>View</strong> function, you can specify which table columns and how many rows per page will be displayed. You can search the contents of the overview table.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the<strong> Create section</strong> button to open the dialog for creating a new chat section.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of a chat section to open the list of existing posts. Click on the topic of a post to edit its properties.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual discussion sections:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This opens the dialog for editing the section properties.</li>\n<li>\n<strong>Show posts</strong>: Opens the list of posts.</li>\n<li>\n<strong>Copy</strong>: The desired section will be copied. The posts will not be copied, though, as this is usually not very practical.</li>\n<li>\n<strong>Export posts</strong>: This triggers the export of all the posts in this section.</li>\n<li>\n<strong>Delete</strong>: The selected section will be deleted following a confirmation prompt. Please bear in mind that all data will be irretrievably lost. If you do not need a particular section anymore, you should make use of the possibility to export the posts before deleting them.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Chat properties</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the properties a discussion section can have.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: 0px; margin-left: auto; height: 702px;\" border=\"1\" width=\"746\">\n<colgroup> <col> <col> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 122.812px;\">Field</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 615.885px;\">Meaning</th>\n</tr>\n<tr>\n<td style=\"width: 114.792px;\">Website / Language version</td>\n<td style=\"width: 607.865px;\">\n<p>Website and language version to which the discussion section belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 114.792px;\">Section title</td>\n<td style=\"width: 607.865px;\">\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 114.792px;\">Description</td>\n<td style=\"width: 607.865px;\">\n<p>Brief explanation. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 114.792px;\">Access control</td>\n<td style=\"width: 607.865px;\">\n<p>Select one of the following options:</p>\n<ul>\n<li>Public: All visitors of the panel can view the discussion, but only logged-in panelists may actively contribute to it.</li>\n<li>All logged-in panelists: All logged-in panelists can view the discussion, other visitors have no access.</li>\n<li>For logged-in panelists of a panel group only: If you choose this option, an additional drop-down list will be displayed where you can select a specific panel group. Only members of the selected group may view and use the discussion.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 114.792px;\">Publishing mode</td>\n<td style=\"width: 607.865px;\">\n<p>You can specify whether the participants’ posts will be published immediately or only after they have been approved by a moderator.</p>\n<p>The available modes are:</p>\n<ul>\n<li>Publish immediately: All posts that are not blocked will be shown to all panelists.</li>\n<li>Publish after approval: Initially, the posts will only be shown to their respective author. Other panelists will only see them after they have been approved by the moderator.</li>\n</ul>\n<p>The default setting is “Publish immediately”.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"editing-chat-posts-from-the-admin-area\" class=\"wysiwyg-text-align-justify\"><strong>Editing Chat Posts from the Admin Area</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">As a moderator, you normally have a moderator or test account that allows you to use the same functions on the website as the panelists. For the most part, however, you will be working from the admin area: There are several moderation functions at your disposal.</p>\n<p class=\"wysiwyg-text-align-justify\">Chat posts should not be deleted or changed subsequently without good reason. Use your edit options sparingly and observe the netiquette.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the posts in a chat</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view the existing posts in the admin area, click on the desired chat in the section overview. Alternatively, you can also use the <strong>Show Posts</strong> icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The overview lists the contents of all posts in the selected chat. It also shows the names of the authors, the date, and the release status.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Add Post</strong> button to open the dialog for creating a new post.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual posts:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This opens the dialog for editing the properties of an existing post.</li>\n<li>\n<strong>Delete</strong>: The selected post will be deleted following a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">With the “Actions” checkbox and the drop-down list below the table, you can also apply various actions to several posts at once:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Set release status to “approved” / “not checked” / “blocked”: Changes the release status of the selected posts.</li>\n<li>Delete posts: The selected posts will be deleted following a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Properties of posts</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table provides a detailed list of all the properties a post can have.</p>\n<table class=\"wrapped wysiwyg-text-align-justify\" style=\"margin-right: 0px; margin-left: auto; height: 728px;\" border=\"1\" width=\"747\">\n<colgroup> <col> <col> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 114.983px;\">Field</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 624.722px;\">Meaning</th>\n</tr>\n<tr>\n<td style=\"width: 106.962px;\">Website / Language version</td>\n<td style=\"width: 616.701px;\">\n<p>Website and language version to which the subject belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.962px;\">Section title</td>\n<td style=\"width: 616.701px;\">\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.962px;\">Contributed by</td>\n<td style=\"width: 616.701px;\">\n<p>The author of the post.</p>\n<p>When creating a post via the admin area, you can choose the author: Panelists with the panel status “moderator” or “tester” are available in a drop-down list.</p>\n<p>In the standard panel, the posts of these panelists are labeled as moderator posts. The label “mod” is inserted via the wildcard “board_moderator_label”. It can be changed in the <strong>Wildcards</strong> menu.</p>\n<p>The author cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.962px;\">Release Status</td>\n<td style=\"width: 616.701px;\">\n<p>The following release statuses can be assigned:</p>\n<ul>\n<li>not checked: With the publishing mode set to “Publish immediately”, these posts are always displayed. With the publishing mode set to “Publish after approval”, they are displayed only to the author himself and to the moderator in the admin area until a moderator changes the release status to “approved”.</li>\n<li>approved: These posts are always displayed.</li>\n<li>blocked: These posts are never displayed.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.962px;\">Content</td>\n<td style=\"width: 616.701px;\">\n<p>The actual post.</p>\n<p>Required fields.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 106.962px;\">Date</td>\n<td style=\"width: 616.701px;\">\n<p>Date to be displayed in the post overview both in the admin area and on the panel page. Required field.</p>\n<p>By default, the current date is set when creating a new post. It is possible, though, to have a different date displayed.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"exporting-chat-posts\" class=\"wysiwyg-text-align-justify\"><strong>Exporting Chat Posts</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You can export the posts from a chat e.g. external evaluation</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, locate the desired chat section in the overview and select the<strong> Export posts</strong> icon. After specifying the file type (Excel or CSV) and the character set you can download the export file.</p>\n<p class=\"wysiwyg-text-align-justify\">The export file contains all the posts from that chat with the following information:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Selected panelist data: the author’s pseudonym (pseudonym), account name (u_account), first name (u_firstname), name (u_name), e-mail address (u_email), an alternative ID (u_other_id), and cell phone number (u_mobile).</li>\n<li>Selected system data: panel entry date (penter_date), panel status (pstatus).</li>\n<li>Chat-specific data: date and time of post (dt), post ID (id), and text (description).</li>\n</ul>\n<h2 id=\"integrating-a-chat-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating a Chat into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you want to set up a chat, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Chat” type.</li>\n<li>Configure the setting options as required.<br>– Select the “func_chat” module template.<br>– Make sure that the appropriate discussion section is selected.</li>\n</ol>\n<h1 id=\"downloads\" class=\"sc-iGrrsa eYmPYl wysiwyg-text-align-justify\"><strong>Downloads</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">EFS Panel provides a download management function for the panel website. It allows you to create download lists which the panelists can use to download or even exchange files. Such download lists can be used in a variety of scenarios:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You can set up a download section containing important information on the panel. In a panel addressing children and teenagers, for example, you might want to provide information for parents and teachers. Or you could make legally relevant texts, such as terms of use or data privacy rules, available for download.</li>\n<li>You can provide data that are related to the subject of the panel or a currently running survey. If the panelists are expected to keep complex shopping diaries, for example, you can provide instructions or tips that new panelists can download and print.</li>\n<li>If you use EFS Panel as the platform for a community, you can allow the panelists to use the upload function and thus support the exchange of images, for example.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Setting up a download list involves the following steps:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Creating a download section.</li>\n<li>Uploading files or enabling the panelists to upload files.</li>\n<li>Creating a page for the download list and referencing the appropriate section.</li>\n<li>Monitoring, and if necessary, actively controlling the uploading activities if the panelists are allowed to upload files.</li>\n</ul>\n<h2 id=\"managing-download-sections\" class=\"wysiwyg-text-align-justify\"><strong>Managing Download Sections</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The file lists are managed from the <strong>Website → Panel websites → {Selected language version} → Downloads</strong> menu. In this menu, you can set up download sections, upload files, and check files uploaded by the panelists.</p>\n<p class=\"wysiwyg-text-align-justify\">The editing of the downloads of a panel requires read rights for “panel_download”.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the download sections</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The overview table lists all the download sections created for the respective language version along with their titles, descriptions, and the number of files.</p>\n<p class=\"wysiwyg-text-align-justify\">If, in an installation with multiple websites and/or language versions, you want to view the downloads of another language version, you change the setting in the upper part of the dialog. With the View function, you can specify which table columns and how many rows per page will be displayed. You can search the contents of the overview table.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Create section</strong> button to open the dialog for creating a new download section.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of a download section to open the list of existing files. Click on the title of a file to edit its properties.</p>\n<p class=\"wysiwyg-text-align-justify\">Via the icons in the “Actions” column you can edit individual download sections:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This opens the dialog for editing the section properties. Table 19.11 provides a detailed explanation of the properties.</li>\n<li>\n<strong>Edit files</strong>: This opens the list of files in the respective section.</li>\n<li>\n<strong>Copy</strong>: The desired section will be copied. The files will not be copied, though, as this is usually not very practical.</li>\n<li>\n<strong>Delete</strong>: The selected section will be deleted following a confirmation prompt. Please bear in mind that all files will be irretrievably lost.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Properties of download sections</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table lists all the properties of the download sections.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 106.043%; height: 1383px;\" border=\"1\">\n<colgroup> <col style=\"width: 19.4138%;\"> </colgroup> <colgroup> <col style=\"width: 80.5777%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Website / Language version</td>\n<td>\n<p>Website and language version to which the download section belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Section title</td>\n<td>\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>Brief explanation. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Access control</td>\n<td>\n<p>Select one of the following options:</p>\n<ul>\n<li>Public: All visitors of the panel can view the section, but only logged-in panelists may upload files to it.</li>\n<li>All logged-in panelists: All logged-in panelists can view the section, other visitors have no access.</li>\n<li>For logged-in panelists of a panel group only: If you choose this option, an additional drop-down list will be displayed where you can select a specific panel group. Only members of the selected group may view and use the section.</li>\n</ul>\n</td>\n</tr>\n<tr>\n<td>\n<p>Panelists are allowed to upload files</p>\n</td>\n<td>\n<p>If this option is activated, the panel website will provide functions that allow the panelists to upload files.</p>\n<p>Please note: At least one file type must be marked as “allowed” and a maximum upload file size &gt; 0 must be defined for the file upload field to be displayed to the panelists.</p>\n</td>\n</tr>\n<tr>\n<td>Publishing mode</td>\n<td>\n<p>You can specify whether the files uploaded by the panelists will be published immediately or only after they have been approved by a moderator. The available modes are:</p>\n<ul>\n<li>Publish immediately: All files that are not blocked will be shown to all panelists.</li>\n<li>Publish after approval: Initially, the files will only be shown to their respective author. Other panelists will only see them after they have been approved by the moderator.</li>\n</ul>\n<p>The default setting is “Publish immediately”.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Allowed file types for file upload</p>\n</td>\n<td>\n<p>In this field, you define which file types the panelists may upload if the feature “Panelists are allowed to upload files” is activated.</p>\n<p>Please mind:</p>\n<ul>\n<li>Only the file types named in the edit dialog are permitted.</li>\n<li>For films in “flv” format, EFS provides a player, i.e. they are embedded properly into the post. The display of other video formats depends on the operating system, browser, and the plugins of the panelists.</li>\n</ul>\n<p>As a moderator, you can upload files of all types named above via the admin area, regardless of the selection made for panelists.</p>\n</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Maximum upload file size</td>\n<td style=\"text-align: center;\">\n<p>If you allow the panelists to upload files, you can define the maximum file size in this field.</p>\n<ul>\n<li>The default value is 100 kb.</li>\n<li>If you enter “0” or nothing, the upload function will not be displayed.</li>\n<li>The maximum technically possible value is installation-specifc; it is displayed in the dialog.</li>\n</ul>\n<p>We recommend that you allow only the upload of very small files, as all uploaded files will have to be stored and increase the backup of the installation.</p>\n<p>If you upload files via the admin area as a moderator, you will not be restricted by the specified value. The maximum technically possible value for admins is installation-specifc; in case of doubt, please check with Support.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"editing-files-from-the-admin-area\" class=\"wysiwyg-text-align-justify\"><strong>Editing Files from the Admin Area</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">As a moderator, you normally have a moderator or test account that allows you to use the same functions on the website as the panelists. For the most part, however, you will be working from the admin area: There you have further-reaching access rights - for example, you can still upload files when the panelists are not allowed to do so - and various moderation functions are available.</p>\n<p class=\"wysiwyg-text-align-justify\">Files of panelists should not be deleted or changed subsequently without good reason. Use your edit options sparingly and observe the netiquette.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>File list for a section</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To view the existing files in the admin area, click on the desired download section in the section overview. Alternatively, you can also use the<strong> Edit files</strong> icon.</p>\n<p class=\"wysiwyg-text-align-justify\">All files are listed with their titles, descriptions, and file names. Displayed date of creation, release status, and the number of downloads are also shown.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Edit options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the Add file button to open the dialog for uploading a new file.</p>\n<p class=\"wysiwyg-text-align-justify\">Click on the title of an existing file to view its properties.</p>\n<p class=\"wysiwyg-text-align-justify\">The icons in the “Actions” column provide the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<strong>Edit</strong>: This also opens the dialog for editing the properties of an existing file.</li>\n<li>\n<strong>Delete</strong>: The selected file will be deleted following a confirmation prompt.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Properties of files</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The table provides a detailed list of all the properties a file can have.</p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 108.902%; height: 939px;\" border=\"1\">\n<colgroup> <col style=\"width: 20.1483%;\"> </colgroup> <colgroup> <col style=\"width: 79.8432%;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\">Field</th>\n<th class=\"wysiwyg-text-align-center\">Meaning</th>\n</tr>\n<tr>\n<td>Website / Language version</td>\n<td>\n<p>Website and language version to which the file belongs. Cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Section title</td>\n<td>\n<p>Name of the section. This is displayed both in the admin area and on the panel page.</p>\n</td>\n</tr>\n<tr>\n<td>Title</td>\n<td>Title of the download. Cannot be changed subsequently.</td>\n</tr>\n<tr>\n<td>Contributed by</td>\n<td>\n<p>The panelist or moderator who uploaded the file.</p>\n<p>When creating a file via the admin area, you can choose the author: Panelists with the panel status “moderator” or “tester” are available in a drop-down list.</p>\n<p>In the standard panel, the files of these panelists are labeled as moderator posts. The label “mod” is inserted via the wildcard “board_moderator_label”. It can be changed in the <strong>Wildcards</strong> menu.</p>\n<p>The author cannot be changed subsequently.</p>\n</td>\n</tr>\n<tr>\n<td>Release Status</td>\n<td>\n<p>The following release statuses can be assigned:</p>\n<p>not checked: With the publishing mode set to “Publish immediately”, these files are always displayed. With the publishing mode set to “Publish after approval”, they are displayed only to the author himself and to the moderator in the admin area until a moderator changes the release status to “approved”.</p>\n<p>approved: These files are always displayed.</p>\n<p>blocked: These files are never displayed.</p>\n</td>\n</tr>\n<tr>\n<td>Title</td>\n<td>\n<p>Title of the file.</p>\n<p>Required field.</p>\n</td>\n</tr>\n<tr>\n<td>Description</td>\n<td>\n<p>Description of the contents.</p>\n<p>Required field.</p>\n</td>\n</tr>\n<tr>\n<td>Existing file</td>\n<td>The file name and size.</td>\n</tr>\n<tr>\n<td>Displayed date of creation</td>\n<td>\n<p>The date is displayed in the list of files both in the admin area and on the panel page. Mandatory entry.</p>\n<p>By default, the current date is set when uploading a new file. You can specify another date from the admin area, though.</p>\n</td>\n</tr>\n<tr>\n<td style=\"text-align: left;\">Upload file</td>\n<td style=\"text-align: center;\">\n<p>This function allows you to subsequently replace existing files with other files from the admin area. The maximum technically possible value for admins is installation-specifc; in case of doubt, please check with Support.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"integrating-a-download-section-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating a Download Section into the Website</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you want to set up a download list, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Downloads” type.</li>\n<li>Configure the setting options as required. Table 19.11 provides an overview.<br>– Select the “func_download” module template.<br>– Make sure that the appropriate download section is selected.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRSQX3YJGQX3YJGQX3Y\" class=\"wysiwyg-text-align-justify\">How do I control access to community features?</h3>\n<p class=\"wysiwyg-text-align-justify\">Each community feature (blogs, forums, discussions, chats, and downloads) has access control options. You can set access to the public, all logged-in panelists, or specific panel groups only.</p>\n<h3 id=\"h_01HGKSMPRSYJGQX3YJGQX3YJGQ\" class=\"wysiwyg-text-align-justify\">Can I moderate content before it's published?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can set the publishing mode to \"Publish after approval\" for each feature. This allows you to review and approve content before it becomes visible to other panelists.</p>\n<h3 id=\"01J419HE0AY3QE6QTKZXMVEZFF\" class=\"wysiwyg-text-align-justify\">How can I encourage participation in community features?</h3>\n<p class=\"wysiwyg-text-align-justify\">You can set up bonus points for participation in forums and discussions. This can incentivize panelists to contribute more actively to the community.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>",
    "user_segment_ids": []
}