{
    "id": 20370883647122,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370883647122.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370883647122-Community-Panels",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234598507282,
    "created_at": "2024-07-25T16:35:37Z",
    "updated_at": "2024-08-28T10:08:41Z",
    "name": "Community Panels",
    "title": "Community Panels",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T12:40:04Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide on Community Panels in EFS Panel, focusing on panelist profiles, panelist search functions, and community features that enhance user engagement and interaction within online communities.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">With the community functions, the EFS Panel provides a solution to this challenge: Besides participating in surveys, participants are enabled to discuss directly with each other in forums and chats, as well as a blog, swap videos, or rate other community members. This will make the panel platform a vital source of information for decisions concerning marketing, market research, and product development. This combination of quantitative and qualitative feedback options will facilitate new forms of customer involvement. This guide covers the setup and configuration of panelist profiles, search functions, and various community features within the EFS Panel.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#panelist-profiles\">Panelist Profiles</a></li>\n<li><a href=\"#defining-forms-for-panelist-profiles-and-panelist-search\">Panelist Search</a></li>\n<li><a href=\"#display-of-active-panelists\">Display of Active Panelists</a></li>\n<li><a href=\"#panelist-ratings\">Panelist Ratings</a></li>\n</ul>\n<h1 id=\"panelist-profiles\" class=\"sc-chbbiW dCajGG wysiwyg-text-align-justify\"><strong>Panelist Profiles</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">Among the most important characteristics of any online community are member profiles and search functions that allow for the targeted finding of other members.</p>\n<p class=\"wysiwyg-text-align-justify\"><em>Profiles</em> give the members a face:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>They provide centralized access to all data on a member required for community life: ranging from a simple nickname and avatar in a largely anonymous community to personal details, self-characterizations, and the results of mutual ratings in the case of members of more complex communities.</li>\n<li>For the most part, members use their profiles to introduce themselves beyond the basic data required by the community operator. They write short biographies or upload personal images, for example.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">A <em>search function</em> helps navigate the community:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>It allows you to find and contact members that you have met in a community forum, for example.</li>\n<li>It allows you to search for members with similar interests.</li>\n<li>Depending on how your search is configured, you may get an overview of the community’s makeup.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">EFS Panel provides tools and templates that allow you to set up and configure panelist profiles and search functions for your community panel based on your needs:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You can decide for yourself which data are to be displayed in the profiles and returned by the search function.</li>\n<li>Optionally, you can configure profiles, searches, and results lists in such a way that important personal data are used only with the express consent of the respective panelists. This is of particular importance for target groups with a strong interest in privacy and countries with strict privacy regulations.</li>\n<li>Profiles, search forms, and results lists are created by combining a single form with a single-page module. At the same time, a variety of setting options provides flexibility: For example, you can display data in the profile that are used neither in the search nor in the results list.</li>\n<li>You can set up profiles with different designs for the various language versions of your panel. Even within a single language version, you can use multiple sets of profiles. If your panelists include, for example, an expert group with its forum, you could use simple profiles with only a few personal data for the entire group while providing the experts in their “private” area with detailed profiles and search functions.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example - A panelist uses the panelist search to find other panelists in her city:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015359132690\" alt=\"image2024-1-15_9-13-11.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The panelist views the profile of another panelist:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015312022162\" alt=\"image2024-1-15_9-14-7.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Before you start</strong></p>\n<p class=\"wysiwyg-text-align-justify\">When using panelist profiles and the panelist search function, the personal data of the panelists will be visible to other panelists and possibly the public.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Before using this function, please check whether this use is by your privacy policy.</li>\n<li>The default setting in new panels: The option “Show profile to others” is disabled, and visibility is activated for the individual standard data. This means that no data are displayed. However, by simply enabling the option “Show profile to others” you can make all data visible and searchable.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To set up panelist profiles, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Define forms for panelist profiles and panelist searches.</li>\n<li>Configure the visibility of personal data.</li>\n<li>Integrate panelist profiles and panelist searches into the website.</li>\n<li>Optional: Allow the panelists to edit their profile settings.</li>\n<li>Optional: Configure the picture upload for panelist profiles.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The necessary operations will be explained in detail in the following chapters.</p>\n<h3 id=\"defining-forms-for-panelist-profiles-and-panelist-search\" class=\"wysiwyg-text-align-justify\"><strong>Defining Forms for Panelist Profiles and Panelist Search</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Which variables the panelist profiles, the search form, and the results list should contain in principle, is defined via a form of the “profile” type. To create such a form, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Follow the instructions in Chapter 23, p. 473, and create a new form in the Forms menu. The form type “Profile” should be selected.</li>\n<li>Next, create the variables which should be included in the form. Select the desired profile options for each variable:<br>– Field can be searched: The variable is part of the search form.<br>– Field is displayed in the profiles search results list: The variable is part of the results list.<br>– Field is displayed in public profile: The variable is part of the profile.</li>\n</ol>\n<h3 id=\"defining-forms-for-panelist-profiles-and-panelist-search-1\" class=\"wysiwyg-text-align-justify\"><strong>Defining Forms for Panelist Profiles and Panelist Search</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Which variables the panelist profiles, the search form, and the results list should contain in principle, is defined via a form of the “profile” type. To create such a form, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Create a new form in the <strong>Forms</strong> menu. The form type “Profile” should be selected.</li>\n<li>Next, create the variables which should be included in the form. Select the desired profile options for each variable:<br>– Field can be searched: The variable is part of the search form.<br>– Field is displayed in the profiles search results list: The variable is part of the results list.<br>– Field is displayed in public profile: The variable is part of the profile.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Allowing the visibility of selected data to be configured</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the first step, you choose the data for which visibility should be configurable. By default, these are the following data:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Account name</li>\n<li>First name</li>\n<li>Last name</li>\n<li>E-mail address</li>\n<li>Address data (street, place, zip code, country, address 1-3)</li>\n<li>Internet address</li>\n<li>Gender</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Optionally, you can also allow the visibility of master data to be configured. To keep the dialogs on the website structured despite the growing number of data, the desired master data are aggregated in a maximum of five groups per panel installation and displayed to the panelists in a grouped manner. The panelists can then define the visibility for each group in their profile settings. To compile the master data groups, switch to the <strong>Website → Configuration </strong>menu. In the “Profile” section, you can define the five master data groups. Use the Ctrl or Shift keys to select multiple variables for each group.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Definition of visibility for new panelists</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Whether the personal data of new panelists should be visible to other panelists and visitors before these candidates log in and set up their profiles has to be defined for each language version. In the “Profiles” section of the edit dialog of the respective language version on the <strong>Configuration</strong> tab, you will find all the data whose visibility has been made configurable according to the instructions above.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Changing visibility for specific panelists</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can change the visibility settings for already existing panelists</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>in their detail views.</li>\n<li>in the panelist's list for selected panelists via the action “Set profile visibility”.<br>Three application modes are available:\n<ul>\n<li>Add selected profile visibility options: Sets the explicitly selected options to “visible”.</li>\n<li>Remove selected profile visibility options: Sets the explicitly selected options to “not visible”.</li>\n<li>Apply selected profile options: Overwrites all existing values with the settings made in the dialog.</li>\n</ul>\n</li>\n<li>during panelist import in the “Special parameters” section.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Allowing panelists to define the visibility of their data</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can also leave the decision as to which personal data are to be visible either entirely or partially to the panelists themselves.</p>\n<h3 id=\"integrating-panelist-profiles-and-panelist-search-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating Panelist Profiles and Panelist Search into the Website</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The panelist search, its results display, and the profiles of individual panelists are all set up with one single module: the “Profile search” page module. For the setup, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Profile search” type.</li>\n<li>Select the “func_profile_search” module template.</li>\n<li>Configure the setting options as required. Make sure that the correct form has been selected.</li>\n</ol>\n<h3 id=\"allowing-the-panelists-to-edit-their-own-profile-settings\" class=\"wysiwyg-text-align-justify\"><strong>Allowing the Panelists to Edit their Profile Settings</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">As already mentioned above, the careful handling of private data is fundamental for establishing trust in an online community. Therefore, many online communities allow their members to edit their profiles via a dedicated form and to decide for themselves which of their data should be visible. At the start of the membership, all data are usually set to “not visible”. The new members can then decide for themselves whether they want to release any personal data and, if so, which data. With EFS Panel it only takes you a few clicks to set up such a “Profile settings” form.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example - A panelist configures her profile:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015359127058\" alt=\"image2024-1-15_11-15-45.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Profile options” type.</li>\n<li>Select the “func_profile_settings” module template.</li>\n<li>Configure the setting options as required. Table 19.31 provides an overview. In particular in the field “The following profile options will be shown to panelists” all those data should be activated whose visibility is specified by the panelists themselves.</li>\n<li>Check again whether settings for the visibility of profile data, in particular the default settings for new panelists, which have been made elsewhere match the new form.</li>\n</ol>\n<h3 id=\"configuring-the-picture-upload-for-panelist-profiles\" class=\"wysiwyg-text-align-justify\"><strong>Configuring the Picture Upload for Panelist Profiles</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Community members like to decorate their profiles with images. By setting up a dedicated upload form, you can allow your panelists to upload two profile images.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example - A panelist opens the upload form:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015312021138\" alt=\"image2024-1-15_9-24-4.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The uploaded profile image in the upload form:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015359133586\" alt=\"image2024-1-12_9-36-45.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Occasionally, the moderator may have to remove a panelist’s profile image, e.g. because it violates copyright or other laws. In such a case, log in using the panelist’s account and password and remove the image.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you want to allow your panelists to upload profile images, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Picture upload for panelist profile” type.</li>\n<li>Select the “func_profile_pictures” module template.</li>\n<li>Configure the setting options as required.</li>\n<li>If you want to leave it to the panelists whether to display the profile images or not, activate the profile options “Picture 1” and/or “Picture 2” in the profile settings form.</li>\n<li>Check again whether settings for the visibility of profile data, in particular, the default settings for new panelists, which have been made elsewhere are compatible.</li>\n<li>\n<p>Check whether the images in the panelist profiles are displayed the way you want them to be. You may have to adjust the template (module template “func_profile_search”).</p>\n</li>\n<li>\n<p>Check whether the thumbnail size of the profile images fits your panel. You can change the thumbnail size on the <strong>Detail configuration</strong> tab in the <strong>Website → {Selected language version}</strong> menu.</p>\n</li>\n</ol>\n<h2 id=\"display-of-active-panelists\" class=\"wysiwyg-text-align-justify\"><strong>Display of Active Panelists</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">A frequently requested feature of community sites is a counter showing how many community members are currently online. Such a counter can be implemented easily in the EFS Panel. It is up to your creativity whether you display only the number of panelists, list them by name, or show their profile pictures.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To set up a panelist counter, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Define counting criteria</li>\n<li>Integrate the panelist counter in the website</li>\n</ul>\n<h3 id=\"defining-counting-criteria\" class=\"wysiwyg-text-align-justify\"><strong>Defining Counting Criteria</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">First, you have to define which persons are to be considered when measuring online activity. To do so, switch to the <strong>Website → Global configuration</strong> menu and select the desired settings in the “Performance” section:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Period (in seconds) that should be taken into account when calculating “panelists online” for the admin section and the page module</li>\n<li>Only count logged-in panelists for “panelists online” in the admin section and the page module: if “No” is selected, other visitors of the panel will be counted as well.</li>\n</ul>\n<h3 id=\"integrating-the-panelist-counter-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating the Panelist Counter into the Website</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To integrate a display of currently logged-in panelists into the website, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Panelists online” type.<br>– If you want to display the counter in the content area, just select a page as usual.<br>– If you want to display the counter on multiple pages, consider referencing the module as a global page module.<br>Please note that a modification of the main template may be necessary.<br>– If you want to display the counter e.g. in the right margin instead of the content area, a modification of the main template may be necessary as well.</li>\n<li>Select the “func_panelists_online” module template. If you want to display the panelists’ names or profile pictures, a modification of the template may be necessary.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">Configure the setting options as required.</p>\n<h2 id=\"panelist-ratings\" class=\"wysiwyg-text-align-justify\"><strong>Panelist Ratings</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">A typical feature of community sites is the rating of other participants. The participants show sympathy and praise for each other by awarding points or other units of some social currency. EFS Panel allows you to implement such participant ratings easily and without additional programming efforts:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>A new rating function allows panelists to rate other panelists.</li>\n<li>The social currency of the EFS Panel is internally referred to as “points”. When using this feature on your website, you may use a completely different name, of course. Unlike bonus points (the currency of EFS Panel’s incentive system) these “social” points only have virtual value.</li>\n<li>You define how many points a panelist may award to others. Dedicated master data are used to log how many points a panelist has left to award, how many he has received from others, and how often he has been awarded any points.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can use panelist rating in a variety of scenarios:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The participants can show sympathy and praise for each other.</li>\n<li>In self-administered communities, the mutual rating of participants can be used as an indirect means for steering group behavior and disciplining participants.</li>\n<li>A moderator running a community could reserve the right to award points, e.g. to honor particularly active panelists.</li>\n<li>You can allocate a fixed number of points to every new panelist, which they are free to award to other panelists. Or you can allocate points only to active or very experienced panelists.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\"><strong>A panelist awards points to another panelist:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015312019346\" alt=\"image2024-1-15_9-31-9.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Work steps</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To use the panelist rating function, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Create master data for logging the awarding of points</li>\n<li>Integrate the form for the awarding of points into the website</li>\n</ul>\n<h3 id=\"creating-master-data-for-logging-the-awarding-of-points\" class=\"wysiwyg-text-align-justify\"><strong>Creating Master Data for Logging the Awarding of Points</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Three master data variables of the integer type are required for logging the results of the awarding process:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>A master data variable containing the number of points left for a panelist to award. In the standard panel, this variable is called m_starcredit.</li>\n<li>A master data variable containing the number of points a panelist has received from other panelists. In the standard panel, this variable is called m_starsreceived.</li>\n<li>A master data variable containing the number of awards to a panelist, i.e. every time the panelist receives points the value of this variable is increased by 1. In the standard panel, this variable is called m_starcount.</li>\n</ul>\n<h3 id=\"integrating-the-form-for-the-awarding-of-points-into-the-website\" class=\"wysiwyg-text-align-justify\"><strong>Integrating the Form for the Awarding of Points into the Website</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To set up the form for the awarding of points, please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the desired page, create a page module of the “Panelist ratings” type.</li>\n<li>Select the “func_panelist_rating” module template.</li>\n<li>Configure the setting options as required. Table 19.33 provides an overview. Make sure that the master data are correctly linked.</li>\n</ol>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">What are the key features of Community Panels in the EFS Panel?</h3>\n<p class=\"wysiwyg-text-align-justify\">Community Panels in EFS Panel offer features such as panelist profiles, panelist search, profile visibility settings, picture uploads, active panelist display, and panelist ratings. These features enhance community engagement and allow for better interaction among panelists.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">How can I ensure privacy when setting up panelist profiles?</h3>\n<p class=\"wysiwyg-text-align-justify\">To ensure privacy, you can configure which personal data are visible, allow panelists to control their own data visibility, and set default visibility settings for new panelists. Always check that your setup complies with your privacy policy and relevant regulations.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">Can panelists upload their profile pictures?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can set up a dedicated upload form that allows panelists to upload two profile images. This feature can be configured to give panelists control over whether their pictures are displayed or not.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>",
    "user_segment_ids": []
}