{
    "id": 20370911434514,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370911434514.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370911434514-Libraries",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234757130258,
    "created_at": "2024-07-25T16:40:11Z",
    "updated_at": "2024-08-28T10:12:55Z",
    "name": "Libraries",
    "title": "Libraries",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T15:20:28Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about various libraries and features available in the EFS (Enterprise Feedback Suite) system. It covers topics such as media libraries, survey libraries, mail templates, macros, question types, and consent form templates.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The EFS system offers a range of libraries and tools to enhance survey creation, management, and distribution. This guide explores these features in detail, providing instructions on how to use and customize them for various project needs.</p>\n<ul>\n<li><a href=\"#media-library\">Media library</a></li>\n<li><a href=\"#survey-library\">Survey library</a></li>\n<li><a href=\"#mail-templates\">Mail templates</a></li>\n<li><a href=\"#categories\">Categories</a></li>\n<li><a href=\"#scale-library\">Scale Library</a></li>\n<li><a href=\"#survey-messages\">Survey messages</a></li>\n<li><a href=\"#macros\">Macros</a></li>\n<li><a href=\"#question-types\">Question types</a></li>\n<li><a href=\"#consent-form-templates\">Consent form templates</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">A set of ready-made English surveys is available from the library. The sample surveys are listed in the menu <strong>Libraries</strong> → <strong>Survey library</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414422546\" alt=\"Libraries.jpg\"></p>\n<h2 id=\"media-library\" class=\"wysiwyg-text-align-justify\"><strong>Media library</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Each project has its own media library, located in the<strong> Questionnaire editor </strong>under the <strong>Media library</strong> menu. It enables you to upload multimedia files such as images, sounds or movies from your local hard disk or from your network into the project directory on the <em>EFS</em> server and to insert them into the questionnaire.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444579090\" alt=\"Media library.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The library, the project-specific library (Current project), and the optional installation-wide library are arranged on successive tabs. The library provides ready-made visuals, made available for free. The frequently requested option to download only selected files instead of the whole library has been realized.</p>\n<p class=\"wysiwyg-text-align-justify\">Please use the installation-wide media library economically. The following guiding values provide orientation:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>It is recommended to create not more than 250 folders.</p>\n</li>\n<li>\n<p>The folder structure should not be more than 10 levels deep.</p>\n</li>\n<li>\n<p>It is recommended to upload not more than 10,000 files.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Managing Multimedia Files</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To upload a file, click the <strong>Upload file button</strong>. Then proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Locate the file on your hard disk using the Browse function.</p>\n</li>\n<li>\n<p>If you are uploading a zip file, you can have the system unpack it and automatically create subdirectories in one operation. To do so, tick the “Unpack ZIP file” checkbox.</p>\n</li>\n<li>\n<p>You have the option of defining a wildcard. You can use the characters a-z, A-Z and 0-9. The wildcards must be enclosed in two hash signs (#).</p>\n</li>\n<li>\n<p>If you want to overwrite files in your own media library with an updated version, simply activate the new “Overwrite file(s)” checkbox during upload.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Upload</strong></p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing individual files</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you scroll over a row or activate a checkbox, the following action icons are displayed:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Info</strong>: In a pop-up window, you can find the img tag that can be used to incorporate a file into the questionnaire, with both absolute and relative paths. Furthermore. The absolute path is displayed separately for copy and paste.</p>\n</li>\n<li>\n<p><strong>Edit file</strong>: Opens an entry form in which you can change the file name and description.</p>\n</li>\n<li>\n<p><strong>Move file</strong>: Opens a drop-down list from which you can choose a different category for the file.</p>\n</li>\n<li>\n<p><strong>Delete</strong></p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing several files at the same time</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Using the icons above the file list, you can download, move, or delete several or all files. Just activate the desired files and click on the appropriate icon.</p>\n<p class=\"wysiwyg-text-align-justify\">The media library is not a secure location! It is recommended to save only logos and/or data that do not need to be protected (e.g. by a security check). The saved logos and/or data are publicly accessible.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Using Categories to Organize Files</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can create categories in the media library, i.e. in the project-related directory/images, which help to improve the overview.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating new categories</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the category below which you wish to create the new category.</p>\n</li>\n<li>\n<p>Click on the <strong>Create category</strong> icon.</p>\n</li>\n<li>\n<p>Enter the name.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>OK</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Renaming categories</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the category you wish to rename.</p>\n</li>\n<li>\n<p>Click on the <strong>Rename category</strong> icon.</p>\n</li>\n<li>\n<p>Enter the new name.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>OK</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Deleting categories</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the category you wish to delete.</p>\n</li>\n<li>\n<p>Click on the <strong>Delete category</strong> icon.</p>\n</li>\n<li>\n<p>Affirm the confirmation window.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">When deleting a category, all files in it will be removed as well. The /images category cannot be deleted.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Downloading Files from the Media Library</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Individual or several files can be downloaded. For this purpose, a <strong>Download</strong> icon is available on every level of the category structure on the<strong> Current Project</strong> and<strong> Common library</strong> tabs. If you select the desired files and click this icon, a zip file will be generated that contains the content of the current folder including its subfolders. You can save this file locally to a PC, open it, and then view or edit the images.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>When working in the installation-wide media library, in particular, take care to select only reasonable amounts of data for download, i.e. less than 10 MB and not more than 30 files. Otherwise, the download process can affect the performance of the <em>EFS</em> installation.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Protecting images</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Customers running product or cover tests frequently ask for better protection against illegal copying and screenshotting of their content. A dedicated image protection feature makes storing or screenshotting of images considerably more difficult.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the questionnaire, participants will see only the silhouette and outline of the projected image, plus an instruction for display.</p>\n</li>\n<li>\n<p>If the participants press the key combination specified in the instruction, the image will be displayed. (They have to keep the blank key pressed and click on the image with the left key of the mouse pointer.)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For technical reasons, it is not possible to prevent participants from taking screenshots or from downloading the displayed images on their hard disks with absolute reliability. But with the new image protection feature, it is considerably more difficult.</p>\n<h2 id=\"survey-library\" class=\"wysiwyg-text-align-justify\"><strong>Survey library</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The survey library allows access to readymade sample questionnaires. A set of ready-made English surveys is available from the library. The sample surveys are listed in the menu <strong>Libraries</strong> → <strong>Survey library</strong>. Its interface design is analogous to the media library. Inside the library, the sample questionnaires are read-only.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444579986\" alt=\"Survey library.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To use a survey from the library as a base for your own project, click on the <strong>+ New project</strong> split button above the project list and select “Survey library”. In the project template field, select the desired library survey via the <strong>Magnifying glass</strong> icon. Fill in all other fields as usual. Once the survey has been created, you can modify the questionnaire as you like.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The survey library cannot be used for multi-source feedback.</p>\n<h2 id=\"mail-templates\" class=\"wysiwyg-text-align-justify\"><strong>Mail templates</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Usually, e-mails are written based on existing mail templates, which are centrally created, edited, and managed in the <strong>Libraries → Mail templates</strong> menu. In the mail form’s “Mail template” drop-down list, you can select one of these templates and upload it by clicking on <strong>Apply mail template</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444581906\" alt=\"Mail templates.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">To create a new template, click on the <strong>Manage Mail templates</strong> link. The <strong>Libraries</strong> → <strong>Mail templates</strong> menu, which allows you to create the desired new template, will be opened in a pop-up window.</p>\n<h3 id=\"creating-new-mail-template\" class=\"wysiwyg-text-align-justify\"><strong>Creating a new mail template</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To create a new template, click on the button + <strong>New draft</strong> and select the desired option. You have different template types for the Panel website, survey project, and portals. Depending on whether you want to create a template for the Panel website, a survey project, or portals, the available template types also change.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444588050\" alt=\"New template.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">In addition to selecting an e-mail template type, you also specify a language version, enter a short description in the free text field, and choose a delivery method. The following types are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>E-Mail</p>\n</li>\n<li>\n<p>SMS</p>\n</li>\n<li>\n<p>E-Mail und SMS</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Configuring advanced mail settings</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The “Advanced mail settings” area, which provides various special functions, is usually hidden. You can easily show or hide this dialog as required.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414428690\" alt=\"Advanced mail settings.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Character set</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The character set for e-mails is set separately and can depending on your requirements vary from the settings for the character set for the overall project. This can be sensible, if:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>in a project carried out using UTF-8, you are not sure whether the mail program of the majority of respondents is compatible with this character set. Most modern mail programs can display UTF-8 correctly, in particular with internet-based mail programs complications can arise.</p>\n</li>\n<li>\n<p>you will be carrying out a project, that will use a character set other than UTF-8 or diverse character sets, where you would like to use UTF-8 or another divergent character set for the display of special characters in e-mails.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For the mail form, the character set ISO-8859-1 is preset by default.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Conversion problems with Windows-specific characters</strong></p>\n<p class=\"wysiwyg-text-align-justify\">When you copy and paste from a Microsoft program, such as MS Word or Excel to an e-mail form, that is coded in a character set other than UTF-8, conversion problems may occur: If the text contains Windows-specific characters that are not in the character set of the mail form, then these must be converted.</p>\n<p class=\"wysiwyg-text-align-justify\"><em>EFS Survey</em> can convert many Windows-specific characters correctly, however the conversion will still require checking. Characters, for which there is no match, will be deleted completely from the mailtext because they could not be sensibly converted (for example Chinese characters could not be displayed in a ISO-8859-1 coded questionnaire). Therefore a warning message will be displayed in the mail preview, that asks you to make a check, as soon as you open an e-mail with characters that have been converted or cannot be displayed.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Reply-To: = From</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The “Reply-To” information in an e-mail indicates where the recipient is to send any replies. Making different entries may be advisable, for example, in surveys you conduct for a third party. Under “Sender”, you can then enter your customer’s address: This will be displayed for the recipient and may increase their willingness to respond. However, the “Reply-To” address makes sure that the reply mail will be sent to you as the supervisor of the survey. Furthermore, server messages indicating that an e-mail could not be delivered will also be sent to the “Reply-To” address. You can set the “Reply-To” address using the drop-down list contained in the row of the same name.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Read rights for “mail_reply” are required for accessing and using this field, plus the “Return-Path” and “Read confirmation” options explained in the following sections.</p>\n</li>\n<li>\n<p>The default setting is “Reply-To = From”, i.e. the sender’s address will be used.</p>\n</li>\n<li>\n<p>If you complete a mail form without read rights for “mail_reply”, i.e. without seeing the “Reply-To” and “Return-Path” options, the default setting “Reply-To = From” will be used. “Read confirmation” will be deactivated as per default. If you do not have read rights and use a mail template in which “Reply-To”, “Return-Path” or “Read confirmation” have been defined, the values from the mail template will be used.</p>\n</li>\n<li>\n<p>Additionally, the same addresses as in the “Sender” field are available for selection. If you wish to change the sender addresses, you can do so in the <strong>Mail templates</strong> → <strong>Mail senders</strong> menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Before you use a third party’s address, remember to make sure they approve! Also, contact the recipients’ postmaster to find out whether the sender's address is permissible. Some mail gateways of larger companies, in particular, do not permit any emails from the Internet if the sender indicates is a “faked” address for their mail domains.</p>\n<p class=\"wysiwyg-text-align-justify\">Sometimes, autoresponders (e.g. notifications of absence, such as vacations) are poorly configured. Normally, the automatic message should not be generated at all because <em>EFS Survey</em> has placed a corresponding mail header. Nevertheless, there are mail systems that have been carelessly configured. Often, such mail systems do not evaluate the information in “Reply-To”, either, but send the automatic replies to the (assumed) sender address.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Return-Path</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Error messages and other transfer errors (e.g. “bounce messages”) will be sent to the address configured in the field “Return-Path”. These messages will be forwarded to the mail sender if no address has been configured. Access to the “Return-Path” option is controlled by the “mail_reply” right described above. The default setting is “Reply-To = From”, i.e. the sender’s address will be used. Assuming that you have the required read rights, the addresses in the drop-down list are the same as those found in the drop-down list in the field “Mail sender”.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>X-Priority (importance)</strong></p>\n<p class=\"wysiwyg-text-align-justify\">This information allows you to assign the e-mail a status. Commonly used mail clients can use this information to highlight or arrange your e-mail according to the recipient’s settings. Five statuses are available, “1” is used for the lowest significance and “5” for the highest priority.</p>\n<p class=\"wysiwyg-text-align-justify\">As senders of unwanted advertising mails (spammers) also frequently use this option to attach greater importance to their e-mails, using this feature may also turn out to be a disadvantage. Some mail clients or mail filters in gateways are set up to simply delete e-mails indicating a (high) priority. Therefore, if you have set a high priority in an invitation mail, be sure to avoid using another priority setting for a reminder mail.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Sensitivity</strong></p>\n<p class=\"wysiwyg-text-align-justify\">For recipients using Outlook, you can set the message’s sensitivity.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Read confirmation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Commonly used mail clients support sending automatic read confirmations. Once the recipient opens the e-mail, a message is automatically sent to the recipient you selected (sender or Reply-To). Since this happens automatically, such a read confirmation of course does not mean that the recipient has actually read or even understood your e-mail. It merely indicates that the message has been displayed in the recipient’s mail program. Also, it is not mandatory for a mail client to send a read confirmation. The recipient may also have deactivated this option or deliberately decided not to send a read confirmation for this particular mail. They may nevertheless have read the mail. Also, in particular, in the case of recipients in larger companies, the header line may have been removed by a mail filter.</p>\n<p class=\"wysiwyg-text-align-justify\">Access to the “Read confirmation” option is controlled by the <em>mail_reply</em> right described above in the “Reply-To” section.</p>\n<p class=\"wysiwyg-text-align-justify\">It may well be that you receive read confirmations from recipients whose mail addresses are not stored in your project at all. Some Internet users use e-mail addresses for mere forwarding purposes. In this case, if the recipient sends an automatic read confirmation, the sender indicated in the read confirmation will usually be the mail address at which the Internet user received your mail.</p>\n<p class=\"wysiwyg-text-align-justify\">Some Internet users consider read confirmations a nuisance. If a warning message appears, pointing out that you have requested a read confirmation, this, in particular, can cause uncertainties. For inexperienced recipients, the mere mail text does not make it clear that their client has been prompted to send an automatic reply.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Send a mail copy to the sender (without substitutions)</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If this checkbox is ticked, a copy of the e-mail will be sent to the sender. This copy will be sent as the first e-mail of the operation. Any existing wildcards will not be substituted because the sender (administrator) is usually not a survey participant.</p>\n<p class=\"wysiwyg-text-align-justify\">This feature currently only functions for mail submission from a form. In the case of automatic submission, for example of password or welcome emails on a<em> People</em> installation, no copies are sent.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Forwarding copies of all mail to additional mail recipients</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can, for example, within the context of a test forward copies of all mails, which are to be sent out in a dispatch process, to an additional mail recipient. In this process, the wildcards will be replaced and the additional mail recipient will see the mails in the same way as the real recipients<u>.</u></p>\n<p class=\"wysiwyg-text-align-justify\">To do this enter the e-mail address of the additional recipient in the field “Additional mail recipient (CC)” or, if the address should not be visible to other recipients, in the field “Additional hidden mail recipient (BCC)”.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Read rights for <em>mail_cc</em> are required for accessing and using the CC and BCC options.</p>\n</li>\n<li>\n<p>Per default, both fields are empty.</p>\n</li>\n<li>\n<p>If you complete a mail form without read rights for “mail_cc”, i.e. without seeing the CC and BCC options, the fields will be empty i.e. the mails will not be forwarded to additional recipients. If you do not have read rights and use a mail template in which CC or BCC have been defined, the values from the mail template will be used.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The specified recipient will receive the e-mail with wildcard replacements. Depending on the purpose and data protection agreement this could lead to a data protection infringement (e.g. with the dispatch of passwords).</p>\n<p class=\"wysiwyg-text-align-justify\">This feature is intended for use within the context of test processes, in which only a few test persons will be written. Use with larger pools of participants is not recommended, as the amount of mail doubles.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Base URL</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The feature “Base URL” allows us to define how wildcards with URL elements (e.g. #url#, #code_complete#) will be filled.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can explicitly define the protocol (http, https) and the domain which is to be used in the e-mail.</p>\n</li>\n<li>\n<p>The option “Use protocol/domain from current URL” allows to make the wildcards dependent on the protocol and domain with which the user who triggers the mail action is logged into the admin area.</p>\n</li>\n<li>\n<p>Wildcards that enforce a specific protocol, such as e.g. #code_complete_http#, are not affected by these settings.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can only choose among several domains if there are several domains set up and configured for the installation. Otherwise, the current URL will be used automatically.</p>\n<h3 id=\"predefined-mail-sender\" class=\"wysiwyg-text-align-justify\"><strong>Predefined mail sender</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The drop-down list in the “Mail sender” row allows you to select the sender address. The default setting is the e-mail address of the user logged in. Additionally, addresses which were created in the <strong>Mail templates → Mail senders</strong> menu and for which you have access rights will be available for selection. The e-mail address you select is also valid as a return and bounce address if the following definitions are true:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Reply-To: Reply-To = From</p>\n</li>\n<li>\n<p>Return-Path: Return Path = From</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444589842\" alt=\"Mail sending.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Dynamic mail sender</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The E-mail address and name of the mail sender can now be defined dynamically by filling in the fields „Dynamic mail sender“ and „Name of the sender“ as well as selecting a predefined mail sender from the drop-down list „Mail sender“ as a fallback. When filling the fields, you can use wildcards and if-conditions like in mail-text.</p>\n<p class=\"wysiwyg-text-align-justify\">Dynamic mail senders always overwrite predefined mail senders from the drop-down list. Should the Reply-To or the Return Path address be equivalent to the address of the predefined mail sender, the dynamic mail sender will be entered in these fields also.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This function can be used in mail templates as well. However, it is not available in mail triggers, since they already contain a similar function for setting a dynamic mail sender that can be defined from survey responses.</p>\n</li>\n</ul>\n<h3 id=\"sending-to\" class=\"wysiwyg-text-align-justify\"><strong>Sending TO</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Only for <em>EFS People</em> installations: The <strong>People </strong>→ <strong>Contacts</strong> → <strong>Send e-mail</strong> menu contains a mail-sending function that allows you to contact individual recipients in a targeted manner. Whereas in all other action areas,, the group of recipients is determined in advance (e.g. a group of participants identified through the disposition code or the sample drawn from a panel), the mail-sending function in this menu allows you to contact individual recipients whose data are not even present in the EFS Panel system. Enter the address in the “To” field.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Mail Format</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can send either text or real HTML emails from the EFS Survey. To do so, you must specify the format before writing the mail. The following options are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Text only (default)</p>\n</li>\n<li>\n<p>HTML only</p>\n</li>\n<li>\n<p>Text and HTML</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">After you have confirmed the selection by clicking on <strong>Apply mail format</strong>, the appropriate input field(s) will be shown.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>HTML format</strong></p>\n<p class=\"wysiwyg-text-align-justify\">By default, EFS sends e-mails in plain text format. Alternatively,, you can also send HTML emails. The line breaks are not automatically inserted with the “HTML format” checkbox ticked. <em>EFS</em> generates the HTML emails as content type “multipart/alternative”. This means that the actual text is contained in the e-mail in duplicate. This allows mail clients that cannot display HTML to display the alternate text. Webmail services, in particular, often warn users against displaying e-mails in HTML format and suggest displaying the alternate text (if available).</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Old e-mail clients e.g. Outlook 2003 cannot process the content type “multipart/alternative” properly. E.g. if a recipient has restricted Outlook 2003 to “Text only”, the client will not output the alternative text, but the HTML part converted into text.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Disadvantages of e-mails in HTML format</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In particular, the doubled amount of data in HTML emails is considered unnecessary by some Internet users and, because of the longer loading time, often also as impolite. Since both scripts and so-called web bugs may be hidden in HTML code, some mail systems classify these messages as potentially dangerous. Insofar, as it cannot be ruled out the post master of a recipient system may remove the HTML code or tag it with a security alert. If you still want to send HTML emails and can easily narrow the group of the recipients of your mailing (e.g. in the case of employee surveys), you should contact the recipients’ postmaster in advance to find out how they deal with these emails.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Subject</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the “Subject” field you enter the title of your e-mail. Wildcards can be used.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You should avoid special characters, such as the German umlauts, in this field. The line is part of the so-called mail headers. Encoding special characters, as in the email’s content, is not possible here.</p>\n</li>\n<li>\n<p>Please note that mail subjects should in general not be longer than 60 characters. Many servers make a cut after 248 characters for security reasons.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Masking special characters in the subject</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you still need special characters, you will have to mask them appropriately. For example, “Ä” (A umlaut) will then become “=?ISO-8859-1?Q?=C4?=”. However, please note that these maskings are not supported by all mail clients and that some mail gateways or virus scanners shorten very long subject lines. In extreme cases, a virus scanner may even mistake very long subjects for an attack on the mail client and immediately delete the entire mail. <em>EFS</em> therefore limits the permissible number of characters to 254, which is within the commonly used limits.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The best way to create a subject with masked special characters is to use your mail program and send yourself an e-mail with the subject. Then, copy the masked string from the source text of your mail into the entry form’s subject row.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Mail text</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the “Mail text” field, you can enter the actual content of the mail or edit the content of the chosen template. Depending on the format you select in the “Mail format” field, you will be provided with either an input field for a text mail, a form for an HTML mail, or two fields:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Mail text in normal text format: You merely have to enter the text. You have no option to design the text, e.g. by formatting characters. Wildcards and conditional replacements can be used.</p>\n</li>\n<li>\n<p>Mail text in HTML:</p>\n<ul>\n<li>\n<p>The modern WYSIWYG editor TinyMCE can be used when creating HTML emails or HTML mail templates (WYSIWYG = what you see is what you get).</p>\n</li>\n<li>\n<p>Wildcards and conditional replacements can be used as usual.</p>\n</li>\n<li>\n<p>Both attached images and external images can be inserted (see below for instructions).</p>\n</li>\n<li>\n<p>If necessary, you may access and edit the source code through the <strong>Source code editor</strong>. The information on which editor has been used will be saved for all users within the template. This enables the creation of complex templates which would not be possible using only the WYSIWYG editor.</p>\n</li>\n<li>\n<p>If you do not want to use the WYSIWYG editor, go to the menu <strong>Options</strong> → <strong>Personal preferences,,</strong> and on the tab <strong>General settings</strong>, select the option “Deactivate WYSIWYG editor for mail forms”</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Automatic line breaks</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In text mails, a line break is automatically generated after 72 characters. In HTML emails, you must insert the line breaks yourself. The length of 72 characters is a quasi standard which is generally recognized for electronic messages. The origins of this are in the so-called text mode of earlier PC systems which is used, to this day, with a line length of 80 characters for 25 lines. Therefore, some mail clients generally insert a line break after 80 characters. To make it easier for e-mail’s recipients to use quotations in their replies, this limit has become established as a rule of courtesy when working with electronic messages (news messages, mailbox messages, and e-mails).</p>\n<p class=\"wysiwyg-text-align-justify\">If you insert a line break yourself, e.g. to mark the end of a paragraph, this will be respected and kept. Also, words will not be hyphenated. If the width limit of 72 characters is exceeded with the last word in a line, the whole word will be moved to the next line.</p>\n<p class=\"wysiwyg-text-align-justify\">Uninterrupted character strings, such as very long web addresses (URLs), are not subject to automatic line breaks.</p>\n<p class=\"wysiwyg-text-align-justify\">It may occur that the recipient system inserts a line break into a very long line. Any existing text link with access code (#code_complete#) may then be rendered unusable. If you cannot sufficiently shorten the project’s URL yourself due to a long domain name, you should have a domain alias for your installation set up.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Incorporating images in HTML emails</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can insert both attached images and external images into the text of an HTML mail.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To insert attached images, open the <strong>Insert image</strong> dialog of the WYSIWYG editor and select the desired images from the “Image list”.</p>\n</li>\n<li>\n<p>When editing the source code, you can integrate the attached images using a wildcard #file name#. Example: The name of the appended image is image.jpg, and the wildcard is therefore #image.jpg#. You can insert the image with &lt;img src=#image.jpg#&gt;.</p>\n</li>\n<li>\n<p>If you want to use external images, enter the URL in the <strong>Insert Image</strong> dialog. When editing source code, enter the URL into the src tag.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Do not use hard-coded links to embed resources, such as those located in the media library (hard-coded links are links that display the current file path, e.g. http://<a href=\"http://www.yourdomain.com/uc/1234/images/image.jpg\">www.yourdomain.com/uc/1234/images/image.jpg</a>). First of all, hard-coded links are a typical characteristic of spam mails: They allow spammers to check whether or not their spam emails were read. Your invitation will therefore most certainly be filtered out as spam. Secondly, the links would no longer function if the project were to be moved to a different installation, for example, or if the media library in which the mail template resources are stored were to be cleaned up or deleted. What’s more, linked images would not be available for reading in offline mode.</p>\n<p class=\"wysiwyg-text-align-justify\">If, however, you attach the required resources to the mail or mail template and link them with the help of wildcards, as described above, your mail will still function after moving it to a different installation or after a media library clean-up.</p>\n<p class=\"wysiwyg-text-align-justify\">Please also note that attachments increase the size of emails: The bigger the attachment and the larger the number of recipients, the more strain this places on the server. We therefore recommend using this function with care and using small sized files.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adding attachments</strong></p>\n<p class=\"wysiwyg-text-align-justify\">It is possible to send e-mails with attachments.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The maximum size for the attachments is 1 MB.</p>\n</li>\n<li>\n<p>You can use all the file types that are permitted for the media library.</p>\n</li>\n<li>\n<p>The XML-based formats of <em>Microsoft Office</em> 2007 / 2010 (docx, pptx, xlsx, etc.) can be uploaded into the media library and used as mail attachments.</p>\n</li>\n<li>\n<p>If you intend to attach not only “normal” attachments (e.g. pdf files), but one or several of the incorporated images described above, to an e-mail, take care to upload the “normal” attachments first. Otherwise, mail recipients using <em>Outlook</em> won’t be able to open the attachments.</p>\n</li>\n<li>\n<p>The attachments can be saved as an attribute to mail templates.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To add an attachment to an e-mail or mail template, select the desired file in the “Add an attachment” field. Once confirmed with the <strong>Attach File</strong> button, the attachment will be uploaded and attached to the e-mail. You can remove an unwanted attachment by clicking on the respective <strong>Delete</strong> icon.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The functionality is protected by the “mail_attachments” right, with read rights required to use it.</p>\n</li>\n</ul>\n<h3 id=\"additional-functions-for-personalizing-e-mail-texts\" class=\"wysiwyg-text-align-justify\"><strong>Additional functions for personalizing e-mail texts</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can use wildcards in your e-mail to personalize the text. The following wildcards are used only when sending mail. They can be used, for example, to insert system data, to send access codes,, and to output various panel data.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Limits</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The permissible number of wildcards is not directly limited. However, there is a limit about the overall length of the text. It must not exceed 20 MB (excluding wildcards). That said, many Internet users regard emails of this size as impolite because they can quickly exceed the storage capacity allotted by their e-mail provider. Also, some mail servers are set up to simply delete messages of more than 1 MB, assuming an attack on the mail system (mail bombs).</p>\n<p class=\"wysiwyg-text-align-justify\"><em>EFS</em> is capable of generating hundreds of personalized e-mails within a few seconds. The procedure used for this purpose is also subject to an installation-related limit. You can approximate the number of permissible wildcards as follows:</p>\n<p class=\"wysiwyg-text-align-justify\">2 * text length in byte ^ number of wildcards &lt; 20 MB</p>\n<p class=\"wysiwyg-text-align-justify\">One text character equals one byte. Please note that the text of emails in HTML format is about 2.2 times larger than the actual text. The amount may even grow sixfold if you use Unicode characters. </p>\n<p class=\"wysiwyg-text-align-justify\">The so-called “Dr. Grauert letter” (ISO 10561), which is commonly used in printer tests, contains about 1500 characters.</p>\n<p class=\"wysiwyg-text-align-justify\">20000000 bytes / 1500 bytes = 13334</p>\n<p class=\"wysiwyg-text-align-justify\">For plain text mail, this equals about 213. This means that you could use a total of 13 wildcards. Most emails, of course, are much shorter and also contain fewer wildcards. However, the installation’s limit can also be changed by system administration if required.</p>\n<p class=\"wysiwyg-text-align-justify\">Additionally, the total number of if-conditions available for mail templates is limited to 400 for all if-, else- and /if-conditions in one mail template.</p>\n<p class=\"wysiwyg-text-align-justify\"><u>Conditional replacement of e-mail text</u></p>\n<p class=\"wysiwyg-text-align-justify\">The EFS e-mail functions allow you to use conditional replacement. This means that, in the future, it will be possible to output various mail contents depending on data from participant administration or on other pre-set conditions. The syntax for conditional replacement, in a generalized form, is as follows:</p>\n<pre class=\"wysiwyg-text-align-justify\"><span class=\"\" style=\"margin-right: -8px; display: flex; padding-right: 8px !important; color: #172b4d; font-family: SFMono-Medium, ' SF Mono' , ' Segoe UI Mono' , ' Roboto Mono' , ' Ubuntu Mono' , Menlo, Consolas, Courier, monospace; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: pre; background-color: rgba(9, 30, 66, 0.06); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\" data-testid=\"renderer-code-block-line-1\" data-ds--code--row=\"\"><span class=\"\">{if operand1 operator operand2} </span></span><span class=\"\" style=\"margin-right: -8px; display: flex; padding-right: 8px !important; color: #172b4d; font-family: SFMono-Medium, ' SF Mono' , ' Segoe UI Mono' , ' Roboto Mono' , ' Ubuntu Mono' , Menlo, Consolas, Courier, monospace; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: pre; background-color: rgba(9, 30, 66, 0.06); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\" data-testid=\"renderer-code-block-line-2\" data-ds--code--row=\"\">text to be output if the condition is met </span><span class=\"\" style=\"margin-right: -8px; display: flex; padding-right: 8px !important; color: #172b4d; font-family: SFMono-Medium, ' SF Mono' , ' Segoe UI Mono' , ' Roboto Mono' , ' Ubuntu Mono' , Menlo, Consolas, Courier, monospace; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: pre; background-color: rgba(9, 30, 66, 0.06); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\" data-testid=\"renderer-code-block-line-3\" data-ds--code--row=\"\">{else} </span><span class=\"\" style=\"margin-right: -8px; display: flex; padding-right: 8px !important; color: #172b4d; font-family: SFMono-Medium, ' SF Mono' , ' Segoe UI Mono' , ' Roboto Mono' , ' Ubuntu Mono' , Menlo, Consolas, Courier, monospace; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: pre; background-color: rgba(9, 30, 66, 0.06); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\" data-testid=\"renderer-code-block-line-4\" data-ds--code--row=\"\">text to be output if the condition is not met </span><span class=\"\" style=\"margin-right: -8px; display: flex; padding-right: 8px !important; color: #172b4d; font-family: SFMono-Medium, ' SF Mono' , ' Segoe UI Mono' , ' Roboto Mono' , ' Ubuntu Mono' , Menlo, Consolas, Courier, monospace; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: pre; background-color: rgba(9, 30, 66, 0.06); text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\" data-testid=\"renderer-code-block-line-5\" data-ds--code--row=\"\">{/if}</span></pre>\n\n<p class=\"wysiwyg-text-align-justify\">In this, the following variables must be adjusted to specific projects:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>operand1</strong> and <strong>operand2</strong>: Wildcards or fixed values.</p>\n</li>\n<li>\n<p><strong>operator</strong>: One of the comparative operators (“=”, “!=”, “&lt;” or “&gt;”).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please make sparing use of conditional replacement: A growing number of “if” blocks increases the risk of triggering an infinite loop. Therefore, make sure not to create too many “if” blocks.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>example</strong></p>\n<p class=\"wysiwyg-text-align-justify\">An invitation mail to the respondents in a personalized project is to contain German text if the participant lives in Germany. Participants from other countries are to receive an English text. The information on which country the participant lives in is stored in the corresponding column of participant administration and accessible via the #country# e-mail wildcard. Code: 1 = Germany, 2 = other countries. In this case, the condition definition used to address the participant is as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>{if #country# = \"1\"}Sehr geehrter Teilnehmer,{else}Dear participant,{/if}</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">German participants will now be addressed in German, while participants from other countries will be addressed in English.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example: Gender-specific salutation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You want to address participants depending on their gender with \"Der Mrs. x“ or „Dear Mr. x“. The gender of participants is stored in the variable „u_gender“ in participant administration. Encoding: 1 = male, 2 = female. It can be inserted using the e-mail wildcard #u_gender#. Use the following syntax to insert the proper salutation in the email:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>{if #u_gender# = \"2\"}Dear Mrs.{else}Dear Mr.{/if} #u_name#</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example: Language-specific text</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In a bilingual survey, you want to address participants in German if this is their native language, otherwise in English. Participants’ language is stored in the variable „u_language“. Encoding: 1 = German, 2 = English. The wildcard #u_language# allows to access the language information. The following syntax ensures that participants receive the e-mail in the proper language:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>{if #u_language# = \"1\"}Sehr geehrter Teilnehmer...{else}Dear participant, ...{/if}</p>\n</li>\n</ul>\n<h3 id=\"setting-the-dispatch-date-dispatch-period-and-status-of-e-mails\" class=\"wysiwyg-text-align-justify\"><strong>Setting the dispatch date, dispatch period, and status of e-mails</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Located below the actual mail form, the “Delivery options” section allows you to set the dispatch date and the dispatch period or to set the status of the mail to “Hold”.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414437522\" alt=\"image2019-3-13_11-26-9.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Validate disposition codes before dispatch</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Check the option in order to avoid multiple invitations or reminders to the same participant. The respective mail will now only be sent to participants who are active, and either have not been invited yet, have suspended their survey, or where mail delivery has failed previously.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Set mail status to “Hold”</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If, before sending the e-mails, you want to check their number and content in the mail report, you can tick this checkbox. The emails will then be kept in the queue. Using this option is advisable if, for reasons relating to the organization of work, you have a staff member create the e-mails, but they are not to be sent until released by the project manager.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>When to send: .. : (Time at server = ...)</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Instead of sending the prepared e-mails immediately, you also have the option of choosing a later date. The emails will then be kept in the queue until the sending date. This is advisable, for example, if the invitation to a survey is not to be sent until a certain event has occurred or outside of your office hours. For example, you can prepare the invitation emails for a survey that is scheduled to start on a weekend but have the emails sent automatically only when the pre-set time is reached. This way, you can prevent participants from trying to access the survey before the start of the project.</p>\n<p class=\"wysiwyg-text-align-justify\">A group of drop-down lists in the “When to send” field is available for setting the date and time.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can use a calendar, which is opened by clicking on the <strong>Calendar</strong> icon, to set the date.</p>\n</li>\n<li>\n<p>The exact time of sending must be specified manually. The current time is displayed on the left below the menu. If you have taken advantage of the possibility to set your local time, this time will be displayed below, in the “Local date” field, to facilitate the conversion.</p>\n</li>\n<li>\n<p>Queued e-mails that have the same dispatch time will be sent in the order in which they were created. Any mails that have been set eight hours ahead due to a previous failed attempt but have an earlier or the same dispatch date will therefore be sent with priority.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>„When to send“ uses the recipient‘s time zone</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Check the option in order to confirm the time of mail dispatch to the recipient‘s individual time zone. A recipient‘s individual time zone is saved within the u_timezone variable. Please note that participants may live in time zones ahead of your own, therefore it may be required to plan in advance.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Setting a dispatch period for dynamic dispatch</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In large surveys, mail dispatch is often organized in waves to avoid server overload. The organization of participants in waves is frequently performed manually: In the participant administration, participants are assigned to the respective waves with specific variables or characteristics. To invite a wave, the project manager then looks for the participants with the appropriate value and manually completes the entire mail dispatching process. With <em>EFS</em>, this is not necessary: Instead of manually organizing the participants in different waves to be processed in daily intervals, you simply specify a time frame within which the mails of your mailing action are to be sent. The system will then divide the total amount of mail into portions to be sent out in even distribution across the specified interval.</p>\n<p class=\"wysiwyg-text-align-justify\">You will find the corresponding function in the “Dispatch period for dynamic dispatch” field. Enter the interval in minutes. By default, the field is blank and no distribution is performed.</p>\n<p class=\"wysiwyg-text-align-justify\">The dynamic dispatch function does not override the technical limits of mail dispatch: An <em>EFS</em> installation can process a fixed mail volume every 10 minutes. Per default, the maximum volume is 1,000 emails, up to 2,000 emails are possible. If more emails are generated, they will be queued and processed successively.</p>\n<h3 id=\"checking-finished-e-mails-and-saving-them-as-templates\" class=\"wysiwyg-text-align-justify\"><strong>Checking finished e-mails and saving them as templates</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The mail preview allows you to check your message to the respondent before finally sending it.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Separate previews are output for text and HTML emails.</p>\n</li>\n<li>\n<p>Both wildcards and line breaks are taken into consideration.</p>\n</li>\n<li>\n<p>You can scroll through the e-mails to the various recipients and check them successively.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Special features of HTML mail in the preview</strong></p>\n<p class=\"wysiwyg-text-align-justify\">E-mails for which the HTML format has been chosen and used according to the instructions in the preceding chapter can only be displayed correctly in the preview if the HTML code used is also XML-compliant. They will, however, be sent in the correct format.</p>\n<p class=\"wysiwyg-text-align-justify\">Any HTML code characters you have entered will be displayed in a masked form. This means that the characters will also be displayed as HTML code. Therefore, they cannot have any impact on, for example, formatting. Before sending, they will be converted to the original tags you entered. Please note that HTML formats in plain text mail cannot be interpreted. Therefore, you must have specified the HTML format for the mail.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Passwords in the preview</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The participants’ passwords are not always displayed in the mail preview as clear text, but will be either masked using “*” characters or displayed, depending on the project type and the team the user viewing the data belongs to:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Personalized surveys (PE): If you have read rights for “mail_passwords”, passwords will be displayed in the mail preview. If you do not have read rights, the passwords will be masked using “*”.</p>\n</li>\n<li>\n<p>Employee surveys (ES): The passwords should never be visible in the mail preview.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Saving the e-mail as a mail template</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If you wish to re-use the e-mail at a later stage, simply tick the “Save as mail template (including wildcards)” checkbox below the preview and enter a title for the new template before you confirm by clicking <strong>Send</strong>.</p>\n<h3 id=\"managing-mail-templates\" class=\"wysiwyg-text-align-justify\"><strong>Managing mail templates</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Libraries</strong> → <strong>Mail templates</strong> menu, you will find an overview of all the mail templates for which you hold access rights along with their most important properties. You have the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Create template button</strong>: The dialog for creating a new template will be opened. The other form fields for mail settings and mail text are familiar from the e-mail dispatch.</p>\n</li>\n<li>\n<p>Clickable links in the table and the familiar icons in the “Actions” column allow you to edit individual mail templates:</p>\n<ul>\n<li>\n<p><strong>Description</strong> link: The dialog for editing an existing template will be opened.</p>\n</li>\n<li>\n<p><strong>Status</strong> link: The entries <strong>Active</strong> and <strong>Inactive</strong> in the “Status” column are also clickable links. You can change the status with a click on the respective link: An inactive mail template will no longer be offered in the mail forms.</p>\n</li>\n<li>\n<p><strong>Preview</strong>: The template will be opened in the preview. As the project context is missing in the <strong>Mail template </strong>menu, wildcards will not be replaced in the preview.</p>\n</li>\n<li>\n<p><strong>Edit mail template</strong>: The dialog for editing an existing template will be opened.</p>\n</li>\n<li>\n<p><strong>Copy mail template</strong>: The template is copied. You can open the copy directly by clicking the link in the green confirmation message.</p>\n</li>\n<li>\n<p><strong>Edit rights</strong>: The dialog for assigning object rights for the template will be opened.</p>\n</li>\n<li>\n<p><strong>Delete mail template</strong>: The template will be deleted following a confirmation prompt.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Before deleting mail templates, please make sure that they are not linked to a live project.</p>\n<p class=\"wysiwyg-text-align-justify\"><em>EFS People</em> installations feature a check to prevent deletion of mail templates that are still linked to a panel function (e.g. a CMS function module, an update rule, a promotional campaign, or a bonus). Instead, a list of the relevant panel functions will be displayed, so that you can either refrain from deleting or replace an unwanted template. However, mail template assignments in <em>EFS Survey</em> (e.g. mail trigger) or in <em>EFS Employee</em> will not be checked.</p>\n<h3 id=\"properties-of-mail-templates-in-detail\" class=\"wysiwyg-text-align-justify\"><strong>Properties of mail templates in detail</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Mail templates are characterized by the following properties, which are partly defined by the user and partly set automatically by the system.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Mail template types</strong></p>\n<p class=\"wysiwyg-text-align-justify\">When selecting mail templates via the EFS mail forms, only those templates will be available that are appropriate to your current operation. For example, if you are inviting participants, only templates for invitation mails will be offered for selection. This is controlled by assigning the templates to certain mail template types. The following table provides an overview of the various types and their respective applications.</p>\n<h3 id=\"defining-senders-addresses-for-mail-dispatch\" class=\"wysiwyg-text-align-justify\"><strong>Defining senders’ addresses for mail dispatch</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Not only the mail contents but also the senders’ addresses are usually predefined in <em>EFS</em>. This is of particular importance if you want to use addresses other than your own, e.g. a common mailbox that may be accessed by other staff, as well: For you to be able to select these addresses in the EFS mail form, they must be registered in the system. This function in brief:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The senders’ addresses are managed in the <strong>Libraries</strong> → <strong>Mail templates</strong> → <strong>Mail senders</strong> menu.</p>\n</li>\n<li>\n<p>Optionally, it is possible to enter a real name to be inserted next to the actual email address in the mail subject header. Usually, this is the name of the project owner. Please note that it is not possible to use names in double-byte languages (e.g. Chinese).</p>\n</li>\n<li>\n<p>Which user teams may use or configure a particular sender’s address, is controlled via a specific object right.</p>\n</li>\n<li>\n<p>Which user teams may access the <strong>Mail senders</strong> menu, is controlled via read right for “options”.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">When adding a mail sender an SPF (Sender Policy Framework) check is executed on the sender’s domain to verify it is set up properly in accordance with our recommendations. This helps avoid mail delivery issues causing emails sent by <em>EFS</em> not to be accepted or being incorrectly flagged as spam. A failed SPF check in <em>EFS</em> does not prevent the creation of the mail sender address and sending mails with these senders is still possible.</p>\n<h3 id=\"managing-sender-addresses\" class=\"wysiwyg-text-align-justify\"><strong>Managing sender addresses</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Mail senders</strong> menu, you will find an overview of all those senders’ addresses for which you hold access rights.</p>\n<p class=\"wysiwyg-text-align-justify\"><u>Edit options</u></p>\n<p class=\"wysiwyg-text-align-justify\">Click on the <strong>Add e-mail address</strong> button to open the dialog for creating a new sender. All you have to enter is the e-mail address, the corresponding real name if desired, and the teams that are granted full access. Clickable links and icons allow you to edit existing mail templates:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Rights</strong>: Opens the dialog where you can assign read or write rights for the sender’s address to user teams.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: E-mail addresses can be deleted by ticking the checkbox in the “Delete” column and then clicking on the Delete button</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You need read rights for “options” to access the <strong>Mail senders</strong> menu and the functions described below.</p>\n<p class=\"wysiwyg-text-align-justify\">Mail senders linked to a mail template cannot be inadvertently deleted. If you try to delete mail senders that are still linked to a mail template, a list of the affected templates will be displayed. Only after the sender’s address has been changed in all templates is it possible to delete the address.</p>\n<h3 id=\"the-mail-dispatch-process-in-efs\" class=\"wysiwyg-text-align-justify\">\n<strong>The mail dispatch process in</strong><em><strong> EFS</strong></em>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">If you trigger the dispatch process, EFS forwards your mail to a dedicated mail server which is responsible for organizing the actual dispatch. The available dispatch volumes are split up as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>At the start of each dispatch interval (i.e. every ten minutes), all mail dispatch orders in the queue will be registered along with their size (i.e. the number of mails).</p>\n</li>\n<li>\n<p>It will be checked whether the sum total of the mail to be sent is greater than the maximum mail volume allowed per dispatch interval. The maximum mail volume can be configured.</p>\n</li>\n<li>\n<p>If the sum total is smaller than the maximum mail volume, all mail will be sent.</p>\n</li>\n<li>\n<p>If the sum total is greater than the maximum mail volume, the dispatch orders are sorted by ascending size. Then, the dispatch resources are distributed equally among the dispatch orders. I.e. one by one, each order is assigned one mail, until the limit is reached. This way, smaller orders are completed quickly. The remaining mails would be processed according to the same principle in the subsequent dispatch intervals.</p>\n</li>\n<li>\n<p>If the mail server does not accept mail at all, the system will try to dispatch it again eight hours later. After four failed dispatch attempts, the mail will be deleted and the recipient will be assigned disposition code 14. The number of repeats can be configured.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Syntax check for e-mail addresses during dispatch</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Generally, EFS performs a syntax check on every mail address. This happens once when entering mail addresses and also, to be on the safe side, a second time when generating and sending mail. If EFS detects a mail address that does not comply with the RFC, this address will automatically be excluded from mail sending, and a corresponding message will be output on the screen. EFS Survey only allows addresses with the following format:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>local_part@domain</p>\n</li>\n<li>\n<p>Please note that “domain” must be an Internet domain with a valid syntax.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If, despite all this, an invalid mail address has found its way into the database, e.g. through subsequent corrections, the mail will be checked again when it is sent. The sender will then be notified that the e-mail address is incorrect and, therefore, the e-mail cannot be delivered.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Standard mail headers</strong></p>\n<p class=\"wysiwyg-text-align-justify\">As EFS performs mailings in the form of bulk dispatch, a corresponding header line (“Precedence: bulk”) is added to each e-mail, which enables automatic recognition as a bulk mailing. So-called auto responders should detect this. Unfortunately, not every mail system is properly configured. Therefore, it may still occur that you receive automatically generated notifications of absence as replies.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If necessary, installation-specific mail headers can be used.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Limiting the Mail Volume per Mail Interval</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The mails in the queue are processed in packages: per default, up to 300 emails will be processed in 10-minute intervals. You can change the value of 300 emails. To do so, open the Options-&gt;System settings menu and enter the new maximum value in the “Job size for mail sending” field. Up to 2,000 emails can be sent per package.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Defining the number of repeats for dispatch problems</strong></p>\n<p class=\"wysiwyg-text-align-justify\">If the mail server does not accept mail or if it is not possible to connect to the mail server at all, the system will try to dispatch it again eight hours later. After four unsuccessful attempts, the mail will be deleted and the recipient will be assigned disposition code 14. You can change the maximum number of dispatch attempts. To do so, open the <strong>Options</strong> → <strong>System settings</strong> menu and enter the new maximum value in the “Maximum number of attempts to dispatch the mail” field.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The delay between delivery attempts</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You may define the amount of time (in minutes) to pass between delivery attempts. Find the respective option in the Options menu → <strong>System</strong> <strong>Settings</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Using installation-specific mail headers</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Installation-specific mail headers can be attached to the mail sent from an EFS installation. This is particularly useful for external bounce systems, for example. To do so, our support has to activate this function and define the desired mail header values. In the mail form, you will then find a field “Value for wildcard #extra_values# in additional mail headers”. There you can specify the values that were predefined by the support.</p>\n<p class=\"wysiwyg-text-align-justify\">These mail headers are specified for an <em>EFS</em> installation, not for an individual project. They cannot be used in collective installations.</p>\n<h3 id=\"controlling-dispatch-processes-and-intervening-in-processes\" class=\"wysiwyg-text-align-justify\"><strong>Controlling dispatch processes and intervening in processes</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Mail report</strong> is designed to assist you in properly managing the large numbers of e-mails needed for bigger projects. You will find the main report.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>for project-specific mails: in the <strong>Survey menu</strong> of all project types.</p>\n</li>\n<li>\n<p>on <em>EFS People</em> installations: for emails sent from the<strong> People</strong> → <strong>Groups</strong> menu: in the <strong>Groups</strong> menu.</p>\n</li>\n<li>\n<p>on <em>EFS People</em> installations: for emails sent from the <strong>People</strong> → <strong>Contacts</strong> → <strong>Send e-mail</strong> menu: in the <strong>Contacts</strong> menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The mail report displays all mails in the outgoing queue, sorted by sending operations. You have the following editing options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>View</strong>: Allows you to display a mail that has been selected from the respective dispatch process at random with the wildcards replaced.</p>\n</li>\n<li>\n<p><strong>Release</strong>: Allows you to release and execute a dispatch process with “Hold” status.</p>\n</li>\n<li>\n<p><strong>Hold</strong>: The mail dispatch is interrupted, e.g. if a questionnaire requires re-editing.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: Mails are removed from the queue. In EFS Panel installations, this work process includes the option of saving the recipients of the deleted e-mails in a separate group.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you delete emails, our support team can no longer determine who has already received a mail and who has not in subsequent support requests.</p>\n<h3 id=\"viewing-archived-mails\" class=\"wysiwyg-text-align-justify\"><strong>Viewing archived mails</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Most of the emails sent from <em>EFS</em> are archived and can be viewed for six months:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Personalized surveys, employee surveys, multi-source feedback, panel surveys,, and master data surveys feature an overview of all sent emails.</p>\n</li>\n<li>\n<p>In personalized surveys, employee surveys, and multi-source feedbacks, the mails are listed in the detail view of the respective participant.</p>\n</li>\n<li>\n<p>In panel and master data surveys, the mails are listed on the <strong>Contacts by System mail</strong> tab in the detail view of the respective panelist.</p>\n</li>\n<li>\n<p>With the appropriate rights,, you can view all project-specific mail processes of the installation in a centralized manner.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the long run, the data volumes involved in the sending of emails will put an unnecessary strain on the installation’s performance. Once the project is over, the archived emails are usually not needed ever again. The mail archives will therefore be cleaned automatically at regular intervals: Archived mail will be deleted six months after dispatch (depending on the size of the installation this may be executed earlier).</p>\n<h3 id=\"viewing-project-specific-dispatch-processes\" class=\"wysiwyg-text-align-justify\"><strong>Viewing project-specific dispatch processes</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Project-specific dispatch processes are archived. You can view the data here:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>personalized projects and employee surveys: <strong>Survey menu</strong> → <strong>Mail report</strong> menu.</p>\n</li>\n<li>\n<p>panel and master data surveys: <strong>Sample</strong> → <strong>Mail archive</strong> menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><u>Mail report</u></p>\n<p class=\"wysiwyg-text-align-justify\"><u>T</u>he<strong> Mail</strong> report, which is located in the survey menu, gives an overview of all e-mails that were sent during the survey. Every time you send one or more e-mails from participant administration, an entry is<br>made in the report. This enables you to subsequently check whether, for example, a certain group or individual has already received an e-mail. You may view the complete mail (with placeholders) by clicking on <strong>Mail</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">In the overview list, the following information is displayed for the different sending processes within the respective project:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Mailing: internal mailing-ID. The link displayed will provide you with detailed information on the specific process.</p>\n</li>\n<li>\n<p>Subject: e-mail subject. The link displayed will provide you with detailed information on the specific process.</p>\n</li>\n<li>\n<p>User: user who performed the dispatch.</p>\n</li>\n<li>\n<p>Date: time and date of dispatch.</p>\n</li>\n<li>\n<p>Total: a total of all e-mails.</p>\n</li>\n<li>\n<p>Queued: a total of all e-mails generated for immediate or future dispatch. Queued emails may be held, resumed, or canceled.</p>\n</li>\n<li>\n<p>Sending: total of all e-mails delivered to the dispatching mailing server yet to be delivered to the respective recipient(s). Please note this process might take up to<br>several days.</p>\n</li>\n<li>\n<p>Sent: The number of e-mails that were successfully delivered to the receiving mailing server.</p>\n</li>\n<li>\n<p>Rejected: a total of all e-mails rejected and classified as spam-mail.</p>\n</li>\n<li>\n<p>Delivery failed: a total of e-mails that could not be delivered due to trouble on the part of the recipient address.</p>\n</li>\n<li>\n<p>Not reachable: a total of all e-mails that could not be delivered because the recipient‘s address or the domain does not exist.</p>\n</li>\n<li>\n<p>Canceled: The number of e-mails canceled.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you click on the ID of a dispatch process in the “Mailing” column, you will see detailed information on all individual processes.</p>\n<p class=\"wysiwyg-text-align-justify\">Mails can be filtered by status by selecting the respective entry in the drop-down menu.</p>\n<h3 id=\"viewing-project-specific-dispatch-processes-installation-wide\" class=\"wysiwyg-text-align-justify\"><strong>Viewing project-specific dispatch processes installation-wide</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Project mail overview</strong> tab in the <strong>Options</strong> → <strong>Platform cockpit</strong> menu gives a central overview of all mail processes that can be initiated from the current installation.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can display mail activity from any desired period in time.</p>\n</li>\n<li>\n<p>Listed for each mail activity are the name of the project, precise dispatch date, project type, field time, e-mail subject, and number of mails submitted.</p>\n</li>\n<li>\n<p>Excluded from the count are mail submission processes from deleted projects.</p>\n</li>\n<li>\n<p>Mail activities are arranged by project.</p>\n</li>\n<li>\n<p>Access to this tab is only possible for users with root or admin rights. These users may see mail activities for those projects for which their team holds read rights.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Read rights for <em>platform_cockpit</em> are required to view and open the <strong>Options</strong> → <strong>Platform cockpit</strong> menu.</p>\n<h2 id=\"categories\" class=\"wysiwyg-text-align-justify\"><strong>Categories</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Under the menu item <strong>Categories,</strong> you can create both <strong>Default group</strong> and <strong>Rater group categories</strong>. Under the <strong>Default group </strong>you create global categories which you use to create thematic links between the projects. <strong>Rater group categories</strong> belong in the context of the <em><strong>Me </strong>Guide</em> scenario.</p>\n<h3 id=\"default-group\" class=\"wysiwyg-text-align-justify\"><strong>Default group</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">We have a new <strong>Categories</strong> are available within our <strong>Libraries</strong>. <strong>Libraries</strong> are accessible from the main top-right <strong>System</strong> menu. Categories allow you to create themes within your surveys/projects and can also be assigned to tickets within our <em>Action Board </em>portals module. Once in the <strong>Categories</strong> area, you can add a category using <strong>+ Category</strong>. The configuration area opens, where you assign an individual meta name, select a color, and deliver an optional translation. The meta name is mandatory and limited to 3 to 30 characters. Umlauts cannot be used. If you want to delete a category, you must make sure that all connections have been disconnected. By clicking on the edit icon, you can find out which connections are available for a category. Questions can be assigned to a category in the questionnaire editor and action tickets in the detail view. Before you can delete a category, however, you must undo each connection for which the trashcan icon is available in the <strong>library</strong> area.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444583186\" alt=\"Categories.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">You create default groups in each of the languages available in the drop-down list. You select a language by ISO code after clicking <strong>+ Category</strong>, enter the title in the desired language, and click <strong>Add</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">Path:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><em>Libraries</em> → <em>Categories</em> → <em>Default group</em> (Tab)</p>\n</li>\n</ul>\n<h3 id=\"rater-group-categories\" class=\"wysiwyg-text-align-justify\"><strong>Rater group categories</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You create the new Rater-Groups category used in the <em><strong>Me</strong></em> Guide scenario under <strong>Libraries</strong>. You will find there the categories: <strong>Self-Assessment</strong>, <strong>Manager</strong>, <strong>Peers,</strong> and <strong>Team</strong>. These cannot be configured either. However, you can create new ones by clicking on the <strong>+ category</strong> and assigning a unique meta name in the first step. Then you use the ISO code to specify the language of the title you want to assign. You save.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414426130\" alt=\"Rater group categories.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">Path: <em>Libraries</em> → <em>Categories</em> → <em>Rater-Groups categories</em> (Tab)</p>\n<h2 id=\"scale-library\" class=\"wysiwyg-text-align-justify\"><strong>Scale Library</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Matrix scales are frequently used several times: It may be that a specially developed scale is used several times in a survey or that a popular scheme such as, for example, school marks, crops up time and time again. The scale library available across the entire installation saves you the trouble of creating a scale repeatedly: You only need to create a frequently requested scaling scheme once in the scale library. From there you can import it into the matrix questions and then adapt it to the specific situation.</p>\n<p class=\"wysiwyg-text-align-justify\">Imagine, for example, that in your survey you have evaluated the skills of ten well-known football players each in a matrix question. For evaluation, you choose the following scale:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Football wizard – Good technique – Acceptable average – Useless – Don’t know.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Instead of rebuilding this scheme for each of the ten matrix questions only create the scale once in the scale library and then import it into the corresponding matrix questions.</p>\n<p class=\"wysiwyg-text-align-justify\">To access the scale library, go to the <strong>Libraries</strong> → <strong>Scale library</strong> menu. Various icons allow to open these scales for viewing or editing as well as to copy or delete them. Read rights for <em>show_scala</em> are necessary for accessing the scale library.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444590482\" alt=\"Scale libraries.jpg\"></p>\n<h3 id=\"creating-a-new-scale-in-the-scale-library\" class=\"wysiwyg-text-align-justify\"><strong>Creating a new scale in the scale library</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Create scale</strong> button.</p>\n</li>\n<li>\n<p>Enter the name plus a short description of the scale to be created, then click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>As with <strong>Paste from Word</strong>, enter all desired scale options into the “Scale options” field. Each row in the input field is interpreted as an answer option.</p>\n</li>\n<li>\n<p>Usually, the options are automatically numbered and encoded. If you want to specify your codes yourself, enter the desired value before each option, using a semicolon. Then, specify this separator in the “The separator for the code” field.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>In the next dialog, you can edit the new options or define graphical form elements.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">From now on, you can use this scale when creating matrix questions.</p>\n<h3 id=\"exporting-a-scale-from-a-question-into-the-scale-library\" class=\"wysiwyg-text-align-justify\"><strong>Exporting a scale from a question into the scale library</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">As an alternative to creating a scale in the scale library, you can also export a scale from a question into the scale library.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the question view, open the “Scale options” section.</p>\n</li>\n<li>\n<p>Click on the <strong>Export scale</strong> button.</p>\n</li>\n<li>\n<p>A pop-up window will prompt you to enter the title under which the scale is to be stored in the scale library.</p>\n</li>\n<li>\n<p>After you have clicked <strong>OK</strong> to confirm, the scale will be stored. You will receive a message indicating that the operation was successful and can continue your work.</p>\n</li>\n</ul>\n<h3 id=\"inserting-scales-from-the-scale-library-into-the-questionnaire\" class=\"wysiwyg-text-align-justify\"><strong>Inserting scales from the scale library into the questionnaire</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">All matrix questions containing a scale allow you to access the scale library:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To do so, open the “Scale options” section in the question view.</p>\n</li>\n<li>\n<p>Click on the <strong>Import scale</strong> button.</p>\n</li>\n<li>\n<p>A pop-up window will open. In it, you can select scales from the scale library using a drop-down list.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The desired scale will be inserted into your matrix question, and you can continue editing the characteristics as desired.</p>\n</li>\n</ul>\n<h2 id=\"survey-messages\" class=\"wysiwyg-text-align-justify\"><strong>Survey messages</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Every <em>EFS</em> installation has a library where survey messages can be stored for use in other projects. It can be found in the <strong>Libraries</strong> → <strong>Survey messages</strong> menu.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444586002\" alt=\"Messages.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This library contains translations of the default messages in 29 languages. If you want to conduct a project in one or more of these languages, simply select and upload the translated default version.</p>\n</li>\n<li>\n<p>You can create further sets of messages or save them from a project to the library, as described above.</p>\n</li>\n<li>\n<p>Survey messages can be exported and imported into another installation.</p>\n</li>\n<li>\n<p>You can compare two selected sets of survey messages.</p>\n</li>\n</ul>\n<h3 id=\"overview-of-the-survey-messages-in-an-installation\" class=\"wysiwyg-text-align-justify\"><strong>Overview of the survey messages in an installation</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Libraries</strong> → <strong>Survey messages</strong> menu, you will find an overview of all the survey messages for which you hold read rights. The following essential processes can be invoked via buttons:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Create survey messages</strong>: After entering a name and a description, a new empty set of messages is created.</p>\n</li>\n<li>\n<p><strong>Import survey messages</strong>: This allows you to import new survey messages in an Excel file.</p>\n</li>\n<li>\n<p><strong>Export all survey messages</strong>: Triggers the export of all existing messages.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Furthermore, you can export survey messages selected via the “Actions” checkbox and the drop-down list. You can edit individual sets using the “Actions” icons:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>For default sets only: <strong>Preview</strong>: Opens the dialog, where you can view the default set. Please note that the default sets cannot be edited. If you want to edit a default set, copy it and subsequently modify the copy.</p>\n</li>\n<li>\n<p>For user-defined sets only:<strong> Edit</strong>: Opens the edit dialog.</p>\n</li>\n<li>\n<p><strong>Copy</strong>: You can copy a set of survey messages and then modify this copy as required. This is particularly recommended if you want to modify standard messages: the standard texts themselves cannot be edited directly.</p>\n</li>\n<li>\n<p>For user-defined sets that were created by copying the standard messages: <strong>Recover</strong>: Resets the content to its original status, i.e. the texts of the standard message.</p>\n</li>\n<li>\n<p>For user-defined sets only: <strong>Rights</strong>: Opens the dialog where you can assign rights for the messages to the desired teams. The default sets are available to all users.</p>\n</li>\n</ul>\n<h3 id=\"transferring-survey-messages-to-another-efs-installation\" class=\"wysiwyg-text-align-justify\"><strong>Transferring survey messages to another EFS installation</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Survey messages can be exported and imported into another installation. There are two options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To export one or several sets of survey messages, tick the checkboxes in the “Actions” column of the <strong>Libraries</strong> → <strong>Survey messages</strong> menu, select the action “Export”, and confirm by clicking on <strong>Execute</strong>. An Excel file containing the selected message sets will be generated.</p>\n</li>\n<li>\n<p>If you want to export all existing messages, use the <strong>Export all survey messages</strong> button.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the target installation, go to the <strong>Libraries</strong> → <strong>Survey messages</strong> menu, and click on the <strong>Import survey messages</strong> button. Via the import dialog, you can upload an Excel file with the desired messages.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Defining default survey messages for an installation</strong></p>\n<p class=\"wysiwyg-text-align-justify\">As an administrator, you can determine what default set of messages is to be used across the installation when creating a new project. When administering an installation where English is predominantly used, this allows you to ensure, for example, that an English message set is always imported.</p>\n<p class=\"wysiwyg-text-align-justify\">To do so, navigate to the <strong>Options → System settings</strong> menu. In the “Default survey messages” field you can select one of the available message sets and then save it with <strong>Change</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Options</strong> → <strong>System settings</strong> menu is only accessible to members of the administrator team or the system administrator team.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Comparing survey messages</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You can compare two sets of survey messages. This may be useful, for example, if two sets are linguistically very similar, such as survey messages in American and British English. Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the <strong>Comparison of Survey Messages</strong> submenu.</p>\n</li>\n<li>\n<p>Specify which sets are to be compared.</p>\n</li>\n<li>\n<p>By clicking on <strong>Compare</strong>, you trigger the check.</p>\n</li>\n<li>\n<p>The two sets will be listed in full, highlighting any divergent fields.</p>\n</li>\n</ul>\n<h2 id=\"macros\" class=\"wysiwyg-text-align-justify\"><strong>Macros</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Libraries</strong> → <strong>Macros</strong> menu, you can find all macros of the installation that you’re authorized to access. The following editing functions are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Edit</strong>: By clicking on this icon, you can switch to the <strong>Macro settings</strong> tab for the respective macro.</p>\n</li>\n<li>\n<p><strong>Edit actions</strong>: By clicking on this icon, you can switch to the <strong>Actions</strong> tab for the respective macro.</p>\n</li>\n<li>\n<p><strong>Delete</strong>: By clicking on this icon, you can delete the macro.</p>\n</li>\n<li>\n<p><strong>Rights</strong>: Clicking on this icon opens the dialog for rights administration. Here, you can define, which teams will be allowed to execute the respective macro. Read rights permit the execution of a macro, while write rights allow users to edit a macro. Please note that macros can only be executed in projects for which the user has additional write rights.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414427410\" alt=\"Macros.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The macro administration is designed for up to 100 macros. If you and your colleagues use macros a lot, take care to use meaningful names: The better the title, the easier it is to select the appropriate macro from a project.</p>\n<p class=\"wysiwyg-text-align-justify\"><br>Macros are created in the <strong>Libraries</strong> → <strong>Macros</strong> menu. To create a macro the <em>create_macro</em> write permission is needed. You have to select the actions to execute and you have to configure the actions by setting the appropriate parameters.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414440082\" alt=\"Create new macro.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating a new macro and selecting actions</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the Create macro button. This will open the entry form shown.</p>\n</li>\n<li>\n<p>Set the basic properties of the macro:</p>\n<ul>\n<li>\n<p>Name</p>\n</li>\n<li>\n<p>Description</p>\n</li>\n<li>\n<p>Suppress output: If the checkbox is ticked and the macro activated, the output of precise information on the process will be suppressed, and only a message indicating success or failure will be output. It is recommended that you activate the message output when first testing a macro, but switch it off after a successful test.</p>\n</li>\n<li>\n<p>Offer for projects of type: You can select the project types for which the macro is to be available.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414441490\" alt=\"Actions.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The select boxes in the “Actions” area allow you to select preset actions.</p>\n</li>\n<li>\n<p>If you wish to select only individual actions, click on these actions in the “Available actions” field, and then click on the simple <strong>Arrow</strong> icon to move them into the “Selected actions” field.</p>\n</li>\n<li>\n<p>If you wish to select all available actions, click on the larger arrow.</p>\n</li>\n<li>\n<p>After that, use the up and down arrows below the “Selected actions” select box to sort the actions in the desired order.</p>\n</li>\n<li>\n<p>Finally, confirm by clicking on <strong>Create</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">After creating the macro, you will automatically be taken to the <strong>Actions</strong> tab, which is now active. It allows you to edit or delete actions.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the name of an action or the related <strong>Edit</strong> icon<u>.</u></p>\n</li>\n<li>\n<p>In the “General” area of the entry form, you can enter a specific title for the action and describe it.</p>\n</li>\n<li>\n<p>In the “Parameters” area, the specific parameter for the respective action must be set, in this example, the message set to be chosen.</p>\n</li>\n<li>\n<p>After that, the setting must be saved by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The action now has a completed configuration and will be marked accordingly in the overview of the actions.</p>\n</li>\n<li>\n<p>Make the required settings for all actions accordingly.</p>\n</li>\n</ul>\n<h3 id=\"macro-actions-in-detail\" class=\"wysiwyg-text-align-justify\"><strong>Macro Actions in detail</strong></h3>\n<p class=\"wysiwyg-text-align-justify\"><strong>The following actions can be used in macros.</strong></p>\n<table class=\"wysiwyg-text-align-justify\" style=\"height: 3065px;\" border=\"1\" width=\"785\" data-layout=\"default\">\n<colgroup> <col style=\"width: 145.0px;\"> <col style=\"width: 182.0px;\"> <col style=\"width: 433.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 146.458px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Action</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 184.618px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Name</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" style=\"width: 443.542px;\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Description</strong></p>\n</th>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Activate autosubmit</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>apply_autosubmit</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action activates autosubmitting for single response questions.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Activate/deactivate data cleaning</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>toggle_data_cleaning</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action activates or deactivates automatic data cleaning during the survey.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Activate graphical form elements</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>apply_fe</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action activates graphical form elements.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Apply data cleaning</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>data_cleaning</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action applies data cleaning to the survey data.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Apply predefined survey messages</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>apply_messageset</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows to import of a predefined set of survey messages.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Change project field period</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>set_project_time</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to change the field period of the project. You can either specify a fixed date or select relative times that refer to the next weeks, the current month, or the current year.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Change project status</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>set_project_status</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to change the project status. This permits automation of the process of ending or activating the project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Compile survey</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>generate_survey</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action generates a new survey. It is identical to the <strong>Compile</strong> menu item. You can choose whether the result data are to be deleted while generating the survey.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Create blank pages in the questionnaire</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>create_pages</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>With this action, you can create several blank pages at once in the questionnaire. Optionally, it is possible to create one filter per blank page, indenting the pages automatically below the filters.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Create dynamic block</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>create_page_block</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>With this action, you can insert a dynamic block into the questionnaire, i.e. a random selection of pages, a random sequence, or a loop. The subpages can be created automatically.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Data export</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>export_data</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to export results or address data from the current project. Setting the file type as well as further export options is possible.</p>\n<p>The action is available for anonymous and personalized projects.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Delete all plausibility checks</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>delete_plausichecks</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action will delete all plausibility checks in the selected project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Delete all pretest comments</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>delete_pretest</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action deletes all pretest comments of the current project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Delete all type checks</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>delete_type_checks</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action will delete all types of checks that have been defined in the project's questionnaire. The questions will not be deleted.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Enable advanced completeness checks</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>toggle_hardcore_dacs</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>With this action you can configure all completeness checks (DACs) in the survey to check for every answer category of type \"answer option + text\" if the related text field has also been filled in by the respondent.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Enable/disable debugging features in the survey</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>toggle_debug</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This option activates or deactivates the debug features that can be used in a survey.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Enable deselectable<br>radio buttons</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>apply_triple_state</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>With this action, you can configure all radio buttons in all single response questions of the survey to be deselectable. That means answers in single response questions can be deselected again by clicking the selected radio button again. This feature will only work for participants that have JavaScript enabled</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Export participant codes</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>export_participants</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to export participant codes and disposition codes from the current project into a CSV file. You can select the disposition codes for which the participant codes will be exported. The #PID# wildcard in the file name will be replaced with the current project ID.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Export pretest comments</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>export_pretest</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action exports all pretest comments of the survey into a Microsoft Excel file.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Export questionnaire as XML file</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>export_project</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action exports the questionnaire as an XML file. You can select which subdirectories of the project directory will be exported. The #PID# wildcard in the file name will be replaced with the current project ID.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Import participant codes</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>import_codes</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to import participant codes from a file into participant administration. Each row of the file is interpreted as one code. Therefore, the file should not contain a header. A participant is created for each code. The remaining participant data (e.g. name, password) are set automatically.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Import participants</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>import_participants</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to import participants from a CSV file into participant administration. The first row of the CSV file must contain the column headings.<br>Based on the column headings, an automatic assignment to the participant data saved in participant administration is performed. Columns that have not been recognized are skipped. The following column names can be used: u_account, u_passwd, u_firstname, u_name, u_street, u_zip, u_city, u_phone, u_email, u_www, u_address, u_country, u_other_id.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Import wildcards</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>import_placeholders</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to import wildcards from another project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Load layout template</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>apply_layout</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to copy an existing layout into the current survey.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Run quality correction</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>quality_corrector</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action performs quality correction in the current<br>project. It is identical to the function available under <strong>Statistics</strong>→ <strong>Quality correction</strong>.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Save codebook as .mht file</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>create_codebook</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action saves the codebook of the current project as a .mht file. The function internally selects the <strong>Codebook</strong>menu item and saves its output. The codebook display options can be configured here. In the file name, the #PID# wildcard will be replaced with the current project ID.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Save online statistics as .mht file</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>create_online_stats</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action saves the online statistics of the current<br>project as a .mht file. The function internally selects the <strong>Online statistics</strong> menu item and saves its output. The #PID# wildcard in the file name will be replaced with the ID of the current project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Save open-ended answers as a .mht file</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>create_online_report</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action saves the Open-ended answers of the current project as a .mht file. The function internally selects the <strong>Open-ended answers</strong> menu item and saves its output. The #PID# wildcard in the file name will be replaced with the ID of the current project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 138.438px;\">\n<p>Save the questionnaire as a .mht file</p>\n</td>\n<td style=\"width: 176.597px;\">\n<p>create_print</p>\n</td>\n<td style=\"width: 435.521px;\">\n<p>This action allows you to save the questionnaire as a .mht file. The function internally selects the <strong>Print</strong><br><strong>version</strong> menu item and saves its output. In the file name, the #PID# wildcard will automatically be replaced with the project ID.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">.mht files (Format MHTML: Multipurpose Internet Mail Extension HTML) are used to save Internet pages. They contain all the images and other elements of the saved pages as embedded objects so that the pages can be represented true to the original and with functioning hyperlinks. .mht files can be opened in a browser, though it may be necessary to install a dedicated plugin or add-on.</p>\n<h3 id=\"granting-access-rights-to-macros\" class=\"wysiwyg-text-align-justify\"><strong>Granting access rights to macros</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To be able to define macros and to determine who will be allowed to execute them, a user must belong to a team that has write rights for<em> create_macro</em>. You can use the <strong>Rights</strong> icon in the overview to assign write or read rights for specific macros to individual teams.</p>\n<h3 id=\"checking-the-application-of-macros\" class=\"wysiwyg-text-align-justify\"><strong>Checking the application of macros</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Macro log</strong> menu logs all macro executions.</p>\n<h2 id=\"question-types\" class=\"wysiwyg-text-align-justify\"><strong>Question types</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you want to create user-defined question types not only temporarily, but add them to the library, you can do this in the menu <strong>Libraries</strong> → <strong>Question types</strong>. The newly defined question types are available across all projects in the Questionnaire Editor. You can add or import a new question type from another existing <em>EFS</em> installation. Click the <strong>New</strong> button or the drop-down menu →<strong> Import</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Enter the title of your new question type and select the appropriate category. Assign your newly created question type to one of the following categories of question types: <strong>Single response list</strong>, <strong>Multiple response list</strong>, <strong>Standard matrix</strong>,<strong> Text field,</strong> or <strong>911 special</strong>. Also in the Questionnaire Editor, you can find the newly created question type in the selected category.</p>\n</li>\n<li>\n<p>The newly created question type will be listed in the overview. To edit it, click on its title. This opens an HTML editor that allows you to create a new question type. Here you can customize the template, the stylesheet, the Javascript, the exact settings, and the resources.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following actions are available in addition to the further editing of the question types.</p>\n<table class=\"wysiwyg-text-align-justify\" border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 144.0px;\"> <col style=\"width: 616.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Icon</strong></p>\n</th>\n<th class=\"wysiwyg-text-align-center\" data-highlight-colour=\"#57d9a3\">\n<p><strong>Action</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Preview</p>\n</td>\n<td>\n<p>Have a look at the preview of your newly created question type.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Rights</p>\n</td>\n<td>\n<p>Open the menu <strong>Rights Admin</strong> to specify which user groups should have read and/or write access to the question type.</p>\n<p>Please note that you can only assign rights to users within your teams.</p>\n<p>You can also define if the question type supports an installation-wide rollout or team-based access.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Copy</p>\n</td>\n<td>\n<p>Copy a question type, which is then also listed in the overview and can be edited.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Download</p>\n</td>\n<td>\n<p>Download a question type in a ZIP file and save it on your computer.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Delete</p>\n</td>\n<td>\n<p>Delete a question type.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Locked / Unlocked</p>\n</td>\n<td>\n<p>Red: Question type cannot be edited.</p>\n<p>Green: Question type can be edited.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"wysiwyg-text-align-justify\">An already-created question type can be imported as a ZIP file. By doing an export/ import question types are portable across installations.</p>\n<p class=\"wysiwyg-text-align-justify\">This feature is only available for users with write permission <em>questiontype_editor</em>. Please also note that we cannot offer customer support for creating user-defined types of questions in the library.</p>\n<p class=\"wysiwyg-text-align-justify\">Users can only edit question types when they possess the rights. Please ensure that the question type is not currently being edited by another user by referring to the <strong>Currently Edited</strong> column.</p>\n<h3 id=\"library-of-question-types\" class=\"wysiwyg-text-align-justify\"><strong>Library of question types</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You may only use Latin characters and numbers for the name. An internal name will be generated from your given name. It has all whitespaces removed, so it can be used as an identifier. The category determines the underlying data structure for the answers as well as the initial files and available configuration options. The <strong>Preview</strong> button opens a dialog with a live preview of your question type, as it would be rendered in a survey with an unmodified responsive layout. The <strong>Save</strong> button is disabled by default. As soon as something is edited it will be activated and a modification marker is shown in the navigation to the left. The navigation on the left consists of five items: <strong>Template</strong>, <strong>Style Sheet</strong>, <strong>JavaScript</strong>, <strong>Settings,</strong> and <strong>Resources</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Save any changes, before you navigate through the menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can already select the question type in a survey and use it as it is right now. Your modifications will be immediately visible in the survey. Refrain from editing question types used in live surveys. Instead, copy the question type and work on the copy</p>\n<h3 id=\"template\" class=\"wysiwyg-text-align-justify\"><strong>Template</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">It is compiled with the Smarty 2 template engine and makes use of several variables supplied by <em>EFS</em>. The initial template contains basic functionality that enables you to develop your template.</p>\n<p class=\"wysiwyg-text-align-justify\">If you need to see how special features are implemented you may have a look at the templates of the responsive layout, accessible in <strong>Survey</strong> <strong>menu</strong> → <strong>Layout</strong> → <strong>Pro editor</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">Every question contains one or more variables (configured in <strong>Settings</strong>). A variable represents an answer option. In the case of a matrix, every dimension is an answer option (or item) and therefore has its variable.</p>\n<p class=\"wysiwyg-text-align-justify\">For every variable, there needs to be a list of possible values. These are the scale elements (internally called “r_cat”), which are also configured under <strong>Settings</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">In the template, you have a variable <strong>$items</strong>, which is an array that contains all answer options of the question. You can iterate over them with a for-each loop or a section. Every item-object has a variable <strong>$r_cats</strong>, which is an array that contains all scale elements of the question. Again you can iterate over them with a loop.</p>\n<p class=\"wysiwyg-text-align-justify\">If you want to see all existing Smarty variables insert {debug} in your template. A button will appear at the top right corner of the question preview, which opens a complete list of variables available at the point the debug plugin was called.</p>\n<p class=\"wysiwyg-text-align-justify\">A simple example of how to iterate over items and <em>r_cats</em>:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444613266\" alt=\"image2019-3-12_15-37-47.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">To submit values to the server the form needs to have a field (depending on the question type e. g. input, checkbox, hidden or select tag) containing the name of the variable matching its name. For example:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444615826\" alt=\"image2019-3-12_15-38-44.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">This will print a select box for each item including any scale options (<em>r_cat</em>).</p>\n<h3 id=\"style-sheet\" class=\"wysiwyg-text-align-justify\"><strong>Style Sheet</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the<strong> Style Sheet</strong> menu, you can edit the question type’s CSS file. Some styles are predefined, but you can remove them to get the default styling of the Responsive Layout and start your styling from there. The question type’s main container gets a CSS class with the following structure:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444620690\" alt=\"image2019-3-12_15-41-20.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">In our example, the class name would read as follows:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414454034\" alt=\"image2019-3-12_15-41-55.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">You should use this class as a namespace to limit your styles to your question type and prevent interferences with the outer layout or other question types.</p>\n<h3 id=\"java-script\" class=\"wysiwyg-text-align-justify\"><strong>Java Script</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>JavaScript</strong> menu, you define the logic of your question type.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you do not need any JavaScript behaviour you can remove the example code and leave the file empty.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">At the beginning of the template file, there is some code that makes the question type’s settings available in JavaScript. You can find these settings in the options object of the JavaScript plugin. For example, the answer options (items) are stored in an array called items. Likewise, the scale options (<em>r_cats</em>) are stored in an array called <em>rcats</em>.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414455058\" alt=\"image2019-3-12_15-46-2.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">You will also find the question type’s options (defined in the <strong>Settings</strong> area) inside this. options object. I.e. if you have an option named “orientation” in the <strong>options group</strong> <em>optionsGroup1</em>, you can access it like this:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444624786\" alt=\"image2019-3-12_15-47-13.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">You should start your code inside the plugin’s main function, but you can use the prepareOptions function to parse and cast the given options beforehand or modify the type if you need to.</p>\n<h3 id=\"settings\" class=\"wysiwyg-text-align-justify\"><strong>Settings</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Settings</strong> menu, you define the question type’s options and features. It is separated into five sections. Each section is responsible for a different kind of characteristics.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Question type options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The options you define in the <strong>question type options</strong> section will show up in the question editor and allow the creator of the survey to configure instances of your question type. All <strong>Options</strong> belong to an <strong>options group</strong>, so you have to create an <strong>options group</strong> by clicking on the “Add options group” button.</p>\n<p class=\"wysiwyg-text-align-justify\">Enter a name for the <strong>options group</strong> by which it can be referenced in the template and JavaScript files. You can also set its label in your current language and other languages by clicking on the globe icon next to the label field. Click on the<strong> Add option</strong> button to open a menu with possible option types.</p>\n<p class=\"wysiwyg-text-align-justify\">The option has been given the internal name “orientation”, a label, and a help text that will be shown in the question editor and a default value of “1”. The default value corresponds to the code of one of the options, defined in the lower area. When you save the changes and create a question of your question type in a survey you will see the<strong> options group</strong> and the “orientation”-option below the general question configuration. The help text is shown in a tooltip when you hover over the info icon.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can have as many <strong>options</strong> and <strong>options groups</strong> as you want. For example, you could separate your options into an <strong>options group</strong> for functional options and one for layout-related options.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To access the defined options in the template you can use the <em>question_info</em> variable. You can find your <strong>options groups</strong> in the <em>question_info.settings.questionTypeOptions</em> object. For the “orientation”-option it looks like this:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444625554\" alt=\"image2019-3-12_15-57-58.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Answer options</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the<strong> Answer Options</strong> section, you define the initially available answer options for your question type. In matrix type question types every answer option stands for a dimension. In multiple-choice question types, they represent the checkboxes and in single-choice question types, you will not have this section at all, as these have exactly one answer option.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Scale elements</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Scale Element</strong>s section, you set the possible answer values (codes). In matrix type question types every element stands for a column. In single-choice question types they represent the radio buttons, whereas in multiple-choice question types, you don’t have this section, because every checkbox has exactly two scale elements with the values “0” and “1”.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Question editor features</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In this section, you can enable or disable a variety of features for your question type. Which ones are available depends on the category of your question type. For example, matrix-type question types have different features available than single-choice question types.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Please refer to the info-text of each feature to get a description of what the feature does</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Configuration</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Here you can change the name of the question type.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>This applies only to the displayed name. It does not change the initially created internal name, as you would have to update the template, CSS, and JavaScript files to match the updated name.</p>\n</li>\n</ul>\n<h3 id=\"ressources\" class=\"wysiwyg-text-align-justify\"><strong>Resources</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the Resources area, you can manage the files that you need for your question type. These fall into two categories:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Files that you use as the default value for “Resource”-options (image, audio, or video files).</p>\n</li>\n<li>\n<p>Files that you need to include in your code (i.e. JavaScript libraries).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In any case, you first upload your files by clicking on the upload icon next to the “Resources”-entry in the list on the left.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Using a resource in an option</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Now that we have uploaded some files, those can be recycled for use in the Options menu, for options of the type “resource”. We will use the image as the default value for a “Resource”-option.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Go to the <strong>Settings</strong> area, expand <strong>Question type options,</strong> and click on “Add option” inside an <strong>Options group</strong>.</p>\n</li>\n<li>\n<p>Select “Resource” from the menu and enter values for the options name, label and help text.</p>\n</li>\n<li>\n<p>Select “test.jpg” from the select box to assign it as the default value.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The respective image will be displayed as default once you are creating a new question of your question type. To access the image in your template you can do (without linebreaks):</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414458514\" alt=\"image2019-3-12_16-13-32.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">You can also enter the following in the JavaScript file:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015444628498\" alt=\"image2019-3-12_16-15-8.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Using a resource directly</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The second case is using an uploaded file directly. This means including a file that can’t be modified by the user (as opposed to the previous case, where the user could select his resource as a value for an option). In your template, you can access the file “test.jpg” like this (without linebreaks):</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414462738\" alt=\"image2019-3-12_16-16-20.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">When loading the file “test.js” in JavaScript enter as follows:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015414463762\" alt=\"image2019-3-12_16-16-54.png\"></p>\n<h2 id=\"consent-form-templates\" class=\"wysiwyg-text-align-justify\"><strong>Consent form templates</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">You do not have to configure the consent form for each project but create consent forms under <strong>Libraries</strong>, which you will use when creating a consent form as required. Pre-filled forms depicting the most common use cases can also be found there so that you have GDPR-compliant consent forms using minor but indispensable adjustments to your project circumstances.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRSJ0YJXR4QBXQZ9ZWS\" class=\"wysiwyg-text-align-justify\">What is the maximum file size for attachments in mail templates?</h3>\n<p class=\"wysiwyg-text-align-justify\">The maximum size for attachments in mail templates is 1 MB.</p>\n<h3 id=\"h_01HGKSMPRSN0YJXS5QBXQZ9ZWT\" class=\"wysiwyg-text-align-justify\">Can I use the survey library for multi-source feedback?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, the survey library cannot be used for multi-source feedback.</p>\n<h3 id=\"h_01HGKSMPRSRYJXT6QBXQZ9ZWU\" class=\"wysiwyg-text-align-justify\">How long are archived emails stored in the system?</h3>\n<p class=\"wysiwyg-text-align-justify\">Archived emails are stored for six months before being automatically deleted.</p>\n<h3 id=\"h_01HGKSMPRSV0YJXU7QBXQZ9ZWV\" class=\"wysiwyg-text-align-justify\">What rights are required to access the scale library?</h3>\n<p class=\"wysiwyg-text-align-justify\">Read rights for <em>show_scala</em> are necessary for accessing the scale library.</p>",
    "user_segment_ids": []
}