{
    "id": 20371017512082,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371017512082.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371017512082-Search-and-Display-Functions-and-Export",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:44:00Z",
    "updated_at": "2024-08-28T09:47:23Z",
    "name": "Search and Display Functions and Export",
    "title": "Search and Display Functions and Export",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T10:51:56Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers the search and display functions in the participant list, as well as export options for participant data. It explains how to use simple and extended search features, customize the display of participant information, and export data to Excel or CSV formats.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The participant list in EFS offers various search and display functions to help manage large numbers of participants efficiently. This guide will walk you through the available features and how to use them effectively.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#simple-search\">Simple Search</a></li>\n<li><a href=\"#extended-search\">Extended Search</a></li>\n<li><a href=\"#display-functions\">Display Functions</a></li>\n<li><a href=\"#additional-information\">Additional Information</a></li>\n<li><a href=\"#excel-and-csv-export\">Excel- and CSV-Export</a></li>\n</ul>\n<h2 id=\"simple-search\" class=\"wysiwyg-text-align-justify\">Simple Search</h2>\n<p class=\"wysiwyg-text-align-justify\">The search functions of the participant list allow you to limit the list to individual participants or participant groups. Then, in the next step, you can apply actions such as e.g. “Invite”, “Generate code”, “Delete” etc. to these subgroups. Usually, the simple search function is displayed.</p>\n<p class=\"wysiwyg-text-align-justify\">If there are more than 1000 participants, the search function must be initiated first.</p>\n<p class=\"wysiwyg-text-align-justify\">The following rules apply:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Upper- and lowercase spelling will be ignored.</p>\n</li>\n<li>\n<p>When searching for a specific term, all entries containing the term will be shown in the results list.</p>\n</li>\n<li>\n<p>Instead of one single search criterion, you can also enter a combination of criteria.</p>\n</li>\n<li>\n<p>The criteria will be joined by an AND, i.e. the results must fulfill all criteria.</p>\n</li>\n<li>\n<p>You can perform several search operations in succession to progressively further restrict a set of results.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">With a large number of results, the first page of the results list may not display all participants found. In such a case, you will find the exact number of currently selected participants in the title bar for the list of participants. You can scroll through the results list using the &gt; (Next page) and &lt; (Previous page) links.</p>\n<p class=\"wysiwyg-text-align-justify\">Therefore, note that the group of selected participants may be larger than the number of participants listed on the first results page, in particular when you are using the “All found participants” checkbox.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"extended-search\" class=\"wysiwyg-text-align-justify\">Extended Search</h2>\n<p class=\"wysiwyg-text-align-justify\">The search function of the participant list has been revised so that now large amounts of participants can be searched with a minimum of time. The search is divided into two sections: \"Fields with index\" and \"Fields without index\".</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014721687698\" alt=\"Search 1.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">In the section \"Fields with Index\" you can, for example, search for participants according to the disposition code. A special new feature in this section is the search using the creation date. You can now search for the period in which participants were created. But if you want to search for a specific date/day, the same date must be selected in both fields. A further possibility of the precise and fast participant search is the search for e-mail addresses. To do this, you can use the search for certain elements of an e-mail address in the upper left corner. For example, if you select <em>Ends with</em>, you can search for all e-mail addresses that end on a particular domain. The second search for e-mail addresses is located at the bottom right and allows you to search for several e-mail addresses at the same time by entering these addresses one below the other in the free text field. In the extended search of Personalized Surveys, you can also use the free text field <strong>Code</strong> to search for several codes at the same time.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014684787474\" alt=\"Search 2.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">In the \"Fields without index\" area, you can search for participant variables that do not have an index in the database. A search in the \"Fields without index\" area therefore takes much longer than a search in the upper area. But if you have a participant variable from the lower area searched particularly frequently, this variable field can be provided with an index in the database. For this purpose, please contact our support team.</p>\n<p class=\"wysiwyg-text-align-justify\">This function is deactivated by default. To enable the new search feature, please contact our support team.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h3 id=\"search-multiple-e-mail-addresses\" class=\"wysiwyg-text-align-justify\">Search Multiple E-mail Addresses</h3>\n<p class=\"wysiwyg-text-align-justify\">Using the “Search multiple e-mail addresses” function in the extended search, you can simultaneously select a large number of participants via their e-mail addresses. This is useful if, for example, you wish to set a large number of participants whose invitation emails have been bounced back to disposition code 15 (not available).</p>\n<p class=\"wysiwyg-text-align-justify\">Just copy the e-mail addresses of the participants you are searching for into the entry field. In doing so, limit each line to just one e-mail address. After that, confirm by clicking on <strong>Search</strong>. The participants will then be located.</p>\n<p class=\"wysiwyg-text-align-justify\">There are different shareware tools, which can be used for extracting e-mail addresses from bounced e-mails. For example, you can download the eMail Bounce Handler from <a href=\"http://www.maxprog.com/EmailBounceHandler.html\" data-card-appearance=\"inline\">http://www.maxprog.com/EmailBounceHandler.html</a> .</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"display-functions\" class=\"wysiwyg-text-align-justify\">Display Functions</h2>\n<p class=\"wysiwyg-text-align-justify\">As the participant administration usually contains a large number of extensive participant data records, only selected data are normally displayed in the overview list. However, several functions enable you to specify which participant data and how many participants per page will be displayed.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The links labeled &gt; (Next page) and &lt; (Previous page) allow you to scroll forward and back through the list of participants.</p>\n</li>\n<li>\n<p>Clicking on a column title allows you to sort all participant data by the content of the respective column. For example, clicking on “Participant” will sort all participants alphabetically by their names.</p>\n</li>\n</ul>\n<h3 id=\"the-view-button\" class=\"wysiwyg-text-align-justify\">The View Button</h3>\n<p class=\"wysiwyg-text-align-justify\">By clicking on the <strong>View</strong> button you can display a dialog that allows you to specify whether the various table columns are to be shown or hidden. You can also change the number of rows per page. After you have confirmed by clicking on <strong>Submit</strong> the table will be expanded accordingly.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21014684785938\" alt=\"image-20240213-084839.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">To display the “User ID” you need the <em>export-with_lfdn </em>right. If you would like to obtain this right, please contact our support team.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"additional-information\" class=\"wysiwyg-text-align-justify\">Additional Information</h2>\n<p class=\"wysiwyg-text-align-justify\">The following additional information and functions are available for each data record:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>All participant data. The participants’ names are active links. Clicking on a participant will open the entry form, where you can change the participant’s data.</p>\n</li>\n<li>\n<p>Password and code: depending on whether the login option set for the project is “Password” or “Code”, the corresponding column will contain an activated link that can be copied and passed on (e.g. to a tester who wants to check the questionnaire under real conditions).</p>\n</li>\n<li>\n<p>The “Direct link” column displays an icon that can be used to open and view the questionnaire intended for the respective participant in a pop-up window.</p>\n</li>\n<li>\n<p>If you have read rights to “show_dispcode”, you can see the disposition code of the participants.</p>\n</li>\n<li>\n<p><strong>Question mark</strong> icons indicate values for which there is as yet no corresponding characteristic for “radio button” or “checkbox” type variables. This may occur if you use values in the imported dataset for which you have not yet created any characteristic and for which, at the same time, the function for automatic creation of new characteristics on import is disabled.</p>\n</li>\n<li>\n<p>Via the checkbox in the “Actions” column you can select participants to whom you wish to apply the actions.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note that, by viewing the questionnaire from the perspective of a regular respondent, you will not only change the participant’s disposition code but also capture all your entries as entries made by the participant. It is therefore recommended that you create special tester accounts.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"excel-and-csv-export\" class=\"wysiwyg-text-align-justify\">Excel- and CSV-Export</h2>\n<p class=\"wysiwyg-text-align-justify\">The entire content of the list of participants can be downloaded as one CSV or Excel file. If you wish, for example, to invite project participants to take part in a follow-up project, this feature allows you to easily export all necessary data into this follow-up project.</p>\n<p class=\"wysiwyg-text-align-justify\">If you have the read-right <em>show_dispcode</em> necessary for viewing the disposition codes, the export file also contains the disposition codes of the participants.</p>\n<p class=\"wysiwyg-text-align-justify\">To trigger the export, click on either the <strong>Excel export</strong> or <strong>CVS export</strong> buttons.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The Excel export may take some time, depending on the number of data records and variables contained in the list of participants. For large projects, we therefore recommend the CVS export.</p>\n</li>\n<li>\n<p>If an Excel file is opened, depending on the circumstances, a message may be displayed that notifies you that the file is corrupted. This problem is caused by an extension provided by a third-party supplier. Until further notice, please proceed as follows:</p>\n<ul>\n<li>\n<p>Save the file locally.</p>\n</li>\n<li>\n<p>Then, open the saved file, allowing Excel to repair it.</p>\n</li>\n<li>\n<p>Finally, save the file again.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Alternatively, if you are using the optionally leasable platform EFS Survey Status, you can offer your customers access to the so-called respondent export. This export contains all those participants who participated in a survey.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_1\" class=\"wysiwyg-text-align-justify\">How can I search for participants created within a specific date range?</h3>\n<p class=\"wysiwyg-text-align-justify\">Use the extended search function and look for the creation date fields in the \"Fields with Index\" section. You can specify a start and end date to find participants created within that range.</p>\n<h3 id=\"faq_2\" class=\"wysiwyg-text-align-justify\">Can I search for multiple email addresses at once?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, in the extended search, there's a \"Search multiple e-mail addresses\" function where you can enter multiple email addresses, one per line, to search for several participants simultaneously.</p>\n<h3 id=\"faq_3\" class=\"wysiwyg-text-align-justify\">How do I change which columns are displayed in the participant list?</h3>\n<p class=\"wysiwyg-text-align-justify\">Click on the \"View\" button to open a dialog where you can select which columns to show or hide. You can also adjust the number of rows displayed per page in this dialog.</p>",
    "user_segment_ids": []
}