{
    "id": 20370257078034,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370257078034.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370257078034-Layout",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T15:59:25Z",
    "updated_at": "2024-08-19T19:41:54Z",
    "name": "Layout",
    "title": "Layout",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-26T13:06:39Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\">Overview</h1>\n<p>This article provides an overview of the Layout menu in the EFS Survey system, which offers various features for editing the layout of questionnaires. It covers different tools and options available for both novice users and web design professionals.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>The Layout menu in EFS Survey provides a range of tools for customizing the appearance and structure of questionnaires. This article explores the different components of the Layout menu and their functionalities.</p>\n<p> </p>\n<ul>\n<li><a href=\"#standard-editor\">Standard Editor</a></li>\n<li><a href=\"#pro-editor\">Pro Editor</a></li>\n<li><a href=\"#layout-templates\">Layout Templates</a></li>\n<li><a href=\"#media-library\">Media Library</a></li>\n<li><a href=\"#save-settings\">Save Settings in Template</a></li>\n</ul>\n<p> </p>\n<h2 id=\"standard-editor\">Standard Editor</h2>\n<p>The Standard Editor is automatically opened in the content area when entering the Layout menu. It allows users to modify the system layout provided by Tivian without requiring any knowledge of HTML or web design.</p>\n<p>For more detailed information on the Standard Editor, please refer to the dedicated article on this topic.</p>\n<p> </p>\n<h2 id=\"pro-editor\">Pro Editor</h2>\n<p>The Pro Editor is designed for advanced users with HTML or CSS knowledge. It provides more flexibility and control over the layout design.</p>\n<p>For in-depth information about the Pro Editor, please consult the specific article on this feature.</p>\n<p> </p>\n<h2 id=\"layout-templates\">Layout Templates</h2>\n<p>The Layout Templates feature allows users to modify the system layout provided by Tivian without requiring any knowledge of HTML or web design. If there are already layouts available on the EFS installation you use, you can integrate them into your questionnaire using the Layout Templates menu.</p>\n<p>For more details on Layout Templates, please refer to the dedicated article on this topic.</p>\n<p> </p>\n<h2 id=\"media-library\">Media Library</h2>\n<p>Each project has its own media library, located in the Questionnaire editor → Media library menu. It enables you to upload multimedia files such as images, sounds, or movies from your local hard disk or from your network into the project directory on the EFS server and to insert them into the questionnaire.</p>\n<p>For more information about the Media Library, please consult the specific article on this feature.</p>\n<p> </p>\n<h2 id=\"save-settings\">Save Settings in Template</h2>\n<p>In the Save Settings in Template menu, you can save the layout settings of your project. This allows you to use the saved template again later, for example, in other projects on the same EFS Survey installation.</p>\n<p>For more details on saving settings in templates, please refer to the dedicated article on this topic.</p>\n<p> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\">FAQ</h1>\n<h3 id=\"faq-preview\">How can I preview the layout changes I've made?</h3>\n<p>You can check the layout changes you made by clicking on the survey link in the Preview section.</p>\n<h3 id=\"faq-change-log\">Where can I find a record of the layout changes I've made?</h3>\n<p>All layout changes are listed clearly for you in the Layout Change-Log section.</p>\n<p><br><br></p>",
    "user_segment_ids": []
}