{
    "id": 20371040543122,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371040543122.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371040543122-Tips-and-Tricks-Website",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234598507282,
    "created_at": "2024-07-25T16:46:26Z",
    "updated_at": "2024-08-28T12:12:15Z",
    "name": "Tips and Tricks (Website)",
    "title": "Tips and Tricks (Website)",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T11:17:08Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article covers essential tips and tricks for working with the EFS Panel, including testing procedures, working with CSV files, managing external surveys, and enhancing security features.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide provides detailed instructions on various aspects of EFS Panel management, focusing on testing, data handling, and security enhancements.</p>\n<ul>\n<li><a href=\"#testing-in-the-panel\">Testing in the Panel</a></li>\n<li><a href=\"#working-with-csv-files\">Working with CSV Files</a></li>\n<li><a href=\"#renting-panelists-out-to-externally-conducted-surveys\">Renting Panelists out to Externally Conducted Surveys</a></li>\n<li><a href=\"#personalized-projects-without-a-list-of-participants\">Personalized Projects without a List of Participants</a></li>\n<li><a href=\"#mail-templates\">Mail Templates</a></li>\n<li><a href=\"#improving-security-with-the-option-activate-security-question\">Improving Security with the option \"Activate security question\"</a></li>\n</ul>\n<h2 id=\"testing-in-the-panel\" class=\"wysiwyg-text-align-justify\"><strong>Testing in the Panel</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">When setting up and operating a panel it is often necessary to check and test complex processes. EFS Panel gives you the option of setting up accounts with a special tester status, which allows you to test current surveys without falsifying the results:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>People with the “Tester” status can participate in a survey as often as they like. If a tester with the “Completed” disposition code accesses the questionnaire for a second time, the existing data will be deleted. The tester will begin the new entry on the first page of the project.</li>\n<li>Testers do not “resume” their work. If a tester interrupts editing for a prolonged period (more than 30 minutes) and then accesses the questionnaire again, they will resume the editing on page 1. “Normal” respondents see the page last sent.</li>\n<li>The test results are listed in both statistics and the export data record. However, they are identifiable as test results. In the master data record, panel testers have the value 16 in the “pstatus” field, while regular participants have another status. In the result data record of a survey (panel surveys, anonymous and personalized projects), tester records are identifiable through the “tester” variable, which has the value “1” for testers and “0” for other participants.</li>\n<li>Tester data can be deleted explicitly from the result data record of a project when it is generated. To do so, choose the “Reset survey, delete test participants and their result data” option in the <strong>Reset survey</strong> menu (until EFS 10.1: <strong>Compile</strong>) of the respective project and confirm by clicking on <strong>Reset survey</strong>.</li>\n<li>If you use a test account regularly, it is very convenient to register it as your personal standard panelist. Then, whenever you call up the website from EFS (e.g., from the website editor), this account will be used automatically, eliminating the need for entering login details.</li>\n</ul>\n<h3 id=\"setting-up-a-tester-account\" class=\"wysiwyg-text-align-justify\"><strong>Setting up a Tester Account</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Open the <strong>People → Panelists administration</strong> menu and click on the Add panelist button.</li>\n<li>Fill in the form. The details marked with an * are compulsory.<br><br>\n<ul>\n<li>Choose “Tester” status.</li>\n<li>Enter the participant data.</li>\n<li>\n<p class=\"auto-cursor-target\">Enter a real e-mail address that you have access to. Otherwise, you will not be able to control whether, for example, the sending of an invitation to the master data survey was done correctly.<br><em>Information: Pay attention that, when conducting tests, you only send emails to your account or a dummy account belonging to your company (with the agreement of the responsible system administration).</em></p>\n</li>\n<li>\n<p>Optionally choose category and group. In a newly delivered standard panel, at least the group category “Default” (contains all groups) and the group “Default panel group” (contains all panelists) exist and can be selected.</p>\n</li>\n<li>\n<p>Select the language version.</p>\n</li>\n<li>\n<p>If you are using the Community features of the EFS Panel, configure the visibility of profile data for the new test account.<br><br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21018302994450\" alt=\"testaccount.png\"></p>\n</li>\n</ul>\n</li>\n<li>Confirm by clicking on <strong>Create account</strong>.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">You can now log in using the test panelist’s e-mail address and password and view the panel from their perspective.</p>\n<h3 id=\"using-an-existing-account-to-do-tests\" class=\"wysiwyg-text-align-justify\"><strong>Using an Existing Account to do Tests</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Alternatively, you can also assign a panelist who has already been registered with the “Tester” status. To do so, switch to the <strong>People → Panelists administration</strong> menu, and enter the panelist’s name into the corresponding field. Trigger the search function by clicking on<strong> Search</strong>. The data of the panelist you are searching for will be output as a result. Use the drop-down list to set the panelist’s status to “Tester” and then confirm by clicking on <strong>Submit</strong>.</p>\n<h3 id=\"testing-panel-functions\" class=\"wysiwyg-text-align-justify\"><strong>Testing Panel Functions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">With a newly created tester account set up according to the instructions above, you will not be able to see an active survey or promotional campaign, because the tester does not belong to a sample or a group yet.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adding a tester to a sample and inviting them to a panel survey</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Create the sample.</li>\n<li>Open the tab <strong>View tester list</strong>.</li>\n<li>Click the <strong>Add testers</strong> button. An overview of all the panelists with the “Tester” status available on the EFS Panel installation will be displayed.</li>\n<li>Select the desired testers and confirm the selection by clicking on<strong> Add</strong>.</li>\n<li>The testers will be assigned to the sample and appear both in the list of testers currently assigned to the project and on the tab <strong>Sample contents</strong>.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">If you want to log in directly to the survey with your tester account, click the link in the column “Code”. If you invite the respondents in the sample using the “Inform” function, the tester will also be invited. Alternatively, you can copy the URL from the “Code” column into an e-mail to invite only the tester, e.g. for a pretest.</p>\n<p class=\"wysiwyg-text-align-justify\"><em>Information: Another option is to assign the tester using the features of the detail view. Search for the tester in Panelists administration and open the detail view. On the tab Surveys you can assign the tester to a sample.</em></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Inviting testers to the master data survey</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Switch to the<strong> People → Panelists administration</strong> menu. Display the respective person.</li>\n<li>Tick the checkbox in the “Actions” column, and choose the “Master data survey” action from the drop-down list.</li>\n<li>After that, click on the <strong>Submit</strong> button.</li>\n</ol>\n<h2 id=\"working-with-csv-files\" class=\"wysiwyg-text-align-justify\"><strong>Working with CSV Files</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">CSV (Character Separated Values) is an exchange format that is mainly used for exchanging data between different computer programs.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating CSV files in MS Exce</strong>l</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Create the desired table in MS Excel.</li>\n<li>Save it in the CSV format: To do so, click on<strong> File → Save as</strong> and check that instead of the standard format *.xls the format *.csv has been chosen.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating a CSV file in a text editor of your choice</strong></p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Enter the data, marking the desired table columns with a semicolon.</li>\n<li>Save the file in the CSV format by giving it the extension “.csv”.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Opening CSV Files in MS Excel</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Many panel functions allow you to export EFS Panel data in the CSV format, and then view or edit it externally. Please proceed as follows:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Export the desired file from the EFS Panel.</li>\n<li>Open MS Excel.</li>\n<li>Choose <strong>File → Open</strong>.</li>\n<li>Select the “Text files (*.csv)” file type.</li>\n<li>Navigate to the desired file and click on it, so that the title appears in the “File name” field.</li>\n<li>Confirm by clicking on<strong> Open</strong>.</li>\n</ol>\n<h2 id=\"renting-panelists-out-to-externally-conducted-surveys\" class=\"wysiwyg-text-align-justify\"><strong>Renting Panelists out to Externally Conducted Surveys</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">This section describes how panelists can participate in a survey that does not take place within the panel but in another EFS Panel installation or, as the case may be, in another software environment. The challenge here is to provide incentives to the panelists promptly.</p>\n<p class=\"wysiwyg-text-align-justify\">Determine firstly whether the software used to survey your panelists can save transferred parameters and insert them back into the link when returned to the panel site (in technospeak: Individual parameters for each panelist are transferred via GET and must be dynamically inserted into the return-to-panel-site link).</p>\n<p class=\"wysiwyg-text-align-justify\">Should the software used on the actual survey platform be capable of the above, then it is recommended that you implement this using the external survey start feature. The survey is executed in three parts: An introductory page is located on your panel installation. After clicking on the Continue button you are sent to the external software, and at the end you are sent back to the panel installation. The transfer of parameters during transfer, transfer back and in the export data record makes it possible to perform matching between the two surveys. The dedicated manual “External Survey Start” explains in detail how to configure this.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Anonymous export of the panelist sample</strong></p>\n<p class=\"wysiwyg-text-align-justify\">An alternative is the anonymous export of the panelist sample:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Form a group of the panelists that will be surveyed.</li>\n<li>Using the selective master data export, export the information that you would like to make available to the external cooperation partner, containing at least the pseudonym (the “pseudonym” variable).</li>\n<li>The external cooperation partner enters the pseudonym into the participant administration of their project. You invite the panelists from your system via email, indicating in the e-mail a URL to the survey of the co-operation partner. (Please note that you must enter this manually, you cannot use the usual mail wildcards from EFS Panel.) Indicate in the e-mail that the incentive for this project can only be given out after a certain delay at the end of the project.</li>\n<li>At the end of the survey, you will need a list of the people who successfully completed the survey from the external co-operation partner. The list must contain the pseudonym.</li>\n<li>Extract the mentioned pseudonyms into a one-column CSV file. Import the pseudonym file as a new group (see Chapter 8.3, p. 156). The group created this way can be given incentives using the appropriate functions of group administration.</li>\n</ol>\n<h2 id=\"personalized-projects-without-a-list-of-participants\" class=\"wysiwyg-text-align-justify\"><strong>Personalized Projects without a List of Participants</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Not all personalized projects involve surveys of self-recruited participants. Often the external partner has a collection of e-mail addresses to be used as a sample. Sometimes the cooperation partner, on the one hand, does not want to give out these e-mail addresses, but on the other hand, wants to conduct the survey as a personalized survey.</p>\n<p class=\"wysiwyg-text-align-justify\">The following procedure, in which codes generated in the EFS Panel are used for authentication, has proved suitable in such cases:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>The survey project is created as a personalized project.</li>\n<li>Choose “Code” as the access/login type.</li>\n<li>Using Excel, an import file containing dummy accounts will be generated. It is important here that you generate syntactically correct and unique e-mail addresses: Fill in the first column with the word name, the second column with the word <em>dummy</em>, the third column with an incremental number, and the fourth column with @yourdomain.com. Now, copy the three columns that together would create a complete e-mail address, into a text editor that supports regular expressions, and then remove the tabs between the lines. Next, copy the finished e-mail addresses back into your Excel file and save the result as a CSV file.</li>\n<li>\n<p>Import this list of participants into your survey project. The import process will automatically generate codes for each participant.</p>\n</li>\n<li>\n<p>Export the participant administration with the address data export.</p>\n</li>\n<li>\n<p>The access codes generated are now available externally for further processing. The cooperation partner can dispatch the codes, for example, by post or e-mail.</p>\n</li>\n<li>\n<p>At the end of the project, perform a complete export of the address and result data to create a list of the participants who successfully participated in the project (disposition code &gt; 30 or a specific variable allocated on the last page of the survey).</p>\n</li>\n<li>\n<p>Make this list available to your customer. It can be used, for example, for incentive management.</p>\n</li>\n</ol>\n<h2 id=\"mail-templates\" class=\"wysiwyg-text-align-justify\"><strong>Mail Templates</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Before a panel installation can become operational, you must at least complete the automatically sent mail templates, under <strong>Libraries → Mail templates</strong>, and define senders for them in the submenu <strong>Mail senders</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">The following table gives you an overview of the mail template types and explains when each of them is used.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Overview of the mail template types</strong></p>\n<table class=\"relative-table wrapped wysiwyg-text-align-justify\" style=\"width: 101.423%; margin-right: auto; margin-left: auto; height: 793px;\" border=\"1\">\n<colgroup> <col style=\"width: 24.468%;\"> </colgroup> <colgroup> <col style=\"width: 9.77621%;\"> </colgroup> <colgroup> <col style=\"width: 65.7165%;\"> </colgroup>\n<tbody>\n<tr style=\"height: 36px;\">\n<th style=\"height: 36px;\">Mail template type</th>\n<th style=\"height: 36px;\">Type</th>\n<th style=\"height: 36px;\">When it is used</th>\n</tr>\n<tr style=\"height: 40px;\">\n<td style=\"height: 40px;\">Default mail</td>\n<td style=\"height: 40px;\"> </td>\n<td style=\"height: 40px;\">Is available in all non-automated dispatch processes.</td>\n</tr>\n<tr style=\"height: 40px;\">\n<td style=\"height: 40px;\">Invitation mail</td>\n<td style=\"height: 40px;\"> </td>\n<td style=\"height: 40px;\">Used to invite participants to a survey project.</td>\n</tr>\n<tr style=\"height: 51px;\">\n<td style=\"height: 51px;\">Reminder mail</td>\n<td style=\"height: 51px;\"> </td>\n<td style=\"height: 51px;\">\n<p>Used to remind participants of surveys they have not completed yet.</p>\n</td>\n</tr>\n<tr style=\"height: 74px;\">\n<td style=\"height: 74px;\">\n<p>Notification before the end of the survey</p>\n</td>\n<td style=\"height: 74px;\"> </td>\n<td style=\"height: 74px;\">\n<p>Mail template used across the installation to notify users of the upcoming end of the survey. This notification may be requested in the dialog used to create and change projects.</p>\n</td>\n</tr>\n<tr style=\"height: 65px;\">\n<td style=\"height: 65px;\">\n<p>Notification by the exchange platform</p>\n</td>\n<td style=\"height: 65px;\"> </td>\n<td style=\"height: 65px;\">\n<p>Mail template used to notify users of changes on the exchange platform. For more information on the optionally available exchange platform refer to the dedicated documentation “EFS Secure Exchange”.</p>\n</td>\n</tr>\n<tr style=\"height: 48px;\">\n<td style=\"height: 48px;\">Welcome mail</td>\n<td style=\"height: 48px;\">Automatic</td>\n<td style=\"height: 48px;\">\n<p>Only in EFS Panel installations: Automatically sent to the panelist after the registration has been submitted.</p>\n</td>\n</tr>\n<tr style=\"height: 70px;\">\n<td style=\"height: 70px;\">\n<p>Password recovery mail</p>\n</td>\n<td style=\"height: 70px;\">Automatic</td>\n<td style=\"height: 70px;\">\n<p>Only in EFS Panel installations: If a panelist forgets their password, the content of this mail template will be sent automatically upon request.</p>\n</td>\n</tr>\n<tr style=\"height: 73px;\">\n<td style=\"height: 73px;\">\n<p>Duplicates check mail</p>\n</td>\n<td style=\"height: 73px;\"> </td>\n<td style=\"height: 73px;\">\n<p>Only in EFS Panel installations: If the EFS Panel administrator performs the duplicate check in the <strong>Candidates</strong> menu and finds that this panelist already exists, this mail template is used to contact the panelist via e-mail.</p>\n</td>\n</tr>\n<tr style=\"height: 71px;\">\n<td style=\"height: 71px;\">\n<p>Registration error mail</p>\n</td>\n<td style=\"height: 71px;\"> </td>\n<td style=\"height: 71px;\">\n<p>Only in EFS Panel installations: If the EFS Panel administrator checks the data in the <strong>Candidates</strong> menu and wishes to send an inquiry mail to the respective panelist, this mail template can be invoked via the “Registration error” action.</p>\n</td>\n</tr>\n<tr style=\"height: 68px;\">\n<td style=\"height: 68px;\">\n<p>Master data invitation mail</p>\n</td>\n<td style=\"height: 68px;\"> </td>\n<td style=\"height: 68px;\">\n<p>Only in EFS Panel installations: This mail template is displayed when you are inviting a panelist from the <strong>Candidates</strong> menu to the master data survey.</p>\n</td>\n</tr>\n<tr style=\"height: 61px;\">\n<td style=\"height: 61px;\">\n<p>Master data reminder mail</p>\n</td>\n<td style=\"height: 61px;\"> </td>\n<td style=\"height: 61px;\">\n<p>Only in EFS Panel installations: This mail template is displayed when you are sending a reminder concerning the master data survey to a panelist from the <strong>Candidates</strong> menu.</p>\n</td>\n</tr>\n<tr style=\"height: 44px;\">\n<td style=\"height: 44px;\">Winner mail</td>\n<td style=\"height: 44px;\"> </td>\n<td style=\"height: 44px;\">\n<p>Only in EFS Panel installations: This mail template is displayed when you have conducted a prize draw and wish to inform the winners afterward.</p>\n</td>\n</tr>\n<tr style=\"height: 52px;\">\n<td style=\"height: 52px;\">Promotional Mail</td>\n<td style=\"height: 52px;\"> </td>\n<td style=\"height: 52px;\">\n<p>Only in EFS Panel installations: Panelists can use this mail template within the scope of a campaign to canvass new participants.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h2 id=\"improving-security-with-the-option-activate-security-question\" class=\"auto-cursor-target wysiwyg-text-align-justify\"><strong>Improving Security with the option \"Activate security question\"</strong></h2>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<table class=\"wrapped wysiwyg-text-align-justify\">\n<colgroup> <col> </colgroup>\n<tbody>\n<tr>\n<th>\n<p>The option \"<strong>Activate security question\" </strong>can be used to add another layer of security to the password recovery functionality for panelists. If this option is activated and panelists request password recovery mail, they will be asked to enter the answer to a previously set up security question. So this option can be useful for you if security is a big concern for you or your organization.</p>\n</th>\n</tr>\n</tbody>\n</table>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h3 id=\"how-to-enable-activate-security-question\" class=\"auto-cursor-target wysiwyg-text-align-justify\"><strong>How to enable \"Activate security question\"</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you want to enable the “Activate security question” option and enhance your security, please follow the steps below:</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Selecting the option</strong></p>\n<ol class=\"ak-ol wysiwyg-text-align-justify\">\n<li>\n<p>Go to <strong>Website</strong> → <strong>Global configuration</strong> → <strong>Password security</strong>, and select <strong>Yes </strong>for<strong> Activate security question</strong>.</p>\n</li>\n<li>\n<p>If you want the panelist account to be temporarily disabled after too many failed attempts to enter the right answer to the security question, you can select <strong>Yes </strong>for the option <strong>Activate brute force protection</strong>. You can also set, for how long the account will be deactivated and how many failed attempts will be allowed.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><strong>Adding the variables</strong></p>\n<ol class=\"ak-ol wysiwyg-text-align-justify\">\n<li>\n<p>Go to <strong>Website</strong> → <strong>Language version</strong> → <strong>Standard content</strong> → <strong>Forms</strong>, and select <strong>Registration form. </strong>Click on<strong> Add variable </strong>and select the variable<strong> u_sec_quest: Security question </strong>from the drop-down menu<strong> Variable. </strong>Next, enter “<em>!matches('/^[12]$/',request.u_sec_quest)</em>” under <strong>Validation</strong> → <strong>Check expression </strong>and under <strong>Validation</strong> → <strong>Error message </strong>enter the error message you want to be displayed, if the panelist doesn’t enter a security question when registering, e.g. “Please enter a security question”. Click on <strong>Add variable.</strong></p>\n</li>\n<li>\n<p>Repeat the steps under 3 for the variable <strong>u_sec_quest_answer: Security question answer.</strong> Enter “<em>!matches('/^[12]$/',request.u_sec_quest_answer)</em>” under <strong>Validation</strong> → <strong>Check expression</strong>, and under <strong>Validation</strong> → <strong>Error message</strong> enter the appropriate error message, e.g. “Please enter an answer to the security question”.</p>\n</li>\n<li>\n<p>Go to <strong>Website</strong> → <strong>Language version</strong> → <strong>Standard content</strong> → <strong>Forms</strong>, and select the form <strong>Change account data</strong>. Add both variables – <strong>u_sec_quest: Security question</strong> and <strong>u_sec_quest_answer: Security question answer</strong> – following the steps detailed above.</p>\n</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><em>Information: Please note that the variables <strong>u_sec_quest: Security question</strong> and <strong>u_sec_quest_answer: Security question answer </strong>have to be added in the forms<strong> Registration form </strong>and<strong> Change account data </strong>for ALL language versions on all panel websites, as the option can only be applied globally.</em></p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h3 id=\"what-panelists-will-see\" class=\"auto-cursor-target wysiwyg-text-align-justify\"><strong>What panelists will see</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">What panelists will see after you have enabled the “Activate security question” option, depends on the according scenario:</p>\n<h4 id=\"scenario-1-panelists-who-have-not-yet-set-up-a-security-question\" class=\"wysiwyg-text-align-justify\"><strong>Scenario 1: Panelists, who have not yet set up a security question</strong></h4>\n<p class=\"wysiwyg-text-align-justify\">If you have enabled the <strong>Activate security question </strong>option and panelists have not yet set up a security question in their account, the security question will be skipped, and the recovery mail will be dispatched instantly. Those panelists will see a clickable message saying “No security question set. Click here to set it” in the profile box, until they have set a security question and answer. Once they click on this link, they will be redirected to the form <strong>Change Account Data</strong>, where they can set the question and answer up.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h4 id=\"scenario-2-panelists-who-newly-register\" class=\"wysiwyg-text-align-justify\"><strong>Scenario 2: Panelists, who newly register</strong></h4>\n<p class=\"wysiwyg-text-align-justify\">After you have enabled the <strong>Activate security question </strong>option, the registration form will include the two fields <strong>Security question</strong> and <strong>Security question answer</strong>. Those fields are mandatory, so all newly registered panelists will have to enter a question and an answer.</p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_tester_account\" class=\"wysiwyg-text-align-justify\">How do I set up a tester account?</h3>\n<p class=\"wysiwyg-text-align-justify\">To set up a tester account, go to People → Panelists administration, click Add panelist, fill in the form choosing \"Tester\" status, and confirm by clicking Create account.</p>\n<h3 id=\"faq_csv_creation\" class=\"wysiwyg-text-align-justify\">What's the easiest way to create a CSV file?</h3>\n<p class=\"wysiwyg-text-align-justify\">The easiest way to create a CSV file is using MS Excel. Create your table in Excel, then save it as a CSV file by selecting File → Save as and choosing the CSV format.</p>\n<h3 id=\"faq_security_question\" class=\"wysiwyg-text-align-justify\">How does the \"Activate security question\" feature improve security?</h3>\n<p class=\"wysiwyg-text-align-justify\">The \"Activate security question\" feature adds an extra layer of security by requiring panelists to answer a pre-set security question when recovering their password, making it harder for unauthorized users to gain access to panelist accounts.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>",
    "user_segment_ids": []
}