{
    "id": 20371116204818,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371116204818.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371116204818-Statistics",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:51:36Z",
    "updated_at": "2024-08-19T18:38:13Z",
    "name": "Statistics",
    "title": "Statistics",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T13:19:39Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01J3ZA1JFGT4VCSQGYVDRP4HVT\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<article>\n<p>This article provides comprehensive information about the Statistics menu in the survey management system. It covers various aspects of monitoring and analyzing survey data, including field reports, online statistics, open-ended answers, and data quality management.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\">Information</h1>\n<p>The Statistics menu (accessible via the <strong>Survey menu)</strong> offers tools for tracking survey progress, analyzing responses, and ensuring data quality. It includes features for generating field reports, viewing real-time statistics, managing open-ended responses, and performing data-cleaning operations.</p>\n</article>\n<ul>\n<li><a href=\"#field-report\">Field report</a></li>\n<li><a href=\"#online-statistics\">Online statistics</a></li>\n<li><a href=\"#open-ended-answers\">Open-ended answers</a></li>\n<li><a href=\"#detail-view\">Detail view</a></li>\n<li><a href=\"#quality-correction\">Quality correction</a></li>\n<li><a href=\"#data-cleaning\">Data cleaning</a></li>\n<li><a href=\"#delete-data\">Delete data</a></li>\n</ul>\n<p> </p>\n<p class=\"wysiwyg-text-align-justify\"><strong style=\"font-size: 1.5em;\">Field report</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Field report</strong> provides information on the essential characteristic data of a study. It contains:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>statistical information, broken down by gross and net sample</p>\n</li>\n<li>\n<p>access statistics listing, for example, the time of days with the most accesses and the average number of participants per day and week</p>\n</li>\n<li>\n<p>drop-out statistics which show you on which questionnaire page most participants dropped out. If the drop-out rate is too high, you can react by changing the questionnaire dramaturgy. Errors, for example in the filter setting, can also be detected by analyzing the drop-out statistics</p>\n</li>\n<li>\n<p>quota statistics</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You can invoke the field report by selecting the desired project from the project list and then clicking on the <strong>Statistics</strong> menu item.</p>\n<h3 id=\"diagram\" class=\"wysiwyg-text-align-justify\"><strong>Diagram</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The diagram belonging to the field report gives you a quick overview of the progress made in the field phase.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The highlight colors indicate the participants’ disposition codes</p>\n</li>\n<li>\n<p>Click on the disposition codes below the chart to display or hide specific codes.</p>\n</li>\n<li>\n<p>If the field period is too long to display each day in the chart</p>\n</li>\n<li>\n<p>You can print the chart or download it in PNG, PDF, or SVG.</p>\n</li>\n<li>\n<p>The most important information is shown above the chart.</p>\n</li>\n<li>\n<p>The field report shows the data of the current field period.</p>\n</li>\n</ul>\n<h3 id=\"restricting-the-field-report\" class=\"wysiwyg-text-align-justify\"><strong>Restricting the field report</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The field report can be limited to specific disposition codes or variable characteristics. The following options are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>disposition codes “completed” = 31, “completed after break” = 32, “screened out” = 37 and “all other status levels”.</p>\n</li>\n<li>\n<p>project variables and URL parameters. Exception: Variables of text question types (141, 142, 143, 144, 363), user-defined question variables (question type 911), and user-defined variables cannot be used for restriction purposes.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click the <strong>Configuration</strong> button.</p>\n</li>\n<li>\n<p>In the upper section disable, if necessary, the disposition codes not to be used to restrict the basis.</p>\n</li>\n<li>\n<p>If you wish to make restrictions using a project variable, select the latter and confirm with <strong>Continue</strong>.</p>\n</li>\n<li>\n<p>In the next step select the desired variable characteristic.</p>\n</li>\n<li>\n<p><strong>Confirm</strong> again. The restricted field report is issued.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To undo the field report restriction, switch back to the <strong>Configuration</strong> dialog, select “Delete current restriction” and confirm with <strong>Continue</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">Read rights for <em>config_fieldreport</em> are required for accessing the configuration options.</p>\n<h3 id=\"splitting-the-field-report\" class=\"wysiwyg-text-align-justify\"><strong>Splitting the field report</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can split the field report using a specific variable.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The following variables are available for all project types: project variables for closed questions and answer options (v_000n), URL parameters (c_000n), userdefined variables (p_000n), quota IDs (quota), language ID (language) and outmode (outmode).</p>\n</li>\n<li>\n<p>Personalized surveys: “Select box” and “radio button” participant variables may be used, provided that answer categories have been defined.</p>\n</li>\n<li>\n<p>Employee surveys: To protect the privacy of participants, participant variables cannot be used for splitting. The Org Processor variables in Employee surveys (org_allocation_x, org_code_x, org_function_x) are not available for splitting either: The <em>Org Processor</em> provides a comfortable overview of the return data of individual units.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows: Click on the <strong>Split</strong>: <strong>Define</strong> link and select the desired split variable from the drop-down list. After that, confirm by clicking on Save. The data in the field report will now be split based on the variable you chose. You can export the data as an MS Excel file and process them externally (e.g. create diagrams using MS Excel).</p>\n<p class=\"wysiwyg-text-align-justify\">Read rights for <em>stat_split</em> are required for accessing the split options.</p>\n<h3 id=\"exporting-the-field-report\" class=\"wysiwyg-text-align-justify\"><strong>Exporting the field report</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can download the field report in MS Excel file format, e. g. to pass the data on to your customers or to plot charts or graphs. This is particularly useful if you need the data of a field report that is restricted by configuration or has been split using the split function (see previous chapters): The field report will be exported in its current configuration.</p>\n<p class=\"wysiwyg-text-align-justify\">To initiate the export, click on the Excel export tab and save the Excel file to your computer. The Excel file has an appealing layout, i.e. if necessary, you can directly pass on or present your data.</p>\n<h3 id=\"setting-a-variable-page-marker\" class=\"wysiwyg-text-align-justify\"><strong>Setting a variable page marker</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Using the so-called variable page marker allows you to determine how many people have completed the survey up to a specific questionnaire page X. Using this function is advisable, for example, if a prize draw or an order form for a newsletter which is not of interest to all respondents are offered at the end of your questionnaire. A respondent who drops out of the survey in such a situation would usually be classified as a dropout although the actual questionnaire has been completed. If you are using the variable page marker, the field report indicates the variable rate which results from the number of respondents who have reached the questionnaire page X marked with a variable page marker (variable rate = number of participants up to page X / gross 2).</p>\n<p class=\"wysiwyg-text-align-justify\">To set the page marker, please switch to the <strong>Questionnaire editor</strong>. Click on the title of the desired page, then select the <strong>Properties menu</strong>. Tick the “Variable page marker” checkbox and confirm by clicking on <strong>Save</strong>.</p>\n<h2 id=\"online-statistics\" class=\"wysiwyg-text-align-justify\"><strong>Online statistics</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">As early as during the field phase, the online statistics give you an overview of the survey data gathered up to that point. In the first step, you must specify which project data the statistics are supposed to cover:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>By ticking the checkboxes for a specific question or ticking the “Tick all checkboxes” checkbox, you can specify whether you want to view all survey results or only a selection of the results for a specific question.</p>\n</li>\n<li>\n<p>If you tick the “Dump variable names and types” checkbox, the online statistics will additionally display the names of variables, question types, and labels.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In this case, the online statistics will display the following information for the selected questions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>the number of persons who have chosen a characteristic.</p>\n</li>\n<li>\n<p>the percentage of respondents is represented in numbers and as a bar diagram.</p>\n</li>\n<li>\n<p>the total number of persons who have given a valid answer to a question.</p>\n</li>\n<li>\n<p>Invalid (missing): This value indicates how many questions have been seen but not answered.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Online statistics have no anonymity boundaries. I.e. it is not possible to hide values if the return rate falls short of a given minimum requirement. If you<br>compile data for customers you should therefore consider, depending on applicable data protection provisions, generating a report with appropriate anonymity criteria in the reporting instead of simply printing out the online statistics.</p>\n<h3 id=\"restricting-the-online-statistics\" class=\"wysiwyg-text-align-justify\"><strong>Restricting the online statistics</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The online statistics can be limited to specific disposition codes or variable characteristics. This feature works analogous to restricting the field report.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Read rights for <em>config_fieldreport</em> are required for accessing the configuration options.</p>\n</li>\n</ul>\n<h3 id=\"splitting-the-online-statistics\" class=\"wysiwyg-text-align-justify\"><strong>Splitting the online statistics</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The representation of the frequency counts in online statistics can be split using a variable, i.e. you can create cross tables. This feature works analogous to splitting the field report.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Read rights for<em> stat_split</em> are required for accessing the split options.</p>\n</li>\n</ul>\n<h2 id=\"open-ended-answers\" class=\"wysiwyg-text-align-justify\"><strong>Open-ended answers</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">In this menu, you can view the answers to open-ended questions.</p>\n<h3 id=\"restricting-the-open-ended-answers\" class=\"wysiwyg-text-align-justify\"><strong>Restricting the open-ended answers</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The open answers can be limited to specific disposition codes or variable characteristics. This feature works analogous to restricting the field report.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Read rights for <em>config_fieldreport</em> are required for accessing the configuration options.</p>\n</li>\n</ul>\n<h2 id=\"detail-view\" class=\"wysiwyg-text-align-justify\"><strong>Detail view</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If you have the required access rights, you can view, edit, and delete the data records of individual survey participants in the EFS admin area.</p>\n<h3 id=\"access-restrictions-for-accessing-data-records\" class=\"wysiwyg-text-align-justify\"><strong>Access restrictions for accessing data records</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">For reasons of privacy, the <strong>Detail view</strong> menu is protected by special rights, i.e. its information and functions are not automatically available to every user:</p>\n<p class=\"wysiwyg-text-align-justify\">Authorization for data access:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If the viewer has read rights to “report_testdata”, they can open the menu<strong> Detail view</strong> and see the results of the individual participants. A user who has this right, but none of the following additional rights, can view various field data including the consecutive participant number (lfdn) and disposition code, browser information, and system variables as e.g. language, flip variables, and quota. They will not be able to see the IP addresses or address data.</p>\n</li>\n<li>\n<p>If the viewer has additional read rights to “ip_addresses”, they will also see the IP addresses and host of participants.</p>\n</li>\n<li>\n<p>Additional read rights to “export_with_lfdn” enable you to access address data and result data combined. A user with this right can see the names, e-mail<br>addresses, code, and tester status of participants, in addition to the field and result data.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Authorization for editing data: Editing of result data is protected by a specific right. Writing authorization to <em>detail_view_edit</em> is required.</p>\n<h3 id=\"overview-of-data-records\" class=\"wysiwyg-text-align-justify\"><strong>Overview of data records</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Projects</strong> → {Selected project} → <strong>Statistics → Detail view</strong> menu provides an overview of the result data records. Depending on your access authorization, the following will be visible:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>consecutive number and disposition code of the participants, and various additional field data, browser information, and system variables</p>\n</li>\n<li>\n<p>IP address and host of the participants, if you have reading rights to<em> ip_addresses</em></p>\n</li>\n<li>\n<p>in personalized projects, name, e-mail address, tester status, and code of the participants, if you have reading authorization to <em>export_with_lfdn</em></p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Depending on your access rights and the project type, you can also perform several actions on the individual data records via the “Actions” column:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Viewing (Anonymous surveys, personalized surveys, panel surveys, employee surveys)</p>\n</li>\n<li>\n<p>Editing (Anonymous surveys, personalized surveys, employee surveys)</p>\n</li>\n<li>\n<p>Deleting (Anonymous surveys, personalized surveys, employee surveys)</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">In the upper part of the dialog, you can find the selection criteria of the search function (period of access, disposition code, display of additional variables, names, and e-mail addresses of the participants). Also, using the View button you can open additional columns or hide superfluous columns.</p>\n<h3 id=\"viewing-individual-data-records\" class=\"wysiwyg-text-align-justify\"><strong>Viewing Individual data records</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To view the result data of a participant, click the <strong>Detail view</strong> icon in the overview. The following will be visible:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>consecutive number (“lfdn”) and disposition code of the participants, and various additional field data, browser information, and system variables</p>\n</li>\n<li>\n<p>IP address and host of the participants, if you have reading rights for “ip_addresses”.</p>\n</li>\n<li>\n<p>in personalized projects, name, e-mail address, tester status, and code of the participants, if you have reading authorization for “export_with_lfdn”.</p>\n</li>\n<li>\n<p>the survey results of the participants.</p>\n</li>\n</ul>\n<h3 id=\"editing-individual-data-records\" class=\"wysiwyg-text-align-justify\"><strong>Editing individual data records</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To edit a result data record, click the <strong>Edit</strong> icon in the column “Actions”. You can change open-ended answers by simply overwriting them. To change closed<br>answers, change the data by selecting another value in the drop-down lists.</p>\n<h3 id=\"deleting-data-records\" class=\"wysiwyg-text-align-justify\"><strong>Deleting data records</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Using the action „Delete data records completely“, it is possible to delete individual or several data records. In personalized surveys and employee surveys, this will remove not only the field and result data but the data in participant administration as well.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note that deleted records cannot be restored.</p>\n<h3 id=\"deleting-result-data-selectively\" class=\"wysiwyg-text-align-justify\"><strong>Deleting result data selectively</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Result data can be deleted selectively, i.e. the value of a specific variable for all participants (e.g. an e-mail address determined in the course of the survey) will be completely removed from the records. This makes it possible, for example, to anonymize data later on. When deleting, the respective variable is set to its default value, i.e. “-77” for numeric fields and “NULL” for text fields. Delete operations are logged in project info under project documentation.</p>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Delete data</strong> menu item.</p>\n</li>\n<li>\n<p>Choose the variable whose content you wish to delete from the records of all participants.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Delete data</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">For security reasons, this function is protected by a separate right: The menu item labeled <strong>Projects</strong> → {Selected project} → <strong>Statistics → Delete data</strong> is only visible to users who have read rights to <em>report_erase_data</em>.</p>\n<h2 id=\"quality-correction\" class=\"wysiwyg-text-align-justify\"><strong>Quality correction</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The conscientiousness with which survey participants fill in questionnaires is critical for the quality of the results of online surveys. The results from survey participants that merely click very quickly through the questionnaire, for example, to get a quick overview of the survey theme or on completion to participate in a prize draw, are of little value for further analysis in the end. The quality correction program helps you to recognize participants who simply “clicked through” by their answer behavior, to mark these data records, and if desired to delete them.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Response times as quality criterion</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The response times of a user are the key criteria needed for indexing the quality of survey participants. The time taken by each participant to complete a particular page of a survey can be calculated. First of all an index is formed for each participant that gives information on his mean processing time for a questionnaire page. Please note here: The time required by a participant to complete an entire survey is not a factor in the calculation. Depending on the direction of the questionnaire the number of pages that the participant sees can also vary tremendously.</p>\n<p class=\"wysiwyg-text-align-justify\">Subsequently, a separate calculation for each page is made, which shows where the survey participant is about the processing time of the media. The median survey time of 100 participants corresponds to the average survey duration of the 50th and the 51st survey participants when these have been sorted by survey time.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Determining the quality index for individual users</strong></p>\n<p class=\"wysiwyg-text-align-justify\">To determine the “quality” of a participant in a survey, his processing time is set in relation to the average processing time of the entire sample. The relationship can be expressed as a number that is stored in the variable “quality”. The value of 0,5 stands for the results of a survey of high quality. A higher value represents a higher quality of the results of the survey. A value below 0.5 stands for lower quality.</p>\n<h3 id=\"triggering-quality-correction\" class=\"wysiwyg-text-align-justify\"><strong>Triggering quality correction</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can start the program that calculates the quality index under<strong> Projects</strong> → {Selected project} → <strong>Statistics → Quality correction</strong> by clicking on the button <strong>Save</strong>. It does not make any changes to the actual survey data, rather it expands the data record to include the variable “quality”.</p>\n<p class=\"wysiwyg-text-align-justify\">Quality correction should not be triggered when large surveys are being conducted simultaneously in the installation. Only a few hundred participants have no impact on the quality correction conducted at the same time.</p>\n<h3 id=\"viewing-the-quality-index-in-the-export-data-record\" class=\"wysiwyg-text-align-justify\"><strong>Viewing the quality Index in the export data record</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The quality index of a participant will be stored in the variable “quality”. This is contained within the export data record, and therefore you can identify the data records of participants with critical values and where necessary delete them before making an evaluation.</p>\n<h2 id=\"data-cleaning\" class=\"wysiwyg-text-align-justify\"><strong>Data cleaning</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">If a respondent uses the “Back” button in the questionnaire or that of the browser while completing a questionnaire, they may pass the same filter question more than once, giving different answers and then being routed into another filter branch, where they will answer different questions.</p>\n<p class=\"wysiwyg-text-align-justify\">Example: Somebody answers the question of whether they drive a car with “Yes” and is subsequently asked all car-related questions. Then, they go back to the questionnaire and state they do not drive a car. A filter lets them skip all car-related questions now. When the respondent completes the survey, they will have stated they do not drive a car. Nonetheless, all car-related variables will contain values.</p>\n<p class=\"wysiwyg-text-align-justify\">In the past, such irrelevant data had to be manually cleaned from the result data. With the “Data cleaning” function, this cleaning process has been automated.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Please note</strong>:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Data cleaning only takes completed interviews into consideration, i.e. records with status 31 or 32.</p>\n</li>\n<li>\n<p>The following routing types are supported:</p>\n<ul>\n<li>\n<p>“Filter” and “Random rotation” branches.</p>\n</li>\n<li>\n<p>Trigger types that affect routing via changes in the survey results. The function should, however, not be used in projects involving page triggers: In this case, the routing that the respondent took erroneously or for test purposes cannot be unambiguously identified.</p>\n</li>\n<li>\n<p>Action pages.</p>\n</li>\n<li>\n<p>Depot questions.</p>\n</li>\n<li>\n<p>EFS-side <strong>Back</strong> buttons. Please note: browser-side <strong>Back</strong> buttons are not fully supported. If a respondent skips back several pages using the browser <strong>Back </strong>button first and then skips forward several pages using the browser <strong>Forward</strong> button ignoring the system warning, these steps cannot be tracked and stored correctly. I.e. pages might be missing in page history, though valid data from these pages exist.</p>\n</li>\n<li>\n<p>“Random rotation” branches and loops are not supported.</p>\n</li>\n<li>\n<p>Data cleaning should not be applied to surveys that are prefilled with values. I.e. it should not be combined with the options “Transfer master data values to survey variables” → “Always prefill”, “Allow multiple participations, prefill with values of last participation” (Chapter 3.7.10, p. 92), and import of specific answers from other projects.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"activating-automatic-data-cleaning\" class=\"wysiwyg-text-align-justify\"><strong>Activating automatic data cleaning</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the <strong>Projects</strong> module, click on the desired project, and then choose the <strong>Project Properties</strong> menu item. On the tab <strong>General Options</strong>, tick the checkbox in the “Enable data cleaning” field. Then, confirm by clicking on <strong>Submit</strong>. The <strong>Display</strong> link allows you to switch to the<strong> Data cleaning</strong> submenu.</p>\n<h3 id=\"triggering-data-cleaning-for-the-entire-project\" class=\"wysiwyg-text-align-justify\"><strong>Triggering data cleaning for the entire project</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The documentation of all changes to the data as well as functions for restoring all or part of the original data are located in the data cleaning log. There are two ways of accessing this:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>Display</strong> link in the <strong>Project Properties</strong> menu.</p>\n</li>\n<li>\n<p>The second way is via the <strong>Statistics</strong> → Data cleaning menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">You are automatically taken to the <strong>General</strong> tab. The “General Information” area shows whether data cleaning has already been performed and how many records were processed.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Status data cleaning in this project: Data cleaning is activated from the <strong>Project Properties</strong> menu.</p>\n</li>\n<li>\n<p>Number of cleaned records: The records that were changed during data cleaning.</p>\n</li>\n<li>\n<p>Number of data records that were checked but did not require cleaning: The records that would not be/are not affected in the event of data cleaning.</p>\n</li>\n<li>\n<p>Number of uncleaned records:</p>\n<ul>\n<li>\n<p>If data cleaning has not taken place, this value will contain the uncleaned records.</p>\n</li>\n<li>\n<p>After data cleaning has taken place, all records that could not be checked and cleaned because the interviews were not completed remain in this field.</p>\n</li>\n<li>\n<p>If further questionnaires were filled out after a manual data cleaning, this value will be the total of all uncleaned records, as well as all records that were not checked during the manual data cleaning because the interviews were not completed.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note that data cleaning only takes completed interviews into consideration, i.e. records with status 31 or 32.</p>\n<p class=\"wysiwyg-text-align-justify\">In the “Data cleaning for the whole project” area, you can trigger or undo data cleaning:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you select “Clean all data” and then confirm by clicking on<strong> Execute</strong>, the cleaning operation will be triggered.</p>\n</li>\n<li>\n<p>If you select “Recover all data” and then confirm by clicking on<strong> Execute</strong>, the original state will be restored.</p>\n</li>\n</ul>\n<h3 id=\"viewing-details-and-editing-records-manually\" class=\"wysiwyg-text-align-justify\"><strong>Viewing details and editing records manually</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Extended</strong> tab provides detailed documentation of all changes to the data as well as functions for both editing individual records and restoring all or part of the original data.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Display Options</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Number of datasets per page: If you enter the corresponding value and then confirm by clicking on <strong>Apply</strong>, you can change the number of records displayed on one page.</p>\n</li>\n<li>\n<p>Display only datasets with a particular variable: This search function identifies all records containing the given string. After entering the string, you can trigger the search by clicking on <strong>Apply</strong>.</p>\n</li>\n<li>\n<p>Display routemap: Ticking the checkbox and then clicking on <strong>Apply</strong> will show the so-called routemap in the log. The routemap is a comma-separated page list reflecting the participant’s valid route through the survey (see the “Example” section below). It is extracted from the page history (phistory is the variable used in the export record, page history is the label used in the SPSS export record).</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">I<strong>nterpreting the entries in the data cleaning log</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The data cleaning log contains the following information and functions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Cons. no.: The respondent’s consecutive number in both the survey table and the export record. The table contains only the records of those respondents for whom data cleaning might be required.</p>\n</li>\n<li>\n<p>Cleaned data: Those data from the complete record that were / would be changed during cleaning.</p>\n</li>\n<li>\n<p>Original: The original state of those data from the complete record that were / would be changed by cleaning.</p>\n</li>\n<li>\n<p>Routemap: This can be shown and hidden using the “Display routemap” function in the “Display options” area.</p>\n</li>\n<li>\n<p>Cleaned: yes/no.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing individual records</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You have the option of targeting individual records for cleaning or for restoring the original state. To do so, tick the respective checkbox in the “Execute data cleaning” or “Recover data” column, and confirm by clicking on <strong>Save</strong>.</p>\n<h3 id=\"identifying-cleaned-data-in-the-export-record\" class=\"wysiwyg-text-align-justify\"><strong>Identifying cleaned data in the export record</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The export record provides information if an individual record was cleaned: It is stored in the variable cleaned (labeling in the SPSS export record: “datacleaning”) which can have the following properties:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>0 = uncleaned data records and records of incomplete interviews which are excluded from the cleaning process</p>\n</li>\n<li>\n<p>1 = cleaned</p>\n</li>\n<li>\n<p>2 = checked but did not require cleaning</p>\n</li>\n</ul>\n<h2 id=\"delete-data\" class=\"wysiwyg-text-align-justify\"><strong>Delete data</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Result data can be deleted selectively, i.e. the value of a specific variable for all participants (e.g. an e-mail address determined in the course of the survey) will be completely removed from the records. This makes it possible, for example, to anonymize data later on.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq-1\" class=\"wysiwyg-text-align-justify\">What is the purpose of the Field Report?</h3>\n<p class=\"wysiwyg-text-align-justify\">The Field Report provides essential information about the study's progress, including statistical data, access statistics, drop-out rates, and quota statistics. It helps monitor the survey's performance and identify any issues during the field phase.</p>\n<h3 id=\"faq-2\" class=\"wysiwyg-text-align-justify\">How can I restrict the Online Statistics?</h3>\n<p class=\"wysiwyg-text-align-justify\">You can restrict Online Statistics by selecting specific disposition codes or variable characteristics in the configuration options. This allows you to focus on particular subsets of your data for analysis.</p>\n<h3 id=\"faq-3\" class=\"wysiwyg-text-align-justify\">What is Quality Correction and how does it work?</h3>\n<p class=\"wysiwyg-text-align-justify\">Quality Correction is a feature that helps identify low-quality responses based on participants' response times and behavior. It calculates a quality index for each participant, which can be used to filter out potentially unreliable data from your analysis.</p>\n<h3 id=\"faq-4\" class=\"wysiwyg-text-align-justify\">How does Data Cleaning improve survey data quality?</h3>\n<p class=\"wysiwyg-text-align-justify\">Data Cleaning automatically removes irrelevant data caused by participants using the \"Back\" button and changing their responses to filter questions. This ensures that the final dataset only contains valid and consistent responses, improving the overall quality of your survey results.</p>",
    "user_segment_ids": []
}