{
    "id": 20371125870354,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371125870354.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371125870354-Adding-Participants",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:55:07Z",
    "updated_at": "2024-08-28T11:26:06Z",
    "name": "Adding Participants",
    "title": "Adding Participants",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T10:22:39Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive guidance on adding participants to a project in EFS. It covers the manual creation of new participants, importing participants from a file, and importing participant codes.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Adding participants is a crucial step in setting up a project. This guide explains various methods to add participants, including manual entry and bulk import, as well as special considerations for formatting and handling participant data.</p>\n<ul>\n<li><a href=\"#new-participant\">New Participant</a></li>\n<li><a href=\"#importing-participants\">Importing participants</a></li>\n<li><a href=\"#import-codes\">Import Codes</a></li>\n</ul>\n<h2 id=\"new-participant\" class=\"wysiwyg-text-align-justify\">New Participant</h2>\n<p class=\"wysiwyg-text-align-justify\">To manually create a new participant, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click the<strong> New participant</strong> split button to open the entry dialog.</p>\n</li>\n<li>\n<p>Enter the participant data. The following rules apply:</p>\n<ul>\n<li>\n<p>The “E-mail” field must always be completed. Use of the other fields is optional.</p>\n</li>\n<li>\n<p>In the “Password” field, the “Generate new password” checkbox is ticked by default. If you enter a password yourself, this will be used, and no automatic password will be generated.</p>\n</li>\n<li>\n<p>If you want to have the questionnaire checked by test persons with specific tester status prior to the field phase, then tick the checkbox “yes” in the field “Tester” for these test persons. For further information on the use of testers.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If variable characteristics are missing, use the <strong>Edit variable</strong> icon to open the dialog  and add the new characteristics as required.</p>\n</li>\n<li>\n<p>After entering all required information, click on the <strong>Save</strong> button to save the data.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The new participant will appear in the list of participants.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"importing-participants\" class=\"wysiwyg-text-align-justify\">Importing participants</h2>\n<p class=\"wysiwyg-text-align-justify\">Usually, you will not create the individual participants of your project manually but rather import the list of participants. In the following, the sequence of the import operation is first explained. After that, the structure of the import file is explained in detail.</p>\n<h3 id=\"downloading-the-import-template-to-import-participants\" class=\"wysiwyg-text-align-justify\">Downloading the import template to import participants</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Switch to the <strong>Projects</strong> → {Selected project} → <strong>Participant administration</strong> menu.</p>\n</li>\n<li>\n<p>The dialog where the import takes place is opened by clicking on the <strong>New participant</strong> split button and selecting the <strong>Import participants</strong> option.</p>\n</li>\n<li>\n<p><em>EFS</em> provides a preformatted import template already containing all necessary columns. It can be downloaded by clicking on <strong>Download import template</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017191691666\" alt=\"Importing participants.jpg\"></p>\n<h3 id=\"filling-the-import-template-with-participant-data\" class=\"wysiwyg-text-align-justify\">Filling the import template with participant data</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the template in a suitable program</p>\n</li>\n<li>\n<p>Enter the data</p>\n</li>\n<li>\n<p>Save the file in Excel or CSV</p>\n</li>\n</ul>\n<h3 id=\"matching-the-fields-of-the-import-file-with-the-database-fields\" class=\"wysiwyg-text-align-justify\">Matching the fields of the import file with the database fields</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Again, open the import dialog by clicking on the Import participants button.</p>\n</li>\n<li>\n<p>Select the appropriate character set.</p>\n</li>\n<li>\n<p> Use<strong> Browse</strong> to select the import file on your computer.</p>\n</li>\n<li>\n<p>Verify that the checkbox in the field “First row includes column labels” is set appropriately. Normally, it should be activated.</p>\n</li>\n<li>\n<p>Verify that the checkbox in the field “Allow duplicate e-mail addresses” is set appropriately. Normally, it should be deactivated.</p>\n</li>\n<li>\n<p>Click on the <strong>Send file</strong> button to start the import operation.</p>\n</li>\n<li>\n<p>In the next step, all columns of the import file must be matched with the appropriate database fields. If you have used the template without changing the column labels, as recommended, the software will carry out the allocations automatically.</p>\n</li>\n<li>\n<p>After checking the allocations confirm by clicking on <strong>Proceed to preview</strong>.</p>\n</li>\n</ul>\n<h3 id=\"checking-import-data-in-the-preview\" class=\"wysiwyg-text-align-justify\">Checking import data in the preview</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In the import preview all the data records are displayed as they will be imported into the project. The traffic-light icon in the “Status” column indicates whether the data record is complete and logically coherent. If the icon is red, i.e. if an error occurred, the reason for this will be indicated when hovering the cursor over the icon.</p>\n</li>\n<li>\n<p>If necessary, use the<strong> Edit</strong> and <strong>Delete</strong> icons to open and subsequently edit resp. delete specific data records. Afterwards, use the <strong>Back</strong> link to return to the overview.</p>\n</li>\n</ul>\n<h3 id=\"executing-import-and-downloading-results\" class=\"wysiwyg-text-align-justify\">Executing import and downloading results</h3>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you are satisfied with the data in the preview, click on <strong>Import</strong> to trigger the actual import.</p>\n</li>\n<li>\n<p>After completion of the import operation, you will be shown how many data records have been created and how many have not been created due to problems.</p>\n</li>\n<li>\n<p>By clicking on the <strong>Download results</strong> button you can retrieve an Excel file containing the following information:</p>\n<ul>\n<li>\n<p>all data contained in the import file</p>\n</li>\n<li>\n<p>the “result” column contains the import result, i.e. a message “Data record import successful” or “Data record not imported”</p>\n</li>\n<li>\n<p>in case of problems, the reason will be indicated in the “messages” column</p>\n</li>\n</ul>\n</li>\n<li>\n<p>If necessary, you can correct the data records that were not successfully created directly within this file, delete the data records created successfully, and use this file for a new import attempt.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Do not start preparing the import until you have created all the required participant variables.</p>\n</li>\n<li>\n<p>When using Excel, consider the following restrictions imposed by manufacturer specifications:</p>\n<ul>\n<li>\n<p>Only the first sheet of the file will be processed. You should not exceed the maximum of 256 columns and 65,000 rows. Should you require more columns or rows, select a different program and save your import file in CSV format.</p>\n</li>\n<li>\n<p>Excel import is only possible for files created or saved using Excel 97+. Excel files that were created or saved using Excel for Mac”, “Neo Office” or “Numbers”, for example, cannot be imported.</p>\n</li>\n<li>\n<p>The file format XLSX, newly introduced by Microsoft with Office 2007, is not supported by<em> EFS</em>.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"formatting-of-the-import-file-in-detail\" class=\"wysiwyg-text-align-justify\">Formatting of the import file in detail</h3>\n<p class=\"wysiwyg-text-align-justify\">When filling in the import template or creating your own import file you have to consider various formatting rules.</p>\n<h4 id=\"file-format\" class=\"wysiwyg-text-align-justify\">File format</h4>\n<p class=\"wysiwyg-text-align-justify\">The import file can be created in Excel or CSV. Data columns may be separated by tab, comma, or semicolon. When using <em>Excel</em>, consider the following restrictions imposed by manufacturer specifications:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Only the first sheet of the file will be processed. You should not exceed the maximum of 256 columns and 65,000 rows.</p>\n</li>\n<li>\n<p>Excel import is only possible for files created or saved using Excel 97+. Excel files that were created or saved using “Excel for Mac”, “Neo Office” or “Numbers”, for example, cannot be imported.</p>\n</li>\n<li>\n<p>The file format XLSX is supported by <em>EFS</em>.</p>\n</li>\n</ul>\n<h4 id=\"file-structure\" class=\"wysiwyg-text-align-justify\">File structure</h4>\n<p class=\"wysiwyg-text-align-justify\">An individual column is created for each participant variable to be imported.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>We recommend entering the respective column labels in the first row.</p>\n<ul>\n<li>\n<p>Where possible use the name of the respective variable as the label: The software will automatically identify the columns and assign them to the appropriate database fields. If you choose this option, make sure to tick the checkbox “First row includes column labels” in the import dialog.</p>\n</li>\n<li>\n<p>Should you deviate from these recommendations, make sure that the first row does not contain any blank spaces or special characters such as dots or umlauts. Otherwise, these will be uniformly replaced with “_”.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Optionally, you can dispense with using the column labels in the file. In this case, untick the checkbox labeled “First row includes column labels” in the import dialog.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The values of the individual data records are entered in the rows of the file.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The code of the desired characteristic must be specified for data imported into “radio buttons”, “selectbox” or “checkbox” fields. You will find it in the <strong>Codebook</strong>. (Tick the checkbox labeled “Show participant variables” in order to display the respective section.) Empty cells are automatically set to the default value “0” upon import. How codes that do not yet exist or entries that cannot be interpreted as code are treated depends on the display type and fine-tune settings.</p>\n</li>\n<li>\n<p>Optionally, you can create new characteristics for an existing variable during import. To do this, the relevant option must be activated for the respective variable.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Special features of certain standard variables</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Some variables require special consideration:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>In principle, an e-mail address should only be registered once, unless you wish to permit duplicate participation and explicitly select the “Allow duplicate e-mail addresses” field.</p>\n</li>\n<li>\n<p>Sometimes it is necessary to create dummy accounts. In such cases, you can use e-mail addresses on the @3uu.eu domain: these addresses are owned by TIVIAN, mails sent to them are deleted automatically.</p>\n</li>\n<li>\n<p>The access code must not be longer than the number of characters defined for option \"Type of codes which will be generated\" under the 'project properties' menu of your project.</p>\n</li>\n<li>\n<p>The mobile phone numbers of participants in <em>u_mobile</em> must be formatted according to international formatting rules:</p>\n<ul>\n<li>\n<p>A total of seventy digits</p>\n</li>\n<li>\n<p>Two zeros at the start</p>\n</li>\n<li>\n<p>Country prefix, e.g. 49 for Germany</p>\n</li>\n<li>\n<p>The number itself.</p>\n</li>\n<li>\n<p>Example: 0049223379336.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The special status of tester accounts can be set via the “tester” column of the import file. The values in this column are coded as follows:</p>\n<ul>\n<li>\n<p>0 and blank field: normal participant</p>\n</li>\n<li>\n<p>1: tester</p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you use passwords that contain non-ASCII characters, pay attention that characters and character set of the project are compatible with each other. Otherwise registration will not function, because the entries made by respondents will not correspond correctly with the contents of the database due to transfer problems. It is not possible for example to register for an ISO-88599-1 coded survey with a Japanese password. These kinds of problems can be avoided through the use of the international character set UTF-8, because UTF-8 can display all languages.</p>\n<p class=\"wysiwyg-text-align-justify\">When exporting and importing participant data, mind that the “u_mobile” column of the Excel file should be formatted as “Text”. Otherwise the two leading zeros are removed.</p>\n<h4 id=\"allowing-duplicate-participation\" class=\"wysiwyg-text-align-justify\">Allowing Duplicate Participation</h4>\n<p class=\"wysiwyg-text-align-justify\">It is possible to use duplicate e-mail addresses in personalized projects, i.e. a participant can appear more than once. This function makes it possible, for example, to perform projects in several waves with the same participants. It is also useful for trade fair servers. In this case, the participant data records are not uniquely identified by the email address alone, but by the unique combination of e-mail address and password. If you wish to use duplicate e-mail addresses, your import file should therefore contain at least the names of the participants, e-mail addresses, passwords, and usually additional information on wave membership. For a participant to receive a duplicate invitation, you must create two rows that contain the same e-mail address, but different passwords. The waves to which the duplicate participants belong are usually defined via the content of the <em>u_group</em> field.</p>\n<p class=\"wysiwyg-text-align-justify\">For this, the checkbox in the “Allow duplicate e-mail addresses” field must be ticked.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"import-codes\" class=\"wysiwyg-text-align-justify\">Import Codes</h2>\n<p class=\"wysiwyg-text-align-justify\">The<strong> Import codes</strong> option of the split button allows you to import participant codes from a file into participant administration. Each row of the file is interpreted as one code. Therefore, the file should not contain a header. A participant is created for each code. The remaining participant data (e.g. name, password) are set automatically.</p>\n<p class=\"wysiwyg-text-align-justify\">For each imported code, a dummy account will be created. E-mail addresses on the @3uu.eu domain are used for these accounts. These addresses are owned by Tivian, mails sent to them are deleted automatically.</p>\n<p class=\"wysiwyg-text-align-justify\">Please insert import codes into the text field below, each line one code. Per code one account will be created if code doesn't already exist.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq-1\" class=\"wysiwyg-text-align-justify\">What should I consider when using Excel for imports?</h3>\n<p class=\"wysiwyg-text-align-justify\">When using Excel, be aware of these limitations: - Only the first sheet is processed. - Maximum 256 columns and 65,000 rows. - Use Excel 97+ format (not Excel for Mac, Neo Office, or Numbers). - XLSX format is supported by EFS.</p>\n<h3 id=\"faq-2\" class=\"wysiwyg-text-align-justify\">How should I format mobile phone numbers for import?</h3>\n<p class=\"wysiwyg-text-align-justify\">Format mobile numbers according to international rules: - Up to 70 digits - Start with two zeros - Include country prefix (e.g., 49 for Germany) - Example: 0049223379336</p>\n<h3 id=\"faq-3\" class=\"wysiwyg-text-align-justify\">What should I do if I need to create dummy accounts?</h3>\n<p class=\"wysiwyg-text-align-justify\">Use email addresses on the @3uu.eu domain for dummy accounts. These are owned by TIVIAN, and emails sent to them are automatically deleted.</p>",
    "user_segment_ids": []
}