{
    "id": 20370699710866,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370699710866.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370699710866-Projects",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:22:42Z",
    "updated_at": "2024-08-28T11:27:29Z",
    "name": "Projects",
    "title": "Projects",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-02T15:11:45Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides comprehensive information about managing projects in EFS (Enterprise Feedback Suite). It covers various aspects of project management, including creating, organizing, archiving, and reactivating projects, as well as different project types and their features.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">The survey module focuses on a graphical interface that does not require any scripting skills.</p>\n<p class=\"wysiwyg-text-align-justify\">An intuitive graphical interface provides access to features that not only allow the creation of simple surveys but instead enable the user to create questionnaires that follow research methodology, that create a fluent participant experience and that trigger additional workflows to follow up or to create actions and alerts.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li><a href=\"#the-project-list\">The Project list</a></li>\n<li><a href=\"#field-overview\">Field overview</a></li>\n<li><a href=\"#archive\">Archive</a></li>\n<li><a href=\"#creating-projects\">Creating Projects</a></li>\n<li><a href=\"#project-types\">Project Types</a></li>\n<li><a href=\"#transferring-projects-to-other-efs-installations\">Transferring Projects to Other EFS Installations</a></li>\n<li><a href=\"#survey-menu\">Survey Menu</a></li>\n</ul>\n<h2 id=\"the-project-list\" class=\"wysiwyg-text-align-justify\"><strong>The Project list</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">By clicking the <strong>Projects</strong> button, you will get access to the <strong>Project list</strong>, the <strong>Field overview,</strong> and the <strong>Archive</strong>. The <strong>Project list</strong> will be opened by default.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226439826\" alt=\"Project list.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The project list gives you an overview of all of the projects you have access to. You will find the following information on every project in the table:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Title</p>\n</li>\n<li>\n<p>Globe icon: survey languages.</p>\n</li>\n<li>\n<p>Author (except for forum discussions)</p>\n</li>\n<li>\n<p>Project ID (except for forum discussions)</p>\n</li>\n<li>\n<p>Type: Project type</p>\n</li>\n<li>\n<p>Status: The current state of your survey project each with information on the date of the last update.</p>\n</li>\n<li>\n<p>Created: The date on which the project was created.</p>\n</li>\n<li>\n<p>Start: Date on which the survey started in the field.</p>\n</li>\n<li>\n<p>Traffic-light icon: Signifies whether participants can access the survey. If the survey is active and in the field period, then a green arrow pointing upwards is visible. If the survey is not active and not in the field period, then a red arrow pointing downwards is visible.</p>\n</li>\n<li>\n<p>Actions: Via the icons and checkboxes you can edit individual projects or all projects.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The table columns can be hidden or visible in order to achieve a better overview. Click on the <strong>Show column</strong> icons to make them visible, and click on the <strong>Hide column</strong> icons to hide them.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Modifying Display Settings</strong></p>\n<p class=\"wysiwyg-text-align-justify\">You have various options for displaying the project list:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>With <strong>Collapse, </strong>you can close all folders except the default folder so that only the hierarchy and not the content is visible. With <strong>Expand </strong>you can open all folders.</p>\n</li>\n<li>\n<p>By clicking on the <strong>Show column</strong> icons you can display the columns “Author”, “Pages”, and “Created” with the creation date for the project and “Start” with the date of when the field phase started</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Searching for Projects</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The following filter and search options are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Type: Project type</p>\n</li>\n<li>\n<p>Status: Project status</p>\n</li>\n<li>\n<p>Search: A keyword search will always cover the project title, project directory, and author.</p>\n</li>\n<li>\n<p>The content of the folder “Projects edited recently” is not searched, but always displayed in full.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The project directory can be found in the URL of the survey that is displayed in the project info. If the URL were, for example, http://your-domain.com/uc/websitecheck, then “website check “ is the project directory and you can perform a targeted search for this word.</p>\n<p class=\"wysiwyg-text-align-justify\">For the forum discussions which can optionally be included in the project list, you can search or restrict the list only by project title and the available statuses “active” and “inactive”. Projekt ID, project directory, and author are not available for this project type.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Finding the Most Recently Edited Projects</strong></p>\n<p class=\"wysiwyg-text-align-justify\">At the top of the directory structure, you will find the folder “Projects edited recently”. This folder contains those projects that you worked on during the last seven days. The list is sorted by the most recent edit date, and its scope is limited to a maximum of 20 projects.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Marking Important Projects</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Important projects in the project list can be highlighted with a <strong>Star</strong> icon to make them easier to find (except forum discussions). To do so, switch to the project info for the desired project and click on the <strong>Star</strong> next to the project title. A second click will deactivate the marker again.</p>\n<h3 id=\"organizing-projects\" class=\"wysiwyg-text-align-justify\"><strong>Organizing Projects</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">With the help of folders you can sort, group together and manage projects (except forum discussions). You can for example order the projects by theme, customer, or responsible user.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>You can choose between the tree view and the standard list view.</p>\n</li>\n<li>\n<p>You can arrange the folders in up to three hierarchy levels.</p>\n</li>\n<li>\n<p>There are several display options at your disposal.</p>\n</li>\n<li>\n<p>Access to folders can be controlled through the rights system.</p>\n</li>\n<li>\n<p>The project list folder system is complemented by an archive folder system that functions exactly the same, but is set up independently.</p>\n</li>\n<li>\n<p>You need write rights for <em>create_project_cat</em> to create new folders or edit existing folders.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226449426\" alt=\"Create new folder.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Creating a new folder</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Click on the <strong>+ Folder</strong> button. You need to write rights for “create_project_cat” to see this button.</p>\n</li>\n<li>\n<p> Enter the name of the folder and a description.</p>\n</li>\n<li>\n<p>Select the appropriate main folder. By default, this is set to the “Default” folder.</p>\n</li>\n<li>\n<p>When the new folder is positioned directly under the “Default” folder, you can define the access rights for particular teams.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Create</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Editing folders</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Find the desired folder in the project list and click on the <strong>Further Actions</strong> icon. (You need write rights for <em>create_project_cat</em> to see this icon.) The following editing options will appear in a popup window:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Delete folder</strong>: This link appears only when the folder is empty and is used to delete the folder.</p>\n</li>\n<li>\n<p><strong>Edit folder</strong>: Through this link, you can edit the properties of the folder.</p>\n</li>\n<li>\n<p><strong>Create subfolder</strong>: Opens a form that creates a subfolder.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Moving folders</strong></p>\n<p class=\"wysiwyg-text-align-justify\">It is possible to move folders, including their projects and subfolders, to another position in the hierarchy. To achieve this, use the<strong> Edit</strong> <strong>folder</strong> button to open the dialog. In the drop-down list “Put folder below”, select the new parent folder. Then, confirm with <strong>Save</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">When moving folders, please mind that the folder structure is restricted to three levels. Therefore, the list of potential target folders contains only folders below which your folder and its subfolders fit.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Ordering projects into folders</strong></p>\n<p class=\"wysiwyg-text-align-justify\">When sorting projects into other folders, you can choose between two possibilities:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If you want to resort to only one project, open the Project Properties dialog (via the <strong>Change</strong> link in the “Project Type” field of the Survey menu). In the “Put the projects in folder” field, select the appropriate folder and confirm by clicking on <strong>Change</strong>.</p>\n</li>\n<li>\n<p>If you want to move several projects into the same target folder in one step, start by ticking the “Actions” checkboxes of these projects in the project list. Select the action “Change folder” and confirm by clicking on <strong>Execute</strong>. In the following dialog, you can check your selection. Then, select the appropriate target folder in the drop-down list and confirm by clicking on <strong>Move</strong>.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Granting access rights to folders</strong></p>\n<p class=\"wysiwyg-text-align-justify\">Folders located directly under the “Default” folder can be assigned rights during creation.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If rights are not explicitly defined, then the settings for the Default folder will be assigned.</p>\n</li>\n<li>\n<p>Users with read rights for a folder can view the corresponding folder and its subfolders.</p>\n</li>\n<li>\n<p>Users with write rights for a folder can edit and delete the corresponding folder and its subfolders.</p>\n</li>\n<li>\n<p>If a subfolder, whose main folder has been assigned access rights, is moved to a new main folder with other access rules, then the access rights defined in the original main folder remain intact.</p>\n</li>\n</ul>\n<h3 id=\"actions\" class=\"wysiwyg-text-align-justify\"><strong>Actions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Using the icons in the column “Actions” and the Further Actions icon, you can edit specific projects or access important menus directly. (Please mind: Editing options for forum discussions are currently still limited, if needed please use the familiar options in the <em>Website</em> module.)</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Jump to questionnaire editor</strong>: Allows to jump directly into the questionnaire view of the questionnaire editor.</p>\n</li>\n<li>\n<p><strong>Edit project data</strong> / <strong>-type</strong>: You can edit the project data and the type.</p>\n</li>\n<li>\n<p><strong>Copy project</strong>: You can copy the entire project.</p>\n</li>\n<li>\n<p><strong>Preview</strong>: Opens the questionnaire of the project in preview mode.</p>\n</li>\n<li>\n<p>For personalized projects: <strong>Participant administration</strong>. Allows to jump directly into the participant administration.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">By clicking on <strong>Further actions</strong> you can open a popup window. This contains the following additional actions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Status changes: <strong>Activate</strong>, <strong>no further participation, Deactivate</strong>,<strong> End</strong>. By clicking on these links you can change the status of the project.</p>\n</li>\n<li>\n<p><strong>Export</strong>: The Export dialog is opened.</p>\n</li>\n<li>\n<p><strong>Rights</strong>: You can assign access rights to a project to different teams.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Furthermore, various actions can be applied to selected projects or all. To do so, you select the desired projects by ticking the checkboxes in the “Actions” column. The<strong>n y</strong>ou specify the desired action in the drop-down list and confirm by clicking <strong>Execute</strong>.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Change folder</strong>: This enables you to move the projects selected into a target folder to be defined.</p>\n</li>\n<li>\n<p><strong>Delete projects</strong>: Allows to remove the projects selected. Please note that the deletion process cannot be reversed. Project and result data from deleted projects can no longer be reconstructed.</p>\n</li>\n<li>\n<p><strong>Archive projects</strong>: Starts the archiving process.</p>\n</li>\n</ul>\n<h2 id=\"field-overview\" class=\"wysiwyg-text-align-justify\"><strong>Field overview</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">A field overview for the whole <em>EFS</em> installation is displayed in the <strong>Projects</strong> → <strong>Field overview</strong> menu. You can use this overview to monitor the progress of the survey and analyze the results. The “Status of projects” table lists all activated projects in alphabetical order.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226439314\" alt=\"Field overview.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The following information is displayed for each project:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Title: By clicking on the title, you can open the detailed field report of the respective project.</p>\n</li>\n<li>\n<p>Type: Displays an abbreviation for the respective project type.</p>\n</li>\n<li>\n<p>Status: Project status.</p>\n</li>\n<li>\n<p>Start and end</p>\n</li>\n<li>\n<p>Total sample: Total number of participants.</p>\n</li>\n<li>\n<p>Completed: Number of participants who have completed the whole questionnaire.</p>\n</li>\n<li>\n<p>Currently responding: Number of participants who are currently actively completing the questionnaire.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Optionally, forum discussions can be displayed in the field overview.</p>\n<h3 id=\"restricting-the-field-overview\" class=\"wysiwyg-text-align-justify\"><strong>Restricting the field overview</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Using the search function, you can restrict the field overview to specific projects. E.g. the list can be restricted to those projects which are in the field and which have been accessed within the last two hours. The following search criteria are available:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Display Type: The drop-down list provides you with often-needed combinations of project status, field period, and time intervals, e.g. “Show only active projects in the field”, “Show only expired projects” or “Show only projects that will expire within the next (7/14/21) days”.</p>\n</li>\n<li>\n<p>The period considered for the column “Currently responding”: The interval is configurable.</p>\n</li>\n<li>\n<p>Search: A keyword search will always cover the project title.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If several criteria are used at once, AND conjunctions will be used. For forum discussions, you can search or restrict the list only by the available statuses “in the field” and “inactive”. Other statuses are not used for this project type.</p>\n<h2 id=\"archive\" class=\"wysiwyg-text-align-justify\"><strong>Archive</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Survey projects can be archived. To lighten the load on the database the result data of projects is compressed into a zip file and then stored in a protected area of the hard disk. This process is executed once a day during a low-traffic period. After successful activation, you will be notified by e-mail. Using the reactivation function you have the option of transferring the project with or without result data back to the project list so that it can be edited and placed again in the field.</p>\n<p class=\"wysiwyg-text-align-justify\">If you delete the result data of a project from the hard drive completely but would like to keep a backup copy for security reasons, you can download the zip file with the result data and store it locally. As long as the actual project still exists in the archive of the <em>EFS</em> installation, you will be able to upload the zip file again and reactivate the project with its result data. Please note, however, that the function of the zip file is merely to store the result data locally. These data can not be used to open and view the data outside of the <em>EFS</em> installation or for restoring a completely deleted project.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226438674\" alt=\"Archive.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">The archiving functionality is protected by the ACL right “archive_project”. You need read rights to archive projects and use the archive. You can archive quantitative survey projects independent of their status, using the “Actions” drop-down list in the project list. It is not possible to archive forum discussions.</p>\n<h3 id=\"archiving-projects\" class=\"wysiwyg-text-align-justify\"><strong>Archiving Projects</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">If you want to archive several projects at once, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Search for the appropriate projects in the project list and use the “Actions” checkboxes to mark them.</p>\n</li>\n<li>\n<p>Select the action “Archive projects”.</p>\n</li>\n<li>\n<p>Click on the <strong>Execute</strong> button.</p>\n</li>\n<li>\n<p>After a confirmation window, all data for the selected projects will be backed up from the database, compressed into downloadable zip files, and then deleted from the database. The archived projects with their zip files will be listed in the <strong>Projects</strong> →<strong> Archive</strong> menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Alternatively, if you want to archive a single project, you can proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Find the project to be archived in the project list and click on the title, to be taken to the <strong>Survey</strong> menu.</p>\n</li>\n<li>\n<p>Click on the links in the To-do field until the<strong> Archive</strong> link is displayed.</p>\n</li>\n<li>\n<p>Click on the<strong> Archive</strong> link.</p>\n</li>\n<li>\n<p>In the next low traffic period, all data for the project will be backed up from the database, compressed into the downloadable zip file and then deleted from the database. The archived project with the zip file will be listed in the<strong> Archive</strong> submenu.</p>\n</li>\n</ul>\n<h3 id=\"viewing-downloading-and-deleting-archived-projects\" class=\"wysiwyg-text-align-justify\"><strong>Viewing, downloading, and deleting archived projects</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can find those archived projects that you’re authorized to access in the <strong>Projects</strong> → <strong>Archive</strong> menu. A search function is available. Furthermore, to improve the overview, the archived projects can be grouped and sorted with the help of a folder system just like the one for projects in the project list. These, however, are two separate hierarchies: The folder system in the archive is set up independently of the folders in the project list.</p>\n<p class=\"wysiwyg-text-align-justify\">Using the familiar “Actions” checkboxes and the drop-down list below the table, you can apply the following actions to several projects at once: </p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Change folder: Enables you to move the projects selected into a target folder to be defined.</p>\n</li>\n<li>\n<p>Delete result data: By clicking on this icon, you can delete the zip file with the result data. Only when you previously saved the zip file locally, is it subsequently possible to upload and reactivate the project with result data. It is not possible to delete projects from the archive.</p>\n</li>\n<li>\n<p>Delete projects: Allows to remove the projects selected. Please note that the deletion process cannot be reversed. Project and result data from deleted projects can no longer be reconstructed.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following editing functions can be used to edit individual projects:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Preview</strong>: You can view the questionnaire of an archived project.</p>\n</li>\n<li>\n<p><strong>Download</strong>: By clicking on this icon you can download and store the zip file locally on your PC. The information contained within this file is not for viewing files outside of the project and therefore you should never try to open the data: They merely serve the purpose of local storage for security reasons. Therefore downloading only makes sense, if you continue to store the project in the archive of the <em>EFS</em> installation so that you can upload the data and reactivate the project later.</p>\n</li>\n<li>\n<p><strong>File upload</strong>: This icon becomes visible when the zip file with the result data has been deleted (for example in the above figure in the project “Website Check). If the zip file was saved externally, then this icon enables you to upload it again.</p>\n</li>\n<li>\n<p><strong>Reactivating</strong></p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The downloaded data is not a backup copy of the entire project, and cannot be viewed outside of EFS or recreated using an import function.</p>\n<p class=\"wysiwyg-text-align-justify\">Pay careful attention that you upload the correct file, otherwise reactivation of the project will not be possible. Should you upload the wrong zip file, delete it first by clicking on the <strong>Delete</strong> button, and then upload the correct file.</p>\n<h3 id=\"reactivating-archived-projects\" class=\"wysiwyg-text-align-justify\"><strong>Reactivating archived projects</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">When you click on the Reactivate icon you are given two options:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>reactivate with result data</p>\n</li>\n<li>\n<p>reactivate without result data</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If the zip file with result data has been deleted, the only option available is “Reactivate without result data”.</p>\n<p class=\"wysiwyg-text-align-justify\">The following applies to reactivation processes as well as to the archiving of projects: Firstly the process can take a very long time. Secondly, some of the database tables are blocked during the reactivation process, so it is not possible during reactivation to participate in a survey. Therefore it is also recommended that reactivating is done during phases of low traffic, i.e. at night.</p>\n<h2 id=\"split-button-new-project\" class=\"wysiwyg-text-align-justify\"><strong>Split-Button: + New project</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">After logging in, the start page is opened. Here, you see at first glance current <em>EFS</em> news, an overview of currently active surveys in the field and remaining time, and shortcuts to the surveys you are currently working on, with details on the project status.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226441106\" alt=\"Starting project.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">You will create your first survey by clicking on the <strong>+ New project</strong> button.</p>\n<h3 id=\"creating-projects\" class=\"wysiwyg-text-align-justify\"><strong>Creating Projects</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Open the functional area <strong>Projects</strong>. Open the drop-down list of the <strong>+ New project</strong> split button. Click on the main field or select the option “New project” to create a new survey. To import an existing survey from your PC, select the option “Import project”. To adopt a sample survey from the survey library, select the option “Survey library”.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226444050\" alt=\"Create project.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Enter the survey title.</p>\n</li>\n<li>\n<p>Select the project type. (Exception on Panel installations: If you select “forum discussion”, the dialog shown above will be replaced automatically by the list of required forum topic properties.)</p>\n</li>\n<li>\n<p>Select the appropriate layout template. <strong>It is not possible to switch between the layout generations.</strong></p>\n</li>\n<li>\n<p>Select the appropriate folder</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226446226\" alt=\"Advanced options.jpg\"></p>\n<p class=\"wysiwyg-text-align-justify\">In the “Advanced options” area, you can make further adjustments to the settings:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p><strong>Teams</strong>: The selected user teams receive access to the project. The teams, in which you are a member, are displayed in a select box, and your primary team is pre-selected. Your primary team always gets read and write rights on the newly created project automatically. If you belong to a team with write rights to the ACL right “group admin”, you can assign all teams in the installation of the “Admingroup” type with read and write rights to the project.</p>\n</li>\n<li>\n<p><strong>Survey messages</strong>: A set of survey messages that already exist in the library is uploaded.</p>\n</li>\n<li>\n<p><strong>Author, Coauthors</strong>: enter the names of the persons involved in these fields.</p>\n</li>\n<li>\n<p><strong>Description</strong>: This field allows storage of information on the survey (e.g. content and purpose of the project).</p>\n</li>\n<li>\n<p><strong>Error notification</strong>: EFS features a runtime check for checking the conditions of LUA filters, quotas and triggers in the course of the survey. Optionally, you can subscribe to e-mail notifications which are sent whenever a participant causes this kind of error. To do so, enter a list of users to be notified. Each row should contain only one address.</p>\n</li>\n<li>\n<p><strong>Mail template for “Notification before end of survey”</strong>: This mail template is used for the notification described below. You can choose among mail templates of the “Notification before end of survey” type. If you do not select a template resp. if you cannot select one due to missing rights, a mail with default text will be used.</p>\n</li>\n<li>\n<p><strong>“Notification before end of survey”</strong>: You can have an e-mail notification sent to you before the end of the field period of a survey. The emails will be sent seven days before the end of the project. Enter a list of the users who are to receive an e-mail. In each row, there should be only one address.</p>\n</li>\n<li>\n<p><strong>Which status is to be applied after creating the project?</strong>: You can choose between the statuses “survey compiled” and “active”.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Confirm by clicking on <strong>Create</strong>.</p>\n<p class=\"wysiwyg-text-align-justify\">Your choice of project type, layout template, team, and survey message for a new project is stored and will be used for presetting the dialog next time you create another project. In the menu <strong>Options</strong> → <strong>Personal preferences</strong> → tab <strong>Projects</strong>, you can preset more settings of new projects according to your working habits.</p>\n<h3 id=\"project-types\" class=\"wysiwyg-text-align-justify\"><strong>Project Types</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In EFS, feedback collection is organized into individual projects. The features and processes required in these projects depend strongly on the data collection method and the target group chosen. Therefore, the various <em>EFS</em> solutions support quite different project types.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Anonymous Surveys (AN)</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><em>Anonymous surveys</em> are accessible for all who know the respective survey Internet address. This is usually conducted by means of advertising efforts such as banners or hyperlinks on existing websites.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Personalized Surveys (PE)</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><em>Personalized surveys</em> are only accessible to persons included in the survey sample. In a personalized survey, you can precisely define who you wish to include as participants in your online survey. You may either enter participants manually or import the list of participants into<em> EFS</em> in an Excel sheet (CSV file). There are various options for how to restrict access to the survey. For example, using a password sent to the participants via e-mail, or via a personalized link or definable IP addresses. The respective passwords for participants can be either generated within<em> the EFS Survey</em> or imported into the system.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Employee Surveys (ES)</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The project-type Employee survey is used only on <em>EFS Employee</em> installations. It satisfies particularly strict data protection guidelines and allows access to the optionally available additional tool Org Processor.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Multi-Source Feedbacks (MSF)</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><em>Multi-source feedbacks</em> allow us to realize complex multi-rater feedback processes, e.g. 360° leadership surveys.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Panel Surveys (PA)</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><em>Panel surveys</em> are answered by persons registered as participants within your panel. In order to perform panel surveys you must generate groups in the People module. Samples are then drawn from these groups for the survey project of your panel.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Master Data Surveys (MD)</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The project-type <em>Master data survey</em> is also closely connected with the panel. Master data are basic information collected on panel members at the beginning of panel membership. In addition to socio-demographic details, such as income and occupation, you can collect as much information as required, depending on the interests of the panel operator. The master data survey is usually the first survey to be completed by each panelist, following registration.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Forum Discussions (FD)</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The <em>forum discussion</em> is one of the most frequently used qualitative feedback collection methods. It is strongly used, in particular, in Insight Communities. Therefore, a dedicated project-type <em>Forum discussion</em> is available. In analogy to the familiar survey projects, you can create forum discussions as separate projects and organize them via the Projects menu.</p>\n<h3 id=\"changing-the-project-type\" class=\"wysiwyg-text-align-justify\"><strong>Changing the Project Type</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Retrospective changing of the project type is restricted to anonymous and personalized projects. I.e. you can change an anonymous survey into a personalized survey and vice versa. However, due to various restrictions, changing the project type is usually only sensible if the project has only just been created or if you have copied an old project to reuse the questionnaire.</p>\n<p class=\"wysiwyg-text-align-justify\">The following restrictions apply:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>If a personalized project is converted to an anonymous project, all settings and contents of participant administration are lost.</p>\n</li>\n<li>\n<p>All result data already available will be deleted in the process.</p>\n</li>\n<li>\n<p>Reports which have been configured and/or generated in Reporting will be deleted irrevocably.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">To change the project type, open the <strong>Survey menu</strong> and click on the <strong>Change</strong> icon in the “Project type” field. This brings you to the dialog where you can change the project type. <em>Employee surveys</em>, <em>Multi-source feedback</em>, <em>Panel surveys</em>,<em> Master data surveys,</em> and <em>Forum discussions</em> cannot be converted into any other project type.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To re-use a questionnaire in a project type that does not allow a conversion, please use page import.</p>\n</li>\n</ul>\n<h3 id=\"copying-projects\" class=\"wysiwyg-text-align-justify\"><strong>Copying Projects</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">You can create copies of projects at any time. Projects may also be copied if you possess read rights. Users with read rights only may edit copied projects, but never original projects.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Contents of questionnaires, layout settings and general project attributes will be copied.</p>\n</li>\n<li>\n<p>A change of the project type during the copying process is restricted to anonymous and personalized projects.</p>\n</li>\n<li>\n<p>The decision for a layout generation and version made in the source project - i.e. \"Responsive Layout 3\", “Responsive Layout 2”, “Responsive Layout 1” or classic system layout - will be transferred when copying. A switch in the copied project is not possible.</p>\n</li>\n<li>\n<p>Result data that already exist, sample definitions (e.g. contents of participant administration in personalized projects), user-defined export templates, and generated reports will not be copied.</p>\n</li>\n<li>\n<p>When copying survey projects, already existing report definitions in <em>EFS Reporting +</em> will be copied as well. But please note that the result data shown in the reports will not be transferred, nor will generated report files be copied: use the data update feature instead to import the results of the new project.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the functional area <strong>Projects</strong> functional area.</p>\n</li>\n<li>\n<p>Select the project you wish to copy from the project list and click on the <strong>Copy</strong> icon.</p>\n</li>\n<li>\n<p>The familiar entry dialog for creating projects is opened, preset with the data of the source project.</p>\n</li>\n<li>\n<p>In the “Project type” select box, choose the project type for the survey copy. Please mind the restrictions.</p>\n</li>\n<li>\n<p>Enter the project title, description, author, and coauthors and specify the access for the team in the “Which teams shall receive full access” select box.</p>\n</li>\n<li>\n<p>Click on <strong>Create</strong> to create a copy of the selected project.</p>\n</li>\n</ul>\n<h3 id=\"transferring-projects-to-other-efs-installations\" class=\"wysiwyg-text-align-justify\">\n<strong>Transferring Projects to Other </strong><em><strong>EFS</strong></em><strong> Installations</strong>\n</h3>\n<p class=\"wysiwyg-text-align-justify\">Projects can be exported and subsequently re-imported into<em> EFS</em> system via a dedicated import interface. This function is used, in particular, when it is necessary to move a project to another <em>EFS</em> installation. In addition to the basic questionnaire structure, you can optionally export the following data:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>all existing subdirectories: /images, /images, /layout, /templates, /CSS</p>\n</li>\n<li>\n<p>all images of the overall media library</p>\n</li>\n<li>\n<p>user-defined container templates</p>\n</li>\n<li>\n<p>reports: Reports created with the traditional EFS Survey reporting, including already generated reports.</p>\n</li>\n<li>\n<p>survey results: If you have read right to “export_with_lfdn”, you may optionally include the result data.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Before you start please note:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>The XML format used is a mere exchange format, e.g. it can be used only for transferring projects to another EFS installation or for archiving questionnaires.</p>\n</li>\n<li>\n<p>Projects can only be imported to target installations that have the same <em>EFS</em> version or a higher, newer version than the source installation of the project. It is not possible to downgrade projects via export/import, e.g. by importing a 10.0 project to a 9.0 installation.</p>\n</li>\n<li>\n<p>A change of the project type during the import process is restricted to anonymous and personalized projects.</p>\n</li>\n<li>\n<p>The decision for a layout generation and layout version made in the source project - i.e. \"Responsive Layout 3\", “Responsive Layout 2”, “Responsive Layout 1” or classic system layout - will be transferred when exporting. A switch during import is not possible. </p>\n</li>\n<li>\n<p>The project type of the source project as well as any possible extensions used in this project should also be available in the destination installation. For example, a project of the „panel survey“ type can only be imported without data loss into an <em>EFS</em> Panel installation, i.e. an installation that supports this project type.</p>\n</li>\n<li>\n<p>The file size for importing data is limited: the installation-specific threshold value is displayed in the import dialog. Before importing, please ensure that your file does not exceed the threshold. If your file is too big, please contact Questback's Support.</p>\n</li>\n<li>\n<p>It is not possible to export or import forum discussions.</p>\n</li>\n<li>\n<p>Read rights for “import_project” are required for using the import function.</p>\n</li>\n</ul>\n<h3 id=\"exporting-a-project\" class=\"wysiwyg-text-align-justify\"><strong>Exporting a project</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To save a project on the local server, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Starting from the Projects functional area, open the appropriate project and go to the <strong>Export</strong> menu.</p>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21017226447634\" alt=\"Transferring a project.jpg\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Select the “Project” export option and confirm with <strong>Continue</strong>.</p>\n</li>\n<li>\n<p>Define if and which additional data should be included in the export.</p>\n</li>\n<li>\n<p>Save the file locally on a volume of your computer as an XML file with the file extension “gpx”.</p>\n</li>\n</ul>\n<h3 id=\"importing-a-project\" class=\"wysiwyg-text-align-justify\"><strong>Importing a project</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">To import a project that was exported as described above into the same or another <em>EFS</em> installation in the<em> EFS</em>-specific XML format, please proceed as follows:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Switch to the functional area Projects again, open the<strong> + New project</strong> split button and select “Import project”.</p>\n</li>\n<li>\n<p>Enter the survey title.</p>\n</li>\n<li>\n<p>To select the project file, click on <strong>Browse</strong>. Choose the .gpx file from the local drive or the network and click on the <strong>Open</strong> button.</p>\n</li>\n<li>\n<p>Select the appropriate project type.</p>\n</li>\n<li>\n<p>Specify which user teams are to receive access to the project.</p>\n</li>\n<li>\n<p>Select the appropriate folder.</p>\n</li>\n<li>\n<p>Click on <strong>Send file</strong> to import the selected project.</p>\n</li>\n<li>\n<p>If the import is successful, the following message will appear: “Project will be imported!”. You can select and edit the project in the project list.</p>\n</li>\n</ul>\n<h2 id=\"survey-menu\" class=\"wysiwyg-text-align-justify\"><strong>Survey Menu</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">When you are taken from the project list to a particular project, the Survey menu opens. It is the starting point for all work performed on a created project. Here you can, for example, specify the project properties, edit the layout of the survey, and add new pages and questions in the questionnaire editor. Opening the menu automatically displays the Project information in the content area. It provides you with:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Information on the most important project data, such as project type, field period, and status</p>\n</li>\n<li>\n<p>The option of using macros to automate work steps</p>\n</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRTLXJG9QXQXCQXD1XS\" class=\"wysiwyg-text-align-justify\">How do I organize projects into folders?</h3>\n<p class=\"wysiwyg-text-align-justify\">You can organize projects into folders by creating new folders, editing existing ones, and moving projects between folders. Use the \"Change folder\" action to move projects, and the folder management options to create or edit folders.</p>\n<h3 id=\"h_01HGKSMPRTMXJG9QXQXCQXD1XT\" class=\"wysiwyg-text-align-justify\">Can I change the project type after creation?</h3>\n<p class=\"wysiwyg-text-align-justify\">Project-type changes are limited to conversions between anonymous and personalized surveys. Other project types cannot be converted. Be aware that changing project types may result in the loss of certain data.</p>\n<h3 id=\"h_01HGKSMPRTNXJG9QXQXCQXD1XU\" class=\"wysiwyg-text-align-justify\">How do I archive a project?</h3>\n<p class=\"wysiwyg-text-align-justify\">To archive a project, select it from the project list and use the \"Archive projects\" action. Alternatively, you can archive a single project from the Survey menu using the Archive link in the To-do field.</p>\n<h3 id=\"h_01HGKSMPRTPXJG9QXQXCQXD1XV\" class=\"wysiwyg-text-align-justify\">Can I transfer projects between different EFS installations?</h3>\n<p class=\"wysiwyg-text-align-justify\">Yes, you can transfer projects between EFS installations by exporting the project as a .gpx file from the source installation and then importing it into the target installation. Ensure that the target installation has the same or a newer version of EFS.</p>",
    "user_segment_ids": []
}