{
    "id": 20370806049810,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20370806049810.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20370806049810-Container-depot",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234458963474,
    "created_at": "2024-07-25T16:30:22Z",
    "updated_at": "2024-08-19T19:54:14Z",
    "name": "Container depot",
    "title": "Container depot",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-29T08:27:48Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides information about container depots in questionnaire creation, including depot questions, text elements, and the codebook. It explains how to create and reference depot questions, manage text elements for multiple languages, and understand the codebook's role in survey analysis.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">Container depots are essential tools for efficiently managing recurring questions in surveys. This article focuses on the creation and use of depot questions, managing text elements, and understanding the codebook for survey analysis.</p>\n<ul>\n<li><a href=\"#depot-questions\">Depot questions</a></li>\n<li><a href=\"#text-elements\">Text elements</a></li>\n<li><a href=\"#codebook\">Codebook</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h2 id=\"depot-questions\" class=\"wysiwyg-text-align-justify\">Depot questions</h2>\n<p class=\"wysiwyg-text-align-justify\">Depot questions significantly facilitate the creation of questionnaires. If a specific question is used repeatedly in your questionnaire, you can define a depot question and reference it on all appropriate pages. This may be useful, for example, if identical demographic data are queried in several filter branches. Variables are created only for the depot question. The reference questions do not have dedicated variables, but refer to the variables of the respective depot question. This simplifies, among others, filter conditions referring to the repeatedly-occurring question. If you have to change these frequently recurring questions, it is not necessary anymore to edit each of them individually: the need to bet is that changes to the depot question directly affect all other reference questions based thereon.</p>\n<p class=\"wysiwyg-text-align-justify\">Please note that <em>Reporting+</em> does not support depot questions and reference questions.</p>\n<h3 id=\"creating-depot-questions\" class=\"wysiwyg-text-align-justify\">Creating depot questions</h3>\n<p class=\"wysiwyg-text-align-justify\">A questionnaire contains two branches which will be passed by different participant groups. In each branch, the same demographic data are queried. To avoid having to enter these demographic questions twice, use depot questions.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>To create the depot question, click on the<strong> Container Depot</strong> menu item.</p>\n</li>\n<li>\n<p>Enter the title (e.g. “Gender”) and type of the depot question.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Then, enter the question text and answer options in the standard question view as usual.</p>\n</li>\n</ul>\n<h3 id=\"referencing-a-depot-question\" class=\"wysiwyg-text-align-justify\">Referencing a depot question</h3>\n<p class=\"wysiwyg-text-align-justify\">You want to use the question defined in the depot on every page of the survey.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Open the page “Demographics 1” in the first filter branch.</p>\n</li>\n<li>\n<p>Enter a suitable question title and select question type “921 - Reference question” from the question types list.</p>\n</li>\n<li>\n<p>In the following entry dialog, first select the question component to be shown, i.e. the question “Gender”.</p>\n</li>\n<li>\n<p>If you wish to assume the whole question from the depot, click directly on <strong>Save</strong>. If, instead, you wish to change the question text, enter the desired text in the lower field: it will be combined with the answer options of the depot question.</p>\n</li>\n<li>\n<p>You have now created a reference question on the page “Demographics 1”, which is based on the depot question “Gender”. To reference the depot question “Gender” from the page „Demographics 2“ in the second branch as well, repeat the procedure. Then, you can create additional depot questions and reference them in both filter branches, too.</p>\n</li>\n</ul>\n<h2 id=\"text-elements\" class=\"wysiwyg-text-align-justify\">Text elements</h2>\n<p class=\"wysiwyg-text-align-justify\">Under the<strong> Text Elements</strong> menu item you edit the text elements of the questions available under the menu item Questions of the <strong>Container Depot</strong>. This is how you create translations for the various survey languages for the questions listed here.</p>\n<h2 id=\"codebook\" class=\"wysiwyg-text-align-justify\">Codebook</h2>\n<p class=\"wysiwyg-text-align-justify\">The codebook contains an overview of all variables and all encodings used in a project. I.e. it shows which memory locations have been created for your questions and how the answers have been encoded. The codebook is used, for example, whenever you want to incorporate control information into your survey, e.g. when setting filters or defining triggers, and when analyzing the survey results.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"faq_reporting_plus\" class=\"wysiwyg-text-align-justify\">Does Reporting+ support depot questions and reference questions?</h3>\n<p class=\"wysiwyg-text-align-justify\">No, Reporting+ does not support depot questions and reference questions.</p>\n<h3 id=\"faq_advantages\" class=\"wysiwyg-text-align-justify\">What are the advantages of using depot questions?</h3>\n<p class=\"wysiwyg-text-align-justify\">Depot questions simplify questionnaire creation by allowing you to define a question once and reference it multiple times. This reduces redundancy, simplifies maintenance, and ensures consistency across the survey.</p>\n<h3 id=\"faq_text_elements\" class=\"wysiwyg-text-align-justify\">How do text elements help with multilingual surveys?</h3>\n<p class=\"wysiwyg-text-align-justify\">Text elements allow you to create translations for various survey languages for the questions listed in the Container Depot, making it easier to manage multilingual surveys.</p>",
    "user_segment_ids": []
}