{
    "id": 20371086833938,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20371086833938.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371086833938-Getting-Started-Familiarizing-Yourself-with-the-CMS",
    "author_id": 369584192734,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234598507282,
    "created_at": "2024-07-25T16:52:26Z",
    "updated_at": "2024-08-28T10:01:56Z",
    "name": "Getting Started: Familiarizing Yourself with the CMS",
    "title": "Getting Started: Familiarizing Yourself with the CMS",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-07-30T09:29:32Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01HGKSMPRS9JVGC6E9EA3DB98K\" class=\"wysiwyg-text-align-justify\">Overview</h1>\n<p class=\"wysiwyg-text-align-justify\">This article provides a comprehensive guide on familiarizing yourself with the Content Management System (CMS) of the EFS Panel. It covers the panel website from both a visitor's and panelist's perspective, explains how to edit the panel website, and offers guidance on planning panel sites.</p>\n<h1 id=\"h_01HGKSMPRSYYE7GMM7DZ0VCKXK\" class=\"wysiwyg-text-align-justify\">Information</h1>\n<p class=\"wysiwyg-text-align-justify\">This guide focuses on introducing users to the EFS Panel's CMS, including navigating the admin area, understanding website structure, and creating new panel pages. It also covers the planning process for setting up new panel sites.</p>\n<ul>\n<li><a href=\"#the-panel-website-from-a-participant-s-perspective\">The Panel Website From a Participant’s Perspective</a></li>\n<li><a href=\"#editing-the-panel-website\">Editing the Panel Website</a></li>\n<li><a href=\"#panel-site-structure\">Panel Site Structure</a></li>\n<li><a href=\"#planning-panel-sites\">Planning Panel Sites</a></li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">This chapter will help you familiarize yourself with EFS Panel’s Content Management System.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You will be taking a look at the standard panel from the perspective of an interested visitor and that of a panelist who has logged in.</li>\n<li>In the admin area, you will get an overview of the existing websites and language versions and familiarize yourself with the Website Editor.</li>\n<li>You will create a new panel page.</li>\n<li>References to detailed descriptions in later chapters of the manual give you an insight into the versatility and power of the CMS.</li>\n</ul>\n<h2 id=\"the-panel-website-from-a-participant-s-perspective\" class=\"wysiwyg-text-align-justify\"><strong>The Panel Website From a Participant’s Perspective</strong></h2>\n<h3 id=\"what-do-interested-visitors-see\" class=\"wysiwyg-text-align-justify\"><strong>What Do Interested Visitors See?</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The online panel platform can usually be accessed at <span class=\"nolink\"><span class=\"nolink\">http://www.your-domain.com</span></span></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>On the start page, visitors are welcomed and introduced to the panel.</li>\n<li>Interested visitors can view further information, e.g. on the panel’s operator or the rules of participation, using a menu, a navigation bar, or links.</li>\n<li>Visitors wishing to participate in the panel can open a registration form and register.</li>\n<li>Visitors already registered as panelists can log in.</li>\n</ul>\n<h3 id=\"what-do-logged-in-panelists-see\" class=\"wysiwyg-text-align-justify\"><strong>What Do Logged-in Panelists See?</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">After login, panelists can access the password-protected internal panel area.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Panelists are greeted by name on the personal homepage. This page usually contains a list of surveys the respective panelists can participate in.</li>\n<li>The panelists can access restricted information, such as news or survey evaluations.</li>\n<li>The panelists can view their personal data (e.g. address data, account balance).</li>\n<li>They can take action themselves, e.g. change their registration data, redeem bonuses, or invite friends.</li>\n</ul>\n<h2 id=\"editing-the-panel-website\" class=\"wysiwyg-text-align-justify\"><strong>Editing the Panel Website</strong></h2>\n<h3 id=\"finding-your-way-around-the-efs-panel-admin-area\" class=\"wysiwyg-text-align-justify\"><strong>Finding Your Way Around the EFS Panel Admin Area</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The EFS Panel’s admin area is protected by personalized login. This can usually be accessed at http://www.your-domain.com/www/</p>\n<p class=\"wysiwyg-text-align-justify\">After logging in, you will see the start page of the admin area which provides an overview of the panel and the projects in progress:</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069544594\" alt=\"image2024-1-15_11-44-51.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">The navigation bar in the upper section of the screen contains links to the various modules. The Content Management System (CMS) and further functions for editing the panel website(s) are located in the <strong>Website</strong> module.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039518994\" alt=\"image2024-1-15_9-54-29.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Information</p>\n<p class=\"wysiwyg-text-align-justify\">If you lack the rights required to view or edit a function in the<strong> Website</strong> module, please contact support.</p>\n<p class=\"auto-cursor-target wysiwyg-text-align-justify\"> </p>\n<h3 id=\"websites-and-language-versions\" class=\"wysiwyg-text-align-justify\"><strong>Websites and Language Versions</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Open the <strong>Website</strong> menu. This takes you to the website overview. Here you can see all the websites and the corresponding language versions:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>A<em> language version</em> is a group of pages and functions that form a complete, self-contained external panel view in a <em>single language</em>.</li>\n<li>A <em>website</em> is a group of language versions that together form an independent online platform - i.e. <em>a panel that has been translated into several languages</em>.</li>\n<li>A website may comprise any number of language versions. Although the page structure of these language versions is identical, each version has its own set of templates. When selecting modules and configuring processes, such as registration, for example, there is significant room for language-specific variations. What’s more, not only can you take the entire website offline for maintenance purposes, but you can also do the same to individual language versions.</li>\n<li>In addition, the languages of <em>different</em> websites also have different page structures.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">Participants across websites and language versions of an EFS Panel installation are managed with the help of the same EFS Panel administration.</p>\n<p class=\"wysiwyg-text-align-justify\">A default standard panel only contains one website (“Panel Website”) with one language version (“English”).</p>\n<h3 id=\"the-website-editor\" class=\"wysiwyg-text-align-justify\"><strong>The Website Editor</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">Panel pages are edited in the <strong>Website editor</strong>. To open the website editor, click on the name of the desired language version in the overview. Alternatively, you can open the <strong>Website editor</strong> menu and select the desired website and language version via the dropdown list in the head section.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>The structure of the website editor</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The <strong>Website editor</strong> comprises the following three elements:</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Language version info: This field provides basic information on the language version. Use the drop-down list <em>to switch between website language versions</em>. Ensure that the version you want to edit is selected. This is automatically the case when you open the editor from the website overview by clicking on the desired language version.</li>\n<li>Left-hand dialog: Depending on the selected tab, this dialog contains the basic settings or the page, template, or include structure of the current language version.</li>\n<li>Right-hand dialog: This dialog contains the actual <em>editing dialog</em> of the selected page, template, or include.</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039516690\" alt=\"image2024-1-15_9-59-29.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Tree view</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The tree view displays the page structure of the language version currently opened and the various tools available for editing.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039530642\" alt=\"baumansicht.png\"></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Settings: In this dialog, you configure the properties of the language version.</li>\n<li>Pages: This tab contains the panel pages. The tree view displays the page structure:\n<ul>\n<li>\n<p>The panel navigation bar lists the menu items according to the order of the pages in the tree view, e.g. Home – Registration – How it works – News</p>\n</li>\n<li>\n<p>Pages located at the sublevel in the tree view are also displayed at the sublevel in the external navigation, e.g. How it works → FAQ<br><br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069554450\" alt=\"image2024-1-15_10-2-0.png\"></p>\n</li>\n</ul>\n</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>\n<p>Templates: Templates control how various data from modules and the panel database are processed and displayed on panel pages.</p>\n</li>\n<li>\n<p>Includes: Files that are incorporated e.g. in the main template. These include, for example, the CSS file, which is largely responsible for the layout of a website.</p>\n</li>\n</ul>\n<h3 id=\"adding-a-new-panel-page\" class=\"wysiwyg-text-align-justify\"><strong>Adding a New Panel Page</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In your community panel, the panelists have their blogs. As these blogs are crucial for your research, you want to provide information for potential panelists and encourage them to ask questions via a dedicated form. Assume you want to create a new panel page that will allow prospective panelists to request information material. The new page is to be entitled “Blogging”. It is to be accessible to visitors and panelists and located in the navigation bar in the submenu of “How it works”. It should contain two elements: A section with explanations of what you can do on the page, and a form for requesting information.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039527954\" alt=\"image2019-7-15_15-43-59.png\"></p>\n<h3 id=\"creating-a-new-panel-page\" class=\"wysiwyg-text-align-justify\"><strong>Creating a New Panel Page</strong></h3>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Open the <strong>Pages</strong> tab and then click on the <strong>+ Page</strong> button.<br><br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039525010\" alt=\"image2019-7-18_9-15-37.png\">\n</li>\n<li>\n<p>Enter the following data:<br><br>– Page identifier: The page identifier is used to uniquely identify the page within the system, regardless of language settings. It is particularly used in the browser address bar and for internal links. Therefore it should not contain any blank spaces or special characters. Enter: “blogging”.<br>– Parent page: You want to locate the page at the top level of navigation. Therefore select the following folder: “Pages → How it works”.<br>– Position: In the submenu of “How it works”, you want to place the page “at the beginning”.<br>– Internal page name: Name of the page in the tree structure. If you are editing a website with several language versions, you can choose a different name for each version. Enter: “Blogging”.<br>– Main template: This is the main template that defines the overall page structure. Select “main_default”.<br>– Positioning template: The template allows you to change the default position of content elements. This is not necessary for new sample pages.<br>– HTML title: Title used in the browser, the navigation, and in the breadcrumb. Enter: “Blogging”.<br>– Access control: You do not wish to restrict access, all interested visitors and panelists are to have access. Therefore select “Public”. Show in navigation: You want the new page to always be visible in the navigation bar. Therefore select “Always”.<br>– Meta keywords: In this field, you can enter keywords someone using a search engine would expect to find the page under. This field is optional so leave the sample page empty.<br>– URL Alias (previously: “Page name for URL”): Optionally definable page name that may be used to create a search engine friendly URL in the current language version. Leave this field blank.</p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The page is created and the tree view is updated. You are taken to the <strong>Page Modules</strong> tab in the editing dialog for the new page.</p>\n</li>\n<li>\n<p>Select the preview mode <strong>Offline version</strong> to display the new page.</p>\n</li>\n</ol>\n<h3 id=\"adding-content-and-functional-elements\" class=\"wysiwyg-text-align-justify\"><strong>Adding Content and Functional Elements</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">In the next step, add content and functional elements to the page. The structure we want to create is simple: In the upper section, you want to explain to the visitors what they can use the form in the lower section for. To do so, use the “Headline + text” module. You can create an information request form using the “Contact form” module in the lower section.</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>On the Page Modules tab, click on the <strong>+ Page module</strong> button.</li>\n<li>Enter the following:<br><br>– Type: You can choose from various modules in the drop-down list. Select “Content module: Heading + text”.<br>– Reference name for template: This name allows you to trigger the module from a positioning template, something which is, however, not necessary in the example. Keep the text that is automatically preset as it is: “module_blogging_1”.<br>– Page module title: This is the internal title of the module. For this example enter: “Blogging introduction”.<br>– Module template: Data output is controlled using a module-specific template. Select the “cont_headline_text” template, which belongs to this content module.<br>– In the “Position” field, choose the default setting “at the beginning”.<br><br>\n</li>\n<li>\n<p>Click on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>The options for the “Content module: Heading + text” module will be displayed. Fill in the following details:<br><br>– Headline: This headline is displayed as the section title on the panel page. Enter: “Blogging”.<br>– Text: This field contains the actual text. Enter a sample text.<br><br></p>\nInformation\n<p>You can use HTLM formatting in the text fields, for example, to highlight a word in bold or italics. Use the &lt;br&gt; or &lt;br /&gt; tags to create line breaks. In fields marked with “Smarty code”, you can use Smarty.</p>\n<p class=\"auto-cursor-target\"> </p>\n</li>\n<li>\n<p>Confirm by clicking on <strong>Save</strong>.</p>\n</li>\n<li>\n<p>Select the preview mode <strong>Offline version</strong> to preview the changes.</p>\n</li>\n<li>\n<p>The next step is to create the contact form section. Open the <strong>Page Modules</strong> tab again.</p>\n</li>\n<li>\n<p>Click on the <strong>+ Page</strong> module.</p>\n</li>\n<li>\n<p>Enter the following:<br><br>– Type: “Function module: Contact form”.<br>– Reference name for template: “module_blogging_2”.<br>– Page module title: “Blogging questions”.<br>– Module template: “func_contact_form”.<br>– Position: “after Blogging_introduction”.<br><br></p>\n</li>\n<li>\n<p>Confirm by clicking on<strong> Save</strong>.</p>\n</li>\n<li>\n<p>The options for the “Function module: Contact form” module will be displayed. Fill in the following details:<br><br></p>\n<p>– Mail sender: The e-mail address from which the contact mail is to be sent. You can either use a fixed e-mail address. Please make sure that the mail account exists on a correctly configured mail server: otherwise, the e-mails may be erroneously classified as spam. Alternatively, use the wildcard #u_email# to insert the e-mail address of the panelist resp. the e-mail entered into the contact form.<br>– Message upon successful change: This message appears once the contact mail was successfully sent. Enter: “Thank you. You will receive an answer as soon as possible.”<br><br></p>\n</li>\n<li>Specify a topic users can request information on. This includes the address of the person responsible for providing feedback on the topic. In the example, these are “General information” and “info-panel@<a href=\"http://example.com\">example.com</a>”.</li>\n<li>Confirm by clicking on<strong> Save</strong>.</li>\n<li>Additionally, add the topic “Bonus points for blogging” and a corresponding address.</li>\n<li>Again, confirm by clicking on <strong>Save</strong>.</li>\n<li>Select the preview mode <strong>Offline version</strong> to preview the finished page.</li>\n</ol>\n<h3 id=\"publishing-the-panel-page\" class=\"wysiwyg-text-align-justify\"><strong>Publishing the Panel Page</strong></h3>\n<p class=\"wysiwyg-text-align-justify\">The new page is not yet accessible to the public: Up to now you have been working with a so-called working version. This is indicated by the status icon in the tree view:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Grey status icon: The page has not been published</li>\n<li>Green status icon: The page has been published and is up-to-date.</li>\n<li>Blue status icon: The page is live (online), however, the internal working version has been changed in the meantime.</li>\n</ul>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Click on the <strong>Publish page</strong> to place the “Blogging” page online.</li>\n<li>Click on the <strong>Preview online version</strong> tab or open the panel website directly to preview the changes in live operation.</li>\n</ol>\n<h1 id=\"panel-site-structure\" class=\"wysiwyg-text-align-justify\"><strong>Panel Site Structure</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">This chapter shows you how to create panel pages with the help of modules and templates.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>First of all, this chapter explains how content and functions, located in a panel page’s content area, are put together with the help of modules.</li>\n<li>It also explains how the general structure of panel pages is created through the interaction of different templates.</li>\n</ul>\n<h2 id=\"panel-pages-content-area\" class=\"wysiwyg-text-align-justify\"><strong>Panel Pages’ Content Area</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">A panel page’s content area is the part that contains the actual page content: Information texts, forms, and functions. This area differs from page to page, whereas other parts, such as header and menu, remain largely consistent.</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">The introduction of this chapter already took you through the practical steps of filling a panel page’s content area in the new CMS: You choose modules that provide the desired content and functions, and assemble these modules on the page.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039523346\" alt=\"image2019-7-18_9-46-44.png\"></p>\n<p class=\"wysiwyg-text-align-justify\"><strong>A panel page’s content area in the standard panel:</strong></p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015039512594\" alt=\"image2024-1-15_10-8-19.png\"></p>\n<h2 id=\"panel-page-structure\" class=\"wysiwyg-text-align-justify\"><strong>Panel Page Structure</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Browsing the panel’s external view you will discover that the content area, which is defined with the help of modules, differs from page to page, but many other panel page components remain the same:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>The border area always looks the same.</li>\n<li>The appearance of the navigation bar and login area changes upon login but is the same on all external pages as well as on all internal pages.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069549202\" alt=\"image2024-1-15_10-25-35.png\"></p>\n<p class=\"wysiwyg-text-align-justify\">This is technically implemented with the help of the template concept: The panel pages are broken down into logical components, each of which is generated by different files (templates). The general panel page structure is defined in the main template. In this template, the components are inserted using wildcards. The Smarty template engine only dynamically replaces the data provided by the respective templates once the pages are delivered to the viewer’s browser.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Advantages of the template concept</strong></p>\n<p class=\"wysiwyg-text-align-justify\">The most important advantage of the template concept is that implementing a change, for example to the navigation bar, requires only a one-time change to the source code of the respective template. By contrast, if you were to build the panel in such a way that each page (e.g. start page, “About us” page, panelists’ personal homepage) contained the entire HTML code, a change would have to be made, for example, to the navigation bar on every single page. That is a time-consuming and error-prone process.</p>\n<p class=\"wysiwyg-text-align-justify\">Furthermore, this method of building pages with the help of several templates enables you to realize status-dependent components. For example, the navigation bar, login area, and content area may look different to visitors who have not logged in than to logged-in panelists.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Example: The structure of the “Contact Us” page</strong></p>\n<p class=\"wysiwyg-text-align-justify\">In the standard panel, a normal panel page contains the following elements, each of which is defined in separate templates:</p>\n<p class=\"wysiwyg-text-align-justify\"> </p>\n<p class=\"wysiwyg-text-align-justify\">Language selection: This field is only displayed for websites with several language versions.</p>\n<ol class=\"wysiwyg-text-align-justify\">\n<li>Navigation: The menus displayed in the navigation depend on whether or not the viewer is logged in.</li>\n<li>Messages</li>\n<li>Login: Depending on whether or not the viewer is logged in, this area contains different functions, which in turn are defined by two different templates.</li>\n<li>Content area: This is filled for each page with the help of content and function modules. Module-specific templates define how the data provided by the modules are output. The illustration shows the content of the “About Us” page.</li>\n<li>Subnavigation</li>\n</ol>\n<p class=\"wysiwyg-text-align-justify\">The main template is responsible for the general structure of the page and for inserting the various individual components into the overall context.</p>\n<p class=\"wysiwyg-text-align-justify\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21015069546386\" alt=\"image2024-1-15_10-38-18.png\"></p>\n<h1 id=\"planning-panel-sites\" class=\"wysiwyg-text-align-justify\"><strong>Planning Panel Sites</strong></h1>\n<p class=\"wysiwyg-text-align-justify\">Setting up a new panel site requires extensive preparation and planning:</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>You must determine which pages you need and what the page structure should look like.</li>\n<li>Panel sites usually have a specially designed, customized layout.</li>\n<li>A panel may have several websites, which in turn may have several language versions. Depending on how greatly the websites and language versions differ, this requires additional planning.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">The following contains tips and suggestions for planning panel sites.</p>\n<h2 id=\"planning-page-structure\" class=\"wysiwyg-text-align-justify\"><strong>Planning Page Structure</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">The following considerations should help you develop a plan for the page structure.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Which website(s) and language versions are planned?</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Do you plan on creating a single website, or do you wish to set up several websites?</li>\n<li>For each website, you must determine whether it should comprise one or several language versions.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\">If you plan on creating several language versions or even several websites each with more than one language version, we recommend going through the following tips individually for each website.</p>\n<p class=\"wysiwyg-text-align-justify\"><strong>Which pages are required?</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Which pages should the new website have? Which pages are necessary for launching the website?</li>\n<li>Which pages should visitors have access to and which should be restricted to logged-in panelists only?</li>\n<li>Which pages are required for key processes such as recruitment and incentive management? In particular, you should check whether your panel processes require additional function pages beyond those provided in the standard panel. If, for example, you wish to support both the standard admission procedure with registration via the website and targeted recruitment with access codes, you may need a second registration page.</li>\n<li>If the website you are editing comprises several language versions, are certain pages only required in one language version? Please note that a website’s page structure is identical for all language versions and does not permit major deviations.</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Navigation structure</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>How are panelists to navigate through the website: Via menus? Via links?</li>\n<li>Are one or more menus required?</li>\n<li>Which pages are to be visible for logged-in/logged-out panelists?</li>\n<li>In which order should pages be displayed in the menu?</li>\n<li>Should the menu have a second level on which subpages are displayed? Which pages are to appear on the first and which on the second level?</li>\n</ul>\n<p class=\"wysiwyg-text-align-justify\"><strong>Content and function of the individual pages</strong></p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Which content and functions should the new page have? Which page modules can be used to implement the desired functions? Are the existing functions sufficient or does a template need to be modified or newly created to realize a function?</li>\n<li>Who do you wish to grant access to a page or a certain page section: all visitors or only logged-in panelists?</li>\n<li>If the website you are editing comprises several language versions, should the page be configured differently in the various language versions or contain different content and functions?</li>\n</ul>\n<h2 id=\"drafting-a-layout\" class=\"wysiwyg-text-align-justify\"><strong>Drafting a Layout</strong></h2>\n<p class=\"wysiwyg-text-align-justify\">Usually, you will draft and realize your design for your panel or commission somebody to realize it. Of course, TIVIAN also offers custom designing of the external panel view. The following suggestions are aimed at helping you or your designer implement your layout.</p>\n<ul class=\"wysiwyg-text-align-justify\">\n<li>Which components will a page of your panel consist of?\n<ul>\n<li>Which page components do you require on all panel pages? The menu, for example, should be on all pages. All pages should also provide a section reserved for displaying error messages.</li>\n<li>Which page components must be visible for logged-in and which for logged out panelists? The login form, for example, is usually displayed to all logged out panelists on all panel pages.</li>\n<li>Are there any page components that are only to be inserted in a few selected pages? In the standard panel the quick poll, for example, is only displayed on the “Home” and “My Home” pages.</li>\n</ul>\n</li>\n<li>Are all required page components already available in the standard panel or do new templates need to be planned and created?</li>\n<li>Should the public area and the internal panelist area have entirely different or slightly different layouts?</li>\n<li>If you are setting up one website with several language versions or several websites, should the layout of the various websites and language versions differ?</li>\n</ul>\n<h1 id=\"h_01HGKSMPRSER9ENY5QWWRZZ863\" class=\"wysiwyg-text-align-justify\">FAQ</h1>\n<h3 id=\"h_01HGKSMPRW3BJ8YJVQ7XDPZ9XQJ1\" class=\"wysiwyg-text-align-justify\">What is a language version in the EFS Panel?</h3>\n<p class=\"wysiwyg-text-align-justify\">A language version is a group of pages and functions that form a complete, self-contained external panel view in a single language.</p>\n<h3 id=\"h_01HGKSMPRW8XQXQJXQJ1QXQJXQJX\" class=\"wysiwyg-text-align-justify\">How do I add a new panel page?</h3>\n<p class=\"wysiwyg-text-align-justify\">To add a new panel page, navigate to the Website editor, click on the \"Pages\" tab, then click the \"+ Page\" button. Fill in the required information, add content modules, and publish the page when ready.</p>\n<h3 id=\"h_01HGKSMPRWFZ9XQJ1QXQJXQJXQJX\" class=\"wysiwyg-text-align-justify\">What are the advantages of using templates in panel site structure?</h3>\n<p class=\"wysiwyg-text-align-justify\">Templates allow for efficient implementation of changes across multiple pages, reduce errors, and enable the creation of status-dependent components that can display different content based on user login status.</p>",
    "user_segment_ids": []
}