{
    "id": 20716962485650,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20716962485650.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20716962485650-Re-Setting-Up-EFS-Installations",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20714711445138,
    "created_at": "2024-08-12T20:01:03Z",
    "updated_at": "2024-08-27T11:15:25Z",
    "name": "Re-Setting Up EFS Installations",
    "title": "Re-Setting Up EFS Installations",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-27T11:15:22Z",
    "user_segment_id": 360000084973,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01J69RPVYWSQ1W0STJAMT1KJ7N\">Overview</h1>\n<p>When managing EFS (Enterprise Feedback System) installations, it may be necessary to reconfigure or reset the integration with Okta. This process involves disabling automatic syncs, recreating applications in Okta, and ensuring that all configurations align with the new setup requirements. This guide will walk you through the steps needed to successfully re-set up an EFS installation in Okta.</p>\n<p> </p>\n<h2 id=\"h_01J69RPVYW9D0VH3S4WJ4YSKS9\">Problem Definition</h2>\n<p>Organizations may need to reset their EFS installation due to misconfigurations, changes in application settings, or updates to group assignments. This process is critical to ensure that all users and applications are properly synced and that security settings are appropriately applied.</p>\n<p> </p>\n<h2 id=\"h_01J69RPVYW0RC66109YJ39JXJC\">Solution</h2>\n<h4 id=\"h_01J69RPVYW2V897K8817QZEGSK\">Step 1: <strong>Disable Automatic Syncs and Shut Down Questback Access</strong>\n</h4>\n<ul>\n<li>Disable all automatic syncs within the EFS installation.</li>\n<li>Shut down the Questback access module to prevent any synchronization issues during the reconfiguration process.</li>\n</ul>\n<h4 id=\"h_01J69RPVYWM7A7XCWA5W30ZR43\">Step 2: <strong>Recreate the Application in Okta</strong>\n</h4>\n<ol>\n<li>\n<p><strong>Remove the Existing Application</strong>:</p>\n<ul>\n<li>Delete the current application associated with the EFS installation from Okta.</li>\n</ul>\n</li>\n<li>\n<p><strong>Create the New Application</strong>:</p>\n<ul>\n<li>Recreate the application in Okta with the correct settings.</li>\n<li>Ensure that the application is configured with the correct name and that it is limited to one installation per app.</li>\n<li>Copy and securely store the settings for <code>clientId</code>, <code>clientSecret</code>, and <code>redirect_uri(s)</code>.</li>\n</ul>\n</li>\n</ol>\n<h4 id=\"h_01J69RPVYWHAJ7CRBBFM5GKJPF\">Step 3: <strong>Delete and Recreate Portal Applications</strong>\n</h4>\n<ul>\n<li>Delete all Okta portal applications associated with the installation.</li>\n<li>Create installation-specific groups in Okta if they are not already available. These groups will be used for application assignments.</li>\n</ul>\n<h4 id=\"h_01J69RPVYW7RAP4X025QYM3BBH\">Step 4: <strong>Clear Reference Tables in EFS</strong>\n</h4>\n<ul>\n<li>Clear the following reference tables within the EFS system:\n<ul>\n<li><strong>Panelists</strong></li>\n<li><strong>Admin users</strong></li>\n<li><strong>Portals</strong></li>\n</ul>\n</li>\n</ul>\n<h4 id=\"h_01J69RPVYWC539XHTMWCHRF4VJ\">Step 5: <strong>Update IAM Configuration</strong>\n</h4>\n<ul>\n<li>Update the IAM (Identity and Access Management) configuration in EFS with the new values:\n<ul>\n<li><code>clientId</code></li>\n<li><code>clientSecret</code></li>\n<li><code>redirectUri</code></li>\n</ul>\n</li>\n<li>Ensure that a tenant-specific API Token, created by the API User, is used for these updates.</li>\n</ul>\n<h4 id=\"h_01J69RPVYWX7ESZFASH79R2V1G\">Step 6: <strong>Trigger Migration Scripts</strong>\n</h4>\n<ul>\n<li>\n<strong>Sync Portals</strong>: Start the synchronization process for all portals.</li>\n<li>\n<strong>Sync and Assign Users</strong>: Trigger the user synchronization process and assign users to the appropriate groups and applications. Since all users should already be available in Okta, this step ensures proper assignment.</li>\n<li>\n<strong>EFS Admin and Panelists</strong>: Ensure that EFS Admins and panelists are correctly synced and assigned.</li>\n</ul>\n<h4 id=\"h_01J69RPVYWEPD67MYGKRGDNDNT\">Step 7: <strong>Re-Enable Questback Access</strong>\n</h4>\n<ul>\n<li>Once all steps have been completed and verified, re-enable the Questback access module to resume normal operations.</li>\n</ul>\n<h3 id=\"h_01J69RPVYWH3JH970VHS1SM3CP\">Summary</h3>\n<p>Re-setting up an EFS installation in Okta involves a series of steps designed to ensure that applications, users, and groups are correctly configured and synchronized. By following this guide, you can effectively manage the reconfiguration process and prevent potential synchronization issues.</p>\n<p> </p>\n<h1 id=\"h_01J69RPVYXM0YKT36BTGE2C75S\">FAQ</h1>\n<ol>\n<li>\n<p><strong>Why do I need to disable automatic syncs before reconfiguration?</strong></p>\n<ul>\n<li>Disabling automatic syncs prevents synchronization conflicts and ensures that all changes are applied correctly during the reconfiguration process.</li>\n</ul>\n</li>\n<li>\n<p><strong>What should I do if I encounter issues during the migration scripts?</strong></p>\n<ul>\n<li>Verify that all configurations in IAM and Okta are correct. Ensure that the tenant-specific API Token is being used and check for any errors in the migration logs.</li>\n</ul>\n</li>\n<li>\n<p><strong>How do I ensure that all users are properly assigned after reconfiguration?</strong></p>\n<ul>\n<li>During the user synchronization step, make sure that all users are assigned to the correct installation-specific groups in Okta to ensure proper access.</li>\n</ul>\n</li>\n</ol>",
    "user_segment_ids": [
        360000084973
    ]
}