{
    "id": 20716831431058,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20716831431058.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20716831431058-Okta-User-Management",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20714711445138,
    "created_at": "2024-08-12T19:45:35Z",
    "updated_at": "2024-08-28T15:06:48Z",
    "name": "Okta User Management",
    "title": "Okta User Management",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-28T15:06:44Z",
    "user_segment_id": 360000084973,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h1 id=\"h_01J6CQZD727JKMPP7A5BPA380N\">Overview</h1>\n<p>This guide provides an in-depth explanation of the current Okta solution used to manage multiple tenants and admins within a unified Okta organization. Given the diverse requirements and use cases across different companies, this solution is designed to efficiently handle multi-tenancy while maximizing synergies and reducing administrative overhead.</p>\n<p> </p>\n<ul>\n<li><a href=\"#header-1\">Why this solution?</a></li>\n<li><a href=\"#h_01J6CQHWCN1QBBKWTXCE6H54HP\">Manage federated Users</a></li>\n<li><a href=\"#h_01J6CQKXZAYWRX4J2VJMD6TVF6\">Manage local users</a></li>\n<li><a href=\"#h_01J6CQSXA72SE18M1J6ECW65WF\">Special users and API tokens</a></li>\n<li><a href=\"#h_01J6CQWJXN6S30P091GTAD8E7K\">Manage Groups</a></li>\n</ul>\n<p>The current Okta solution is used for all tenants as well as for admins accessing Okta itself. Thus there are a lot of users from different companies having different requirements and use cases.</p>\n<h2 id=\"header-1\">Why this solution?</h2>\n<p>An alternative to this solution would be to have multiple organizations in Okta with a more separated user base. That would make managing users in Okta a little bit simpler but has the drawback that synergies might not be used as well as if all users are in one Okta organization.</p>\n<p>Another drawback would be the orchestration of Okta organizations instead of handling multi tenancy in one Okta organization.</p>\n<p><u>Synergies are:</u></p>\n<ul>\n<li>\n<p>Configure global settings once and do not replicate across tenants</p>\n</li>\n<li>\n<p>Have one user for different tenants (especially for Tivian)</p>\n</li>\n</ul>\n<p> </p>\n<p>Group based policies and naming conventions are used to take care of different clients/tenants. also see Naming conventions in Okta</p>\n<h2 id=\"header-3\">Our user types in Okta</h2>\n<p>(Hint: There is also a construct called <em>types </em>in the the Okta API - this is not part of the current topic)</p>\n<p>Depending on the setup there are different types of users in our Okta solution (also see Federated Authentication (Federation)).</p>\n<ol>\n<li>\n<p>Installation user - <u>out of scope for Okta user management</u></p>\n</li>\n<li>\n<p>local user: A user that is stored in Okta with credentials. This user will login at Okta directly. also see Manage local users</p>\n</li>\n<li>\n<p>federated user: A user that only has a reference with some values in Okta but not the credentials. This kind of user is federated from an external Identity Provider and will login via the external Identity Provider. User Management possibilities are very limited in this case. also see Manage federated Users</p>\n</li>\n</ol>\n<p> </p>\n<h2 id=\"h_01J6CQHWCN1QBBKWTXCE6H54HP\">Manage federated Users</h2>\n<p>Federated users are users that exist only as a reference in Okta. Okta does not store any of their credentials.</p>\n<p>The user data that is stored for those users in Okta is taken from the external system during the first login to Okta. The user data is not updated once it changes in the external system.</p>\n<p>If there is a user that should be federated but it is not seen Usually Federated User is not Federated .</p>\n<p>The following table lists actions that can be done as well as the effect they cause:</p>\n<table style=\"height: 2012px;\" border=\"1\" width=\"840\" data-layout=\"wide\">\n<colgroup>\n<col style=\"width: 170.0px;\">\n<col style=\"width: 170.0px;\">\n<col style=\"width: 170.0px;\">\n<col style=\"width: 170.0px;\">\n</colgroup>\n<tbody>\n<tr>\n<th style=\"width: 206.615px;\">\n<p><strong>What</strong></p>\n</th>\n<th style=\"width: 206.615px;\">\n<p><strong>When to use</strong></p>\n</th>\n<th style=\"width: 206.615px;\">\n<p><strong>Effect</strong></p>\n</th>\n<th style=\"width: 206.684px;\">\n<p><strong>Notes</strong></p>\n</th>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Create</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Generally never because users are created via JIT (Just-in-Time creation).</p>\n<p>A federated user might be created if JIT provisioning does not work properly. This should better be done by API.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>A reference user will be created that is used to create a mapping between our Identity Provider and the external Identity Provider</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Do not send an activation mail or set a password.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Activate</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Generally never.</p>\n<p>Only users that have been suspended manually before.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>This would send out an activation mail to the user, asking him to set a password for the Okta account.<br><br>This would let the user create an additional credential set, which would just confuse the user and would never be used.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Not suitable for managed users</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Update Profile Data</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>When user data should be updated and cannot be updated via EFS or another application.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>The user data is updated in Okta. Once the user logs into an application via Okta, the user data in the application will also be updated.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Preferred way: Change data via EFS which will also update the Okta user data.</p>\n<p>Changing the email-address might break the login to applications!</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Add to Group</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Only use this if there is a special purpose group and the rules of this group should be applied to that user.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>The rules that are specific to that group are assigned to that user.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Do not add to another company group to apply rules - create a group for that.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Remove from Group</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>In cases where a group rule should not apply to that user anymore.</p>\n<p>Company groups should never be removed.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Rules that have been created for that specific user do not apply anymore.</p>\n<p>e.g. MFA, Session times, password policies</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Every user has as least one company group. These company groups should never be removed.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Reset Password</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Never</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>The user will get a confusing email about a password reset. But this password will never be used.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Not suitable for managed users</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Reset Multifactor</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>In case a user has to changed their device or misconfigured MFA.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Multifactor information is removed and the user has to enroll MFA again.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Users do not have the chance to reset MFA on their own in the current version of the project.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Suspend</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>This should be used in cases a user should not be able to login anymore. e.g. a user is not employee of a company anymore</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>A user is not able to login anymore to any Tivian application.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>A user might be part of multiple companies (e.g. panelist in one company, admin in another company). In that case suspending the user might not be desired.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Deactivate</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>This should only be used if a user is about to be removed.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>A user not able to login anymore to any Tivian application.</p>\n<p>The user will loose app and group memberships etc.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Prefer suspending users.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Delete (user has to be deactivated)</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>In case a user should not have access anymore.</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>A user is entirely removed from Okta. Login to all applications with Tivian Access enabled is not possible anymore. The user cannot be restored.</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>First deactivate the user.</p>\n<p>This can also be triggered via script - especially for bulk operations.</p>\n</td>\n</tr>\n<tr>\n<td style=\"width: 198.594px;\">\n<p>Assign Application</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>Never</p>\n</td>\n<td style=\"width: 198.594px;\">\n<p>No effect - users are assigned to all applications anyway</p>\n</td>\n<td style=\"width: 198.663px;\">\n<p>Application assignments are currently not used. Access rights are managed in the respective applications (EFS, Portals).</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p> </p>\n<h2 id=\"h_01J6CQKXZAYWRX4J2VJMD6TVF6\">Manage local users</h2>\n<p>Local users are users that exist in Okta with credentials and login via Okta. They are not stored in any external Identity Provider.</p>\n<table border=\"1\" data-layout=\"wide\">\n<colgroup>\n<col style=\"width: 170.0px;\">\n<col style=\"width: 170.0px;\">\n<col style=\"width: 170.0px;\">\n<col style=\"width: 170.0px;\">\n</colgroup>\n<tbody>\n<tr>\n<th>\n<p><strong>What</strong></p>\n</th>\n<th>\n<p><strong>When to use</strong></p>\n</th>\n<th>\n<p><strong>Effect</strong></p>\n</th>\n<th>\n<p><strong>Notes</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>Convert Local Users to Federated users</p>\n</td>\n<td>\n<p>When a user was synced without the “federated” domains set correctly the user might be synced with a local Okta password. To prevent future emails and a password in Okta, the user can be switched to federated.</p>\n</td>\n<td>\n<p>The local Okta password of the user is removed and the user can just login via federation.</p>\n</td>\n<td>\n<p><a href=\"https://support.okta.com/help/s/article/How-to-convert-Okta-user-to-Federated-provider-type?language=en_US\" data-card-appearance=\"inline\">https://support.okta.com/help/s/article/How-to-convert-Okta-user-to-Federated-provider-type?language=en_US</a></p>\n<p>This is a help Article how to do that. This could also be done by a postman collection or a script.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Reset Password</p>\n</td>\n<td>\n<p>Rarely. A user is able to reset their password in their own.</p>\n<p>If a user is not able to - this option could be used.</p>\n</td>\n<td>\n<p>The user has no password anymore and will get an activation mail. The user has to provide a new password.</p>\n</td>\n<td>\n<p> </p>\n</td>\n</tr>\n</tbody>\n</table>\n<p> </p>\n<h2 id=\"h_01J6CQSXA72SE18M1J6ECW65WF\">Special users and API tokens</h2>\n<h3 id=\"01J6CQTMPP63EYEAKNKPGN02YS\">Noreply</h3>\n<p>There is a user in Okta with the email-address “noreply@questback.com”. This user is deactivated and has to stay in exaclty that state.</p>\n<p>A user that exists in Okta is identified by it’s email address in EFS and other applications. The special address “noreply@questback.com” is used for the root user of EFS. The root user of EFS has to login via the bypass route configured in EFS. Therefore this user exists in Okta to avoid accidental login via Okta.</p>\n<p> </p>\n<h3 id=\"01J6CQTMPQHM29R2PFQCWYGSC7\">Shared users and API tokens</h3>\n<p>In general shared users should be avoided. We currently have one exception:</p>\n<p> </p>\n<h3 id=\"header-5\">Okta API User:</h3>\n<p>There is only one shared user that is not directly tied to a natural person. This is the API Token User. This user is only used for the purpose to manage API tokens for different installations.</p>\n<p>Users that are tied to persons might be removed or changed. This user can stay the same. There should be a very limited number of people having access to that user. It is only used to create new API tokens. These tokens have to be stored somewhere else.</p>\n<p>This user should never be used to fulfill any other tasks than creating and removing API tokens.</p>\n<p>Technically every admin user is able to create API Tokens but per convention only the API Token User is allowed to create tokens for production purposes.</p>\n<p> </p>\n<p>In case one shared admin user is a security issue multiple API users could be created. But they should not be tied to the account of a natural person.</p>\n<p> </p>\n<h3 id=\"header-6\">Development API Tokens:</h3>\n<p>Tokens that are used for development purposes should be tied to the person using the token so that it will be removed as soon as the person is removed.</p>\n<p> </p>\n<h2 id=\"h_01J6CQWJXN6S30P091GTAD8E7K\">Manage Groups</h2>\n<h3 id=\"01J6CQWYNW3MC0JCYR46JN0Z2K\">Global Tivian Internal Groups</h3>\n<p>There are Groups to grant Access to Okta itself. These groups are used for Tivian only. Take care that no other users are assigned to these groups. also see Okta Admin Users</p>\n<p>The following Groups are present in Okta:</p>\n<ul>\n<li>\n<p>tivian super admins</p>\n</li>\n<li>\n<p>tivian access installers</p>\n</li>\n<li>\n<p>tivian user manager</p>\n</li>\n</ul>\n<p>More groups might follow as needed.</p>\n<p>Also see: <a href=\"https://help.okta.com/en/prev/Content/Topics/Security/Administrators.htm?cshid=Security_Administrators#Security_Administrators\">https://help.okta.com/en/prev/Content/Topics/Security/Administrators.htm?cshid=Security_Administrators#Security_Administrators</a></p>\n<p> </p>\n<h2 id=\"01J6CQWYNW49WDBZ5QWRJBW52P\">Groups for clients</h2>\n<p>Every client has a group. Every user of a client should belong to that group. (also see Group Setup)</p>\n<p>Groups are the main tool in Okta to assign specific rules to a set of users. Therefore if some rules only apply to a subset of users in Okta a new group could be created. Possible use cases are MFA, sessions lifetimes, password policies and others.</p>\n<p> </p>",
    "user_segment_ids": [
        360000084973
    ]
}