{
    "id": 20998146689042,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998146689042.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998146689042-EFS-Release-Summer-2019",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 11,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:28:13Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Summer 2019",
    "title": "EFS Release Summer 2019",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:13:08Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EP7306NGJVGH053RK109H1\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Portals: Platform enhancements</a>\n<ul>\n<li><a href=\"#header-3\">Multilingual Guides</a></li>\n<li><a href=\"#header-5\">Accessibility</a></li>\n<li><a href=\"#header-6\">Portal switch</a></li>\n<li><a href=\"#header-7\">Information</a></li>\n<li><a href=\"#header-8\">Allowed Domains: Portal invitation and Groups</a></li>\n<li><a href=\"#header-9\">External participants and voting phase</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-11\">Guides enhancements (US- and ME-Guide)</a>\n<ul>\n<li><a href=\"#header-13\">Adding participants subsequently</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-15\">Team-Improvement-Guide (US-Guide)</a>\n<ul>\n<li><a href=\"#header-17\">Ask the group again</a></li>\n<li><a href=\"#header-18\">Information</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-20\">Leadership-Guide (ME-Guide)</a>\n<ul>\n<li><a href=\"#header-22\">The participant list</a></li>\n<li><a href=\"#header-23\">Created actions</a></li>\n<li><a href=\"#header-24\">Grouping phase</a></li>\n<li><a href=\"#header-25\">Deep linking: New placeholder</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-27\">Panel website: Security Enhancements</a>\n<ul>\n<li><a href=\"#header-29\">Security question for change login details</a></li>\n<li><a href=\"#header-30\">Delay sending voucher e-mail</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-32\">The EFS admin area</a>\n<ul>\n<li><a href=\"#header-34\">Table control</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"header-1\">\n<em>Portals</em>: Platform enhancements</h2>\n<p>In addition to the <em>Portal switch</em> and <em>Deep linking</em>, further features are available on the <em>Portals</em> platform. Each of the three guide types (ME, US and IDEA) can be translated into several languages. The accessibility of<em> Portals</em> has also been improved.</p>\n<h3 id=\"header-3\">Multilingual Guides</h3>\n<p>To provide <em>Guides</em> in several languages, the phrases of the <em>Guides</em> configuration must be translated. The portal languages can be selected via a drop down list.platform</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998144848274\" alt=\"Multilingual.jpg\"></p>\n<p>You will translate the labels and descriptions into the language selected via drop-down list. The globe icon indicates which labels and descriptions can be translated and the color of the icon indicates whether labels and descriptions have already been translated into the selected language.</p>\n<ul>\n<li>\n<p>Red: The label has not been translated into the selected language.</p>\n</li>\n<li>\n<p>Black: The label has been translated into the selected language.</p>\n</li>\n</ul>\n<p>On the <strong>Basic information</strong> tab, you can translate the title and the description of the guide. The <strong>Additional information</strong> can also be translated into several languages. The text of the e-mail preview, which you can find on the <strong>E-mail settings</strong> tab, can also be translated. On the <strong>Rater groups</strong> tab, you can translate the rater group name and description. On the <strong>Questionnaire</strong> tab, the descriptions of the additional questions can be translated.</p>\n<h3 id=\"header-5\">Accessibility</h3>\n<p>Further features have been implemented to improve the accessibility of <em>Portals</em>. After opening, pop-ups and dialogs will be focused directly. If the dialog does not contain input fields but buttons, the confirmation button will be focused. If the dialog contains an input field, the first available input field will be focused. If the dialogs have no interactive elements, the main content area will be focused. Dialogs can be closed by pressing the <strong>Esc</strong> key.</p>\n<p>In the guide setup, a header will be displayed so that participants and groups can be read out by the screen reader. By pressing the <strong>Return</strong> key, the result of the participant and group search is directly applied.</p>\n<p>In the detail view of the Action Ticket, you can use the <strong>Tab</strong> key to move from left to right and from top to bottom. The first element to focus will be the <strong>Close</strong> button.</p>\n<h3 id=\"header-6\">Portal switch</h3>\n<p>The <em>Portal switch</em> is used to access different portals in the exterior view. In the CMS area of <em>Portals</em>, you have to define the portals between which users can switch. From now on, the <em>Portal switch</em> can also be used via the HTML module and Javascript code.</p>\n<h3 id=\"header-7\">Information</h3>\n<p>This feature must be configured by <em>TIVIAN</em>, please contact us for further information.</p>\n<h3 id=\"header-8\">Allowed Domains: <em>Portal invitation</em> and <em>Groups</em>\n</h3>\n<p>The domains defined on the <strong>Access Permissions</strong> tab under the <strong>Allowed Domains</strong> menu item will apply to the <em>Portals</em> page modules <em>Portal invitation </em>and <em>Groups</em>. Only the e-mail addresses that have allowed domains can be used to invite participants.</p>\n<h3 id=\"header-9\">External participants and voting phase</h3>\n<p>The <em>admitted temporarily </em>status is conferred on the participants who have not been panelists yet. As soon as the voting phase starts, these participants will reveice an invitation e-mail. By clicking on the link the participants will not land on the voting page, but they will have to log on a registration page.</p>\n<h2 id=\"header-11\">Guides enhancements (US- and ME-Guide)</h2>\n<p>Participants can subsequently be added to a <em>Team-Improvement-Guide</em> and<em> Leadership Guide</em>.</p>\n<h3 id=\"header-13\">Adding participants subsequently</h3>\n<p>You can now add participants to an ongoing guide survey. The participants list has the new <strong>Add a participant</strong> button. You can search for individual panelists via e-mail address. The subsequently added participants will receive an invitation to participate in a guide, the results mail (depending on the setting selected for the guide) and the reminder mails (depending on the setting selected for the guide). The participants will be added to a group (depending on the initial setting of the guide). The participant limits still apply.</p>\n<p>It is not possible to add participants in a leadership survey if a company managed group is used.</p>\n<h2 id=\"header-15\">Team-Improvement-Guide (US-Guide)</h2>\n<p>For the <em>Team Improvement Guide</em> (US-Guide), minor improvements have been implemented to make it easier to re-start a guide wave.</p>\n<h3 id=\"header-17\">Ask the group again</h3>\n<p>The questions asked on the first guide wave will be used again if you restart this guide wave. Further questions can be added. Prerequisites are that the additional questions are available for this guide, that the additional questions have been set to active by the guide initiator, and that the previous guide wave has ended. Then click <strong>Ask this group again</strong>.</p>\n<h3 id=\"header-18\">Information</h3>\n<p>The <strong>Ask this group again</strong> button will not be displayed if the selected group is no longer available.</p>\n<h2 id=\"header-20\">Leadership-Guide (ME-Guide)</h2>\n<p>The participant list has a new e-mail delivery status:<em> pending</em>. Reports are now available in several languages and in two file formats.</p>\n<h3 id=\"header-22\">The participant list</h3>\n<p>Further improvements have been added to the participants list. The <em>pending</em> e-mail delivery status has been added. Participants are grouped and displayed according to the rater groups from which they were taken. If groups are selected, they will also be displayed as groups.</p>\n<h3 id=\"header-23\">Created actions</h3>\n<p>The number of suggestions that are created as actions on the <em>Action Board</em> depends on the votes. The following examples help to illustrate this:</p>\n<p>Each of the ten suggestions will poll 10 votes → 10 suggestions will be transferred to the <em>Action Borad</em> and 10 actions will be created.</p>\n<p>One of the ten suggestions will poll 10 votes, one suggestion will poll 8 votes, 3 suggestions will poll 5 votes and the rest of the ten suggestions will poll only one vote → 5 suggestions will be transferred to the<em> Action Board</em> and 5 actions will be created.</p>\n<p>One of the ten suggestions will poll 10 votes, one suggestion will poll 8 votes, one suggestion will poll 4 votes and the rest of the ten suggestions will poll 3 votes → the 3 suggestions will be transferred to the Action Board and will be created as actions.</p>\n<h3 id=\"header-24\">Grouping phase</h3>\n<p>During the grouping phase, related suggestions can be grouped by the guide initiator. Panelists can be invited to this grouping phase. On the <strong>E-Mail settings</strong> tab, you will select an invitation e-mail template and a reminder e-mail template.grouping</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998101388178\" alt=\"Grouping.jpg\"></p>\n<p>On the guide status page, you can access the grouping phase in order to group the releated suggestions. You will tick the suggestions you want to group.  </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998114859922\" alt=\"Merge phase.jpg\"></p>\n<p>Then you assign a title.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998147348498\" alt=\"Merge.jpg\"></p>\n<p>The suggestions can be removed from the group.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998142906642\" alt=\"Voting.jpg\"></p>\n<p>The title of the grouped suggestions is displayed on the action ticket. The detail view of the action ticket will list the all the grouped suggestions (Titel + text).</p>\n<h3 id=\"header-25\">Deep linking: New placeholder</h3>\n<p>To specifiy the Guide status page as the target page, you can use the new placeholder <em>#guide_status_link#</em> so that the guide initiator will land on this page by clicking on the link. The period of validity of the generated login code will be stored in the new placeholder and can be defined on the <strong>Settings</strong> tab. The period of validity of the generated login code can be changed using the parameters.</p>\n<p>Examples:</p>\n<ul>\n<li>\n<p><em>#guide_status_link|20m#</em> (= 20 minutes)</p>\n</li>\n<li>\n<p><em>#guide_status_link|5h#</em>   (= 5 hours)</p>\n</li>\n<li>\n<p><em>#guide_status_link|2d#</em>  (= 2 days)</p>\n</li>\n</ul>\n<h2 id=\"header-27\">\n<em>Panel website</em>: Security Enhancements</h2>\n<h3 id=\"header-29\">Security question for change login details</h3>\n<p>We have added an enhanced security feature that can be used with one or more of your panel websites.  This enhanced feature allows you to request an additional piece of information to be requested from a panellist in the event that they try to change the email address assigned to their account.  This additional security feature is NOT turned on by default, and must be requested by the customer.  Once the new security feature is enabled (upon request), your administrator(s) are able to select a master data variable as the additional piece of information the panellists needs to provide when trying to change with email address. As show in the screen shot below, the master data variable is selected, and a description that will be presented to the panellists is also added to the website.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998156875410\" alt=\"Security question new Feature.jpg\"></p>\n<p>Once enabled and configured on the individual websites <strong>Change login details</strong> module (as shown above), any panellist attempting to change their email address will need to also provide the additional master data variable as per the configuration of the website (as shown below).</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998149443602\" alt=\"Login details.jpg\"></p>\n<h3 id=\"header-30\">Delay sending voucher e-mail</h3>\n<p>In addition to this enhanced security feature, we have also added the ability in websites to set a delay when sending voucher emails to your panellists. To turn on this delay, you need to complete the <strong>Redeem</strong> <strong>points</strong> configuration for the website. You will see in this part of the website configuration there are two new fields:</p>\n<ul>\n<li>\n<p>Delay sending voucher mail: Here you can specify the delay (in hours).</p>\n</li>\n<li>\n<p>Voucher notification recipient: Here you enter the recipient's e-mail address who will receive a notification if a panellist wants to redeem points and get a voucher.</p>\n</li>\n</ul>\n<h2 id=\"header-32\">The <em>EFS</em> admin area</h2>\n<p>The table control of the <em>EFS</em> admin area has also been improved.</p>\n<h3 id=\"header-34\">Table control</h3>\n<p>The table actions <strong>Mark all entries on this page</strong> and <strong>Mark all entries found</strong> are now related to each other. If you will select <strong>Mark all entries on this page</strong>, but then you will select <strong>Mark entries found</strong>, the first selection will be deselected and all entries will be selected.</p>",
    "user_segment_ids": []
}