{
    "id": 20998187558162,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998187558162.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998187558162-EFS-Release-Spring-2019",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 12,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:29:55Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Spring 2019",
    "title": "EFS Release Spring 2019",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:11:23Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EP71YFPRMS6HJZHV9R9KZJ\">Table of Contents</h2>\n<ul>\n<li><a href=\"#header-1\">New guide type</a></li>\n<li><a href=\"#header-3\">Settings in Survey</a></li>\n<li><a href=\"#header-5\">Settings in the CMS area of Portals</a></li>\n<li><a href=\"#header-6\">Ideation-Guide-Workflow</a></li>\n<li><a href=\"#header-8\">Login code</a></li>\n<li><a href=\"#header-9\">Allowed Domains</a></li>\n<li><a href=\"#header-10\">Improvement: Ideation question type</a></li>\n<li><a href=\"#header-11\">Parallel access</a></li>\n<li><a href=\"#header-12\">Updating the participant data</a></li>\n<li><a href=\"#header-13\">Text preview</a></li>\n<li>\n<a href=\"#header-14\">Accessibility</a>\n<ul>\n<li><a href=\"#header-16\">Modal and confirmation dialog</a></li>\n<li><a href=\"#header-17\">Text box</a></li>\n<li><a href=\"#header-18\">Search for persons and groups</a></li>\n<li><a href=\"#header-19\">Menus</a></li>\n<li><a href=\"#header-20\">Slide switch</a></li>\n</ul>\n</li>\n<li><a href=\"#header-22\">Ordering Report Manager reports via Leadership Guides</a></li>\n<li><a href=\"#header-23\">Report list and task list: Org structure in the tree view</a></li>\n<li><a href=\"#header-24\">Change password</a></li>\n<li><a href=\"#header-25\">GDPR enhancements</a></li>\n</ul>\n<h2 id=\"header-1\">New guide type</h2>\n<p>The new <em>Ideation Guide</em> is a follow up tool. You can use this tool to collect suggestions for improvements. The new <em>Ideation</em> module will be used to vote on these suggestions. Those with the most votes will be added to the <em>Action Board</em>. The <em>Ideation Guide</em> workflow is divided into three phases: Starting phase, ideation phase and voting phase. Settings must be made both in <em>Survey</em> and in the CMS area of <em>Portals</em>.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998190948370\" alt=\"Ideation guide.jpg\"></p>\n<h2 id=\"header-3\">Settings in<em> Survey</em>\n</h2>\n<p>For the <em>Ideation Guide</em>, you use a <em>Personalized Survey</em> for which a questionnaire with the <em>Ideation</em> question type has been created. You must also create the <em>Ideation Trigger</em> so that the suggestions that are made will be sent to the <em>Ideation</em> module.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998223668498\" alt=\"Ideation trigger.jpg\"></p>\n<p>To configure the trigger, you have to assign a name on the<strong> Settings</strong> tab, write a short description and select an execution position. You select the source question on the<strong> Detail configuration</strong> tab, whose answers will be transferred. You have to save your settings.</p>\n<h3 id=\"header-5\">Settings in the CMS area of <em>Portals</em>\n</h3>\n<p><strong>No unwanted participations</strong></p>\n<p>Via the <strong>Access permissions</strong> menu item you can define domains to allow certain e-mail addresses. The participants whose e-mail addresses match these predefined domains can be invited by the initiator of the guide.</p>\n<p><strong>Module configuration</strong></p>\n<p>In the module configuration of the new <em>Ideation</em> module that has to be added to a page, you need to enter a heading. The link to the portal will be inserted automatically. This module is used to offer the suggestions for the voting in the external view. The <em>Guides</em> module must be added as well.</p>\n<p><strong>Guide configuration</strong></p>\n<p>Switch to the <strong>Guides</strong> sub-navigation to create and to configure the <em>Ideation Guide </em>and click on <strong>+ New Guide</strong>.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998168732690\" alt=\"The new Ideation Guide.jpg\"></p>\n<p>The three guide types (MS, US and IDEA) will be offered to you by the means of the modal and you will select the new<em> Ideation Guide</em> (IDEA). To configure the<em> Ideation Guide</em>, use the following tabs:</p>\n<ul>\n<li>\n<p>Basis information</p>\n</li>\n<li>\n<p>Additional information</p>\n</li>\n<li>\n<p>Categories</p>\n</li>\n<li>\n<p>Questionnaire</p>\n</li>\n<li>\n<p>E-Mail settings</p>\n</li>\n<li>\n<p>Settings</p>\n</li>\n</ul>\n<p><strong>Basic information and Additional information</strong></p>\n<p>Use the <strong>Basic Information</strong> tab to assign a title for the <em>Ideation Guide</em> and to write a short description of the content. You will use the <strong>Additional information</strong> tab to create further content, which can be accessed by clicking on the <strong>Further details</strong> button in the external view.</p>\n<p><strong>Categories</strong></p>\n<p>On the <strong>Categories</strong> tab, select the categories for which you want to request improvement suggestions. The categories will be displayed on the action ticket. The categories are created in<strong> Libraries. </strong>You can use the link to get there.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998176272914\" alt=\"Categories.jpg\"></p>\n<p><strong>Questionnaire and e-mail settings</strong></p>\n<p>On the <strong>Questionnaire</strong> tab, select the survey project. On the <strong>E-mail Settings</strong> tab, you will select an invitation and  a reminder e-mail templates for both the second Ideation phase, the survey phase, the ideation phase, and the voting phase. You can also select the template for the result e-mail here.</p>\n<p><strong>Settings</strong></p>\n<p>On the <strong>Settings</strong> tab, you specify the settings like period of participation. You can also specify the time when an e-mail is to be sent as a reminder before the end of each phase. You can also enable the option to send a survey reminder and a voting reminder to all participants. If you deactivate this option, the reminders will only be sent to those participants who have not participated yet.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998222751890\" alt=\"Settings.jpg\"></p>\n<p>You can allow the invitation of participants by using the e-mail addresses. You can select a company managed group. To ensure data anonymity, after activating this option, you can define the number of participations that must have taken place before the data information will be shown on the guide status page, on the voting page, and on an action ticket. After that, you can make voting settings by specifying the \"Number of possible votes per category\" and \"Number of votes to convert into actions\".</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998175751058\" alt=\"Settings 2.jpg\"></p>\n<p>You must save all the settings you made!</p>\n<h3 id=\"header-6\">Ideation-Guide-Workflow</h3>\n<p><strong>First phase: Starting phase</strong></p>\n<p>The <em>Ideation Guide</em> workflow is divided into three phases. In the first phase, the starting phase, you define the category or categories in which suggestions for improvements can be made, select participants and send out invitations.</p>\n<p><strong>Second phase: Ideation phase</strong></p>\n<p>After that the collection of suggestions will start. A survey must be completed. The phase can be started via the e-mail invitation or the guide status page.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998238168466\" alt=\"Status page.jpg\"></p>\n<p>You will also find some information about your <em>Ideation Guide</em>: the category, the start date of the guide, the phase the guide is in, the date when the phase will end, and the participations. The buttons allows you to participate in the current phase. Using the three-point menu, you can also participate in the current phase, view the participants and end the current phase.</p>\n<p><strong>Third phase: Voting phase</strong></p>\n<p>After completing the second phase, the <em>Ideation Guide</em> Questionnaire, the third phase will start, voting on the suggestions received.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998192619282\" alt=\"Voting phase blue.jpg\"></p>\n<p>Participants can tick off the suggestions. The suggestions with the most votes will be forwarded to the <em>Action Board</em>. A ticket will be created.</p>\n<h2 id=\"header-8\">Login code</h2>\n<p>Users can access a portal without prior registration. They only need to enter an e-mail address or account name in the portal registration dialog. They will receive a login code by e-mail, which immediately forwards them to the corresponding portal. There they can vote for suggestions and edit action tickets. To do this, select<strong> Login Code</strong> as the authentication type on the <strong>Access permissions</strong> tab of the <strong>Settings</strong> sub-navigation before selecting a mail template that has to contain the new placeholder #portal_access_url#. The login code will remain valid for a certain period of time.</p>\n<h2 id=\"header-9\">Allowed Domains</h2>\n<p>On the <strong>Access permissions</strong> tab of the <strong>Settings</strong> sub-navigation, you can define domains in advance to allow only the e-mail addresses for the invitation process of a guide that have the defined domains.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998220963858\" alt=\"Domains.jpg\"></p>\n<h2 id=\"header-10\">Improvement: <em>Ideation</em> question type</h2>\n<p>The<em> Ideation</em> matrix question type now has a checkable option to display other participants' suggestions that have already been made. In the free text field, you can enter a short description indicating that the suggestions have been received from other participants.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998167517842\" alt=\"Show suggestions of other participants.jpg\"></p>\n<h2 id=\"header-11\">Parallel access</h2>\n<p>To prevent erroneous behavior when using email URL checkers, the option \"Allow parallel access\" is now activated by default. This will disable blocking of concurrent requests using the same invitation code. If you disable this option, the survey sessions started with the email invitation code may be deleted as soon as the URL scanners access them for verification.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998182163346\" alt=\"Allow parallel access.jpg\"></p>\n<ul>\n<li>\n<p>The option <strong>Allow parallel access</strong> enabled by default can be found in the <strong>Project properties</strong> menu on the <strong>Login Options</strong> tab</p>\n</li>\n</ul>\n<h2 id=\"header-12\">Updating the participant data</h2>\n<p>In <em>Survey</em>, you can update participant data. You can download an update template under the <strong>Participant administration</strong> menu item. To do this, you must click on the <strong>Update participant data</strong> button and download the update template. To be able to assign the data to be updated, you must fill in the <em>u_id</em> field in the template.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998175227538\" alt=\"Update participant data.jpg\"></p>\n<p>After filling in the template, you must select the corresponding file under the \"Source\" option and click the <strong>Send file</strong> button. After the successful transfer, the data will be updated.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998188581522\" alt=\"Upload file.jpg\"></p>\n<h2 id=\"header-13\">Text preview</h2>\n<p>On the <strong>E-mail Settings</strong> tab of the <strong>Guides</strong> sub-navigation, you can provide a text for the guide initiator to show the context in which the personal message written by the guide initiators will be placed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998166690194\" alt=\"Text field.jpg\"></p>\n<p>The text preview will not be sent. There is also no obligation to fill in this field. The feature is available for all three guide types (IDEA, ME, US).</p>\n<h2 id=\"header-14\">Accessibility</h2>\n<p><em>Portals</em> (exterior view) is now equipped with an accessible navigation system. Improvements were made with regard to modals, confirmation dialogs, text fields, person and group search, menus and slide switches.</p>\n<h3 id=\"header-16\">Modal and confirmation dialog</h3>\n<p>Modals, confirmation and delete dialogs in <em>Guides</em> (setup), in <em>Groups</em> and in the <em>Task list</em> received a tab index or tab order that corresponds to the order visible within the modal or dialog. The tab index and the focus will prevent you from jumping to the page behind the opened dialog or the modal by using the tab key. The screen reader is able to detect the current position in the guide wizard and will display the corresponding information.</p>\n<h3 id=\"header-17\">Text box</h3>\n<p>When a text box will be opened, the text box immediately will receive the focus.</p>\n<h3 id=\"header-18\">Search for persons and groups</h3>\n<p>The results of the person and group searches will be presented by the screen reader. The search results can be accessed via keyboard and can be processed by a screen reader. If you focus on the search field, the screen reader displays that a combo box is available. The values of the list can be selected with the arrow keys and can be presented by the screen reader. This search function is available in the<em> Guides</em> (Setup) module and the <em>Groups</em> module.</p>\n<h3 id=\"header-19\">Menus</h3>\n<p>All menus (Burger Menu, User Menu, Three-Point Menu, Notification Menu and Sidebar) can be opened using the keyboard. The menu entries will be presented by the screen reader.</p>\n<h3 id=\"header-20\">Slide switch</h3>\n<p>The slide switches in the user menu and in the notification menu of the user profile and in the guide setup can be operated using the keyboard.</p>\n<h2 id=\"header-22\">Ordering <em>Report Manager</em> reports via <em>Leadership Guides</em>\n</h2>\n<p>The <em>Leadership Guide</em> can be used to order reports which are generated via the <em>Report Manager</em> and which you can download via the <em>Report List</em> module. To do this, you must set up the <em>Report Manager</em> connection on the <strong>Settings</strong> tab of the <strong>Guides</strong> sub-navigation by specifying the URL of the <em>Report Manager</em> installation, the access key, and the instance ID. You must then test the connection to gain access to the report definition. Only if the connection was successfully tested, you can select a report definition in the \"Report definitions\" field.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998208446354\" alt=\"Report Manager Connection.jpg\"></p>\n<p>You can order the report in the status overview of a completed <em>Leadership Guide</em> that you can find in the portal's external view. You select <strong>Order Reports</strong> from the three-point menu and select the languages of the reports to be generated. After ordering the reports and generating them via the Report Manager, you can use the <em>Report List</em> module to download the reports. As soon as the reports are available, you will be notified by e-mail. The e-mail template can be selected on the <strong>E-Mail settings</strong> tab of the <strong>Guides</strong> sub-navigation.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998191670034\" alt=\"Reports.jpg\"></p>\n<p>To download the generated reports via <em>Report list</em>, you have to select the report list type \"Guides\" within the module configuration.</p>\n<h2 id=\"header-23\">Report list and task list: Org structure in the tree view</h2>\n<p>In the past you had to enter the label or the meta name to search for specific unit. From now on, you can search for units using the tree view of the organizational structure. In the module configuration of the <em>Report list</em>, you have to tick ES Projects. Then you have to select the ES projects to be offered for selection in the module. In the external view of the <em>Report List</em> module, clicking on <strong>Select Units</strong> opens a modal that presents the tree view of the organizational structure of the selected ES project.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998182828690\" alt=\"Task list unit search.jpg\"></p>\n<p>You will have the option of changing the structure view. You can search for units by typing the meta name or label of the unit. Once the desired units was selected (multiple units can be selected), the reports available for the selected units will be displayed in the<em> Report List</em> table.</p>\n<p>In the <em>Task List</em> module, the tree view of the organizational structure is available both for assigning a task to a unit and for task overview. In this way you can not only use the tree view of the organizational structure to assign a task to a unit of the underlying ES project, but you can also use this view to search for the desired unit on the tasks overview page.</p>\n<h2 id=\"header-24\">Change password</h2>\n<p>In the portal exterior view, users change the password of the opened portal by selecting <strong>Change password</strong> in the user menu or clicking the<strong> Change password</strong> button in the user profile on the <strong>Settings </strong>tab. To avoid that users will change the password, you have to uncheck the option \"Allow users to change their password\" on the <strong>General settings</strong> tab in the CMS of <em>Portals</em>. This option is activated by default.</p>\n<p> </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998153671698\" alt=\"General settings.jpg\"></p>\n<h2 id=\"header-25\">GDPR enhancements</h2>\n<p>Under <strong>Detail view</strong> in the <strong>Statistics</strong> menu, the Participations table has two new columns that inform you if and when the consent was given. In addition, you will find the GDPR Information section there.</p>",
    "user_segment_ids": []
}