{
    "id": 20998012298514,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998012298514.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998012298514-EFS-Release-Winter-2019",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 9,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:23:43Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Winter 2019",
    "title": "EFS Release Winter 2019",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:18:24Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EP756HEQJ804K0EGVNA74F\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">TIVIAN AccessAccess</a>\n<ul>\n<li><a href=\"#header-3\">Single Sign On</a></li>\n<li><a href=\"#header-5\">Multi Factor Authentication</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-7\">The Portals platform</a>\n<ul>\n<li><a href=\"#header-9\">The new Extension Module</a></li>\n<li><a href=\"#header-10\">Guides - Monitoring</a></li>\n<li><a href=\"#header-11\">Identifier for the MySight Page Module</a></li>\n<li><a href=\"#header-12\">Push Notifications</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-14\">Enhancements for Guides</a>\n<ul>\n<li><a href=\"#header-16\">Allow Deletion of Guide Processes (ME- &amp; US-Guide)</a></li>\n<li><a href=\"#header-17\">One-time Extension of the Field Time of a Guide Process (ME- &amp; US-Guide)</a></li>\n<li><a href=\"#header-18\">One-time Sending of a Reminder E-mail (ME- &amp; US-Guide)</a></li>\n<li><a href=\"#header-19\">Predefined Dashboard Templates (US-Guide)</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-21\">Enterprise Feedback Suite</a>\n<ul>\n<li><a href=\"#header-23\">New Search Function for the Participant List</a></li>\n<li><a href=\"#header-24\">New Preview for E-mail TemplatesPreview</a></li>\n<li><a href=\"#header-25\">ID for E-mail Templates</a></li>\n<li><a href=\"#header-26\">Early Complete</a></li>\n<li><a href=\"#header-27\">Information</a></li>\n<li><a href=\"#header-28\">Disable Visual Editor in E-mail Template Configuration</a></li>\n<li><a href=\"#header-29\">Placeholder</a></li>\n<li><a href=\"#header-30\">Export and Import of all Survey Languages</a></li>\n<li><a href=\"#header-31\">Export Survey Data</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-33\">Web Services</a>\n<ul>\n<li><a href=\"#header-35\">Changing Participants and Participations</a></li>\n<li><a href=\"#header-36\">Services for Multilingual Templates</a></li>\n<li><a href=\"#header-37\">Enhanced Import Participants API</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"header-1\"><strong>TIVIAN Access</strong></h2>\n<p>To increase the security of your applications - after the implementation of the <em>Privacy Assistant</em> (GDPR) - the new <em>TIVIAN Access</em> module has been added. By the use of this module, that can be integrated into your existing SSO infrastructure, bad password habits will be mitigated. From now on, users must enter the username and password to access all the applications.</p>\n<h3 id=\"header-3\"><strong>Single Sign On</strong></h3>\n<p>Using the<em> Single Sign-On</em> function, you only need to enter a user name and a password to access both the<em> Enterprise Feedback Suite</em> and <em>Portals</em>. It is no longer necessary to store different user names and passwords to access to this applications. The participant administration has been modified. First name, last name and e-mail address are mandatory fields after activation of the <em>TIVIAN Access</em> module.</p>\n<h3 id=\"header-5\"><strong>Multi Factor Authentication</strong></h3>\n<p>Optionally, the multi-factor authentication can be added to the <em>Single Sign On</em> function. This means that in addition to entering the username and the password, you have to enter a six-digit code, which is mandatory. This code will be sent to you via authenticator apps such as the <em>Google Authenticator</em>.</p>\n<p> </p>\n<p>By default <em>TIVIAN Access</em> is disabled. So the login works as you are used to. If you want to enable <em>TIVIAN Access</em>, please contact our support team.</p>\n<h2 id=\"header-7\">\n<strong>The</strong><em><strong> Portals</strong></em><strong> platform</strong>\n</h2>\n<p>As of the winter 2019 release, the Platform <em>Portals</em> will have two new modules, namely <em>Expansion</em> and <em>Guides Monitoring</em>. In addition, minor innovations have been added. </p>\n<h3 id=\"header-9\">\n<strong>The new </strong><em><strong>Extension</strong></em><strong> Module</strong>\n</h3>\n<p>With the <em>Extension </em>module it is possible for experienced users to write a web application on a third-party system and thanks to the JavaScript Api it is possible to query information about the current Portal or the current user, to communicate between open extension modules on a single page or to query or manipulate the<em> MySight</em> module, e.g. to set certain filters in the dashboard. Together with our service layer in the backend, extensive and interactive applications can be created.</p>\n<h3 id=\"header-10\"><strong>Guides - Monitoring</strong></h3>\n<p>The <em>Guides - Monitoring</em> module has a trend display: The graph turns green, red or grey according to the development within the selected time period. Green symbolizes a positive trend, red a negative trend and grey a neutral trend. The trend tile for a guide is displayed as soon as a guide has been started. In addition, this module gives you an overview of who started and ended a guide and when. For this purpose, you assign the new <em>HR Manager</em> role to selected participants on the subnavigation <strong>Participants</strong>.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20997985641618\" alt=\"HR_Manager.png\"></p>\n<p>By clicking the <strong>Process overview</strong> button on the guide's tile of the <em>Guides - Monitoring</em> module, participants who have been assigned to this role can access the process overview in your portal.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20997998245522\" alt=\"process_overview.png\"></p>\n<p>The process overview is a tabular list which, in addition to the first name, surname and e-mail address of the participants, provides information on who started how many guides and how many of these guides were successfully or unsuccessfully completed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998014912402\" alt=\"Table.png\"></p>\n<p>The table has a search function that you can use to search for the e-mail address, first name or surname of the participants. There is also a filter that allows you to filter the list based on the process status:</p>\n<ul>\n<li>\n<p>All</p>\n<ul>\n<li>\n<p>Selected by default</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Process ended</p>\n<ul>\n<li>\n<p>The participants who have completed a process for the selected guide (successful and unsuccessful) are displayed.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Process started</p>\n<ul>\n<li>\n<p>The participants who have started a process for the selected guide will be displayed.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>Process not started yet</p>\n<ul>\n<li>\n<p>All participants who have access to this portal (according to the access authorization of their portal) and have not yet started a process will be displayed.</p>\n</li>\n</ul>\n</li>\n</ul>\n<p>Please note, that the ideation guide is not supported by Guides-Monitoring.</p>\n<h3 id=\"header-11\">\n<strong>Identifier for the </strong><em><strong>MySight</strong></em><strong> Page Module</strong>\n</h3>\n<p>To control the <em>MySight</em> page module via the Portal Api, you can assign a unique identifier in the module configuration. This identifier is appended to the DOM element of the <em>MySight</em> module. By default, no value is assigned.</p>\n<h3 id=\"header-12\"><strong>Push Notifications</strong></h3>\n<p>From now on, push notifications will no longer be delivered if users have logged off from the portal app or if the panel status of the user is <em>inactive</em>. In this way, both users and panel admins can decide whether push notifications are received.</p>\n<h2 id=\"header-14\">\n<strong>Enhancements for </strong><em><strong>Guides</strong></em>\n</h2>\n<p>The process control of the <em>Leadership-Guide</em> (ME Guide) has been improved. To present the result of your <em>Team Improvement Guide</em> (US-Guide), you are now able to use predefined dashboard templates. You can now delete a guide processes.</p>\n<h3 id=\"header-16\"><strong>Allow Deletion of Guide Processes (ME- &amp; US-Guide)</strong></h3>\n<p>In order to provide a better overview of the completed guide processes, the completed guide processes of the guide types ME- and US-Guide can now also be deleted. Therefore, on the<strong> Settings</strong> tab, you have a new option to allow the guide initator to delete guide processes.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998053312786\" alt=\"basic_settings.png\"></p>\n<p>Processes that have already ended can be deleted from your portal via the 3-point menu. Before the final deletion, a dialog window opens in which the deletion must be confirmed. Deleting guide processes means that the survey data of the associated PE-project is deleted for the corresponding guide process.</p>\n<p>This option is activated by default!</p>\n<h3 id=\"header-17\"><strong>One-time Extension of the Field Time of a Guide Process (ME- &amp; US-Guide)</strong></h3>\n<p>The guide initiator has the unique opportunity to extend the field time of an already started guide process, if you enable this setting. Thus, e.g. with moderate success of a guide survey the number of participants can be increased.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20997998915730\" alt=\"extend_the_process_once.png\"></p>\n<p>If the process is extended by the guide initiator, a last-call reminder e-mail will be sent to those participants who have not yet participated. Select the template for the last-call reminder e-mail on the <strong>E-mail Settings</strong> tab of the <strong>Guides</strong> sub-navigation. If you do not want to send an additional reminder e-mail (a last-call reminder e-mail) simply leave the field empty.</p>\n<p>If the field time has already expired, an extension can no longer be performed even if the option is activated.</p>\n<h3 id=\"header-18\"><strong>One-time Sending of a Reminder E-mail (ME- &amp; US-Guide)</strong></h3>\n<p>From now on, reminder e-mails can only be sent once per Rater Group. This also applies to automatically sent reminder e-mails. So once a reminder e-mail has been sent - manually or automatically - you can't send another reminder email.</p>\n<h3 id=\"header-19\"><strong>Predefined Dashboard Templates (US-Guide)</strong></h3>\n<p>In addition to the <em>MySight</em> dashboards, predefined dashboard templates can now be selected for the <em>Team Improvement Guide</em> (US Guide) to present the results of a US Guide survey. For this purpose, you have the new <strong>Results</strong> tab on the <strong>Guides</strong> sub-navigation. On this tab you can use radio buttons to choose between <strong>MySight Dashboard</strong> and <strong>Dashboard Configuration</strong>. If you choose <strong>MySight Dashboard</strong>, the familiar MySight configuration guide for your guide results will be displayed. If you select <strong>Dashboard Configuration</strong>, the available dashboard templates are displayed. Depending on the template, you have a wide range of settings.</p>\n<h2 id=\"header-21\"><strong>Enterprise Feedback Suite</strong></h2>\n<p><em>EFS</em> has also been improved. The search function of the participant list has been improved. The preview for e-mail templates has been revised, so that creating these templates can now be done in no time at all. Among other new features, the pages of the questionnaire can now be marked as finished. </p>\n<h3 id=\"header-23\"><strong>New Search Function for the Participant List</strong></h3>\n<p>The search function of the participant list has been revised, so that now large amounts of participants can be searched with a minimum of time. The search is divided into two sections: \"Fields with index\" and \"Fields without index\".</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998054084114\" alt=\"Search 1.png\"></p>\n<p>In the section \"Fields with Index\" you can, for example, search for participants according to the disposition code. A special new feature in this section is the search using the creation date. You can now search for the period in which participants were created. But  if you want to search for a specific date/day, the same date must be selected in both fields. A further possibility of the precise and fast participant search is the search for e-mail addresses. To do this, you can use the search for certain elements of an e-mail address in the upper left corner. For example, if you select <em>Ends with</em>, you can search for all e-mail addresses that end on a particular domain. The second search for e-mail addresses is located at the bottom right and allows you to search for several e-mail addresses at the same time by entering these addresses one below the other in the free text field.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998030305810\" alt=\"Search 2.png\"></p>\n<p>In the \"Fields without index\" area, you can search for participant variables that do not have an index in the database. A search in the \"Fields without index\" area therefore takes much longer than a search in the upper area. But if you have a participant variable from the lower area searched particularly frequently, this variable field can be provided with an index in the database. For this purpose, please contact our support team.</p>\n<p> </p>\n<p>This function is deactivated by default. To enable the new search feature, please contact our support team.</p>\n<h3 id=\"header-24\"><strong>New Preview for E-mail Templates</strong></h3>\n<p>The creation of e-mail templates is very complex, which is why the preview function makes your work much easier. Up to now this preview function was only partially available. With the new preview for e-mail templates you are not only allowed to choose different views (desktop, tablet or mobile phone), but you also get a preview of how the detailed e-mail will look like. You can enter values for the placeholders as a test. Also attached files can be displayed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998040694546\" alt=\"E-Mail Preview.png\"></p>\n<p>Sending a test e-mail is also possible. The e-mail address of the current user is used as the sender address for this e-mail. You can also send the e-mail to different candidates by entering names separated by a semicolon. If one of the e-mail addresses is incorrect, the entire process is cancelled and an error message is displayed informing you which of the e-mail addresses is incorrect. In addition, you can switch between the different language versions (if different language versions are available).</p>\n<h3 id=\"header-25\"><strong>ID for E-mail Templates</strong></h3>\n<p>Until now, it was not possible to save information about which e-mail template was used to create an e-mail. From now on each e-mail will be provided with an ID generated by the system, which will be listed in the mail report table in the <em>Mail Template</em> column. The ID also acts as a link, allowing you to access the template you are using.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998000174482\" alt=\"ID Mail-Template.png\"></p>\n<h3 id=\"header-26\"><strong>Early Complete</strong></h3>\n<p>From now on, you can mark the pages of your questionnaire with a special indicator, so that e.g. participants who have answered these questionnaire pages will receive the disposition code <em>completed</em> at the end of the participation period or the deadline set by you. To activate this feature, open the <strong>Project properties</strong> of your PE project and check the option \"Early complete support\".</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998029691154\" alt=\"earlycompletesupport.png\"></p>\n<p>If the <em>date_of_expire</em> variable is not set, you can use the <strong>Mark finished after</strong> option to specify a replacement value so that participants receive the disposition code completed at the end of this period, which begins with the last access. In anonymous projects, the <em>Mark finished after</em> option is unavailable, instead the participants are automatically marked as completed after their session expired. To configure a shorter session expiration in anonymous projects, go to Project properties &gt; Login options.</p>\n<p>You can also check whether the trigger should be executed on the end page. This means, that even in the case of a short participation without reaching the actual end page of the survey, the triggers placed there will be executed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998027424786\" alt=\"Early complete page.png\"></p>\n<p>In the second step, open the menu item <strong>Page</strong> in the <strong>Questionnaire editor</strong> before clicking<strong> Properties</strong> and activate the option <em>Early complete page</em> in the \"Other options\" area. In addition, for each page that you mark in this way, you can select a disposition code that participants will receive when they complete that page. Each participant receives the disposition code of the last page he or she has completed, i.e. the page that has been marked this way. You can activate this option for all desired pages of your questionnaire, after the completion of which participants are to be marked for a certain disposition code (chosen by you).</p>\n<h3 id=\"header-27\">Information</h3>\n<p>This feature is only available for PE and AN projects. By default, it is disabled.</p>\n<h3 id=\"header-28\"><strong>Disable Visual Editor in E-mail Template Configuration</strong></h3>\n<p>You can now deactivate the visual editor, which is also available to you when creating e-mail templates. If you select this option, you will only have the Source Editor installed, so the risk of damaging the HTML code when switching to the Visual Editor is minimized.</p>\n<h3 id=\"header-29\"><strong>Placeholder</strong></h3>\n<p>The placeholder <em>#u_guidewave_rater_group#</em> can now also be used in question types that contain the fields \"Question text\" and \"Fill-in instruction\". The placeholder is also displayed in the survey according to the survey language if this has been maintained under <strong>Categories</strong> in the <strong>Libraries</strong>. The placeholder can also be used in the subject line as well as in the text of an e-mail template. You can only use this placeholder in survey of PE project that is connected to <em>Guides</em>.</p>\n<h3 id=\"header-30\"><strong>Export and Import of all Survey Languages</strong></h3>\n<p>Under the menu item <strong>Export/import</strong> of the <strong>Language editor</strong>, the tab<strong> Export/import all languages</strong> is available. You use this to export and import all survey languages. In the <strong>Export</strong> section you will find a <strong>Download</strong> button which you can use to create the export of all survey languages of the selected project. An xslx file is downloaded. The xslx files are project-related and cannot be exchanged between different EFS projects.</p>\n<p>The <strong>Import</strong> section allows you to select and import a file. Only xslx files can be uploaded. You can create a report about the changed phrases.</p>\n<h3 id=\"header-31\"><strong>Export Survey Data</strong></h3>\n<p>The new export format Triple-S v2.0 CSV allows to export very large projects in the Triple-S format and is supported by many current software products.</p>\n<h2 id=\"header-33\"><strong>Web Services</strong></h2>\n<p>New web services have been developed. As of this winter release, it is possible to change participants and the participations. A service for multilingual templates and participant import is also available.</p>\n<h3 id=\"header-35\"><strong>Changing Participants and Participations</strong></h3>\n<p>The <em>survey.results.updateSurveyResults</em> service layer API is now available that allows you to replace a specific variable of a specific participation with a new value.</p>\n<p>This service is available for the following project types:</p>\n<ul>\n<li>\n<p>Anonymous surveys (AN)</p>\n</li>\n<li>\n<p>Personalized surveys (PE)</p>\n</li>\n<li>\n<p>Employee surveys (ES)</p>\n</li>\n</ul>\n<p>Optionally, triggers can be executed on the end side. Loop variables are not supported. When the trigger is executed, a maximum of 100 Ifdns is allowed. If more are used, an error message is issued. The service always outputs a list of the data sets provided. Furthermore, the function<em> survey.participants.update</em> allows you to update participants who have not yet participated in the survey.</p>\n<h3 id=\"header-36\"><strong>Services for Multilingual Templates</strong></h3>\n<p>The following web services have been extended with the translations of the e-mail templates. The add/change translations have been marked as optional:</p>\n<ul>\n<li>\n<p>efs.mailtemplates.getList</p>\n</li>\n<li>\n<p>efs.mailtemplates.get</p>\n</li>\n<li>\n<p>efs.mailtemplates.change</p>\n</li>\n<li>\n<p>efs.mailtemplates.add</p>\n</li>\n</ul>\n<h3 id=\"header-37\"><strong>Enhanced Import Participants API</strong></h3>\n<p>To handle imports of participants exceeding 100000 participants, the web service<em> survey.participants.addListV2</em> has been extended by the service <em>survey.participants.addListAsynchronous</em> and <em>efs.taskqueue.getResult</em>. The service <em>survey.participants.addListAsynchronous</em> receives the same parameter as<em> survey.participants.addListV2</em> and displays the task ID. The service <em>eefs.taskqueue.getResult</em> gets the parameter Task-ID and returns the current processing status of the import.</p>",
    "user_segment_ids": []
}