{
    "id": 20998295806866,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998295806866.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998295806866-EFS-Release-Fall-2018",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 14,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:35:21Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Fall 2018",
    "title": "EFS Release Fall 2018",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:08:16Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EP6ZV6DJP8EWFHJWWP7QV5\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Survey</a>\n<ul>\n<li><a href=\"#header-3\">Dynamic answer option: bad words list</a></li>\n<li><a href=\"#header-5\">New import tool</a></li>\n<li><a href=\"#header-6\">New question type: People selection</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-8\">Portals</a>\n<ul>\n<li><a href=\"#header-10\">The redesign of the Report list</a></li>\n<li><a href=\"#header-11\">Available master data in the user profile of Portals</a></li>\n<li><a href=\"#header-12\">Module modifications</a></li>\n<li><a href=\"#header-13\">User managed groups</a></li>\n<li><a href=\"#header-14\">‘Blue collar’ worker scenario</a></li>\n<li><a href=\"#header-15\">Multi language</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-17\">People</a>\n<ul>\n<li><a href=\"#header-19\">The search via voucher code</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-21\">Privacy Assistant</a>\n<ul>\n<li><a href=\"#header-23\">The features of the consent form</a></li>\n<li><a href=\"#header-24\">Activities logs and ACL rights</a></li>\n<li><a href=\"#header-25\">GDPR: Webservices</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-27\">Report Manager</a>\n<ul>\n<li><a href=\"#header-29\">Direct Report Node and Direct Report Filter</a></li>\n<li><a href=\"#header-30\">The Overview sub-navigation</a></li>\n<li><a href=\"#header-31\">NPS: new standard calculation class</a></li>\n<li><a href=\"#header-32\">Language selection</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-34\">Text Analytics</a>\n<ul>\n<li><a href=\"#header-36\">APIs for the text analysis</a></li>\n<li><a href=\"#header-37\">Text analysis triggers</a></li>\n</ul>\n</li>\n</ul>\n<div class=\"expand-macro\">\n<h4 id=\"h_01J6EP6ZV77MEFDC6V1S86PEBC\"> </h4>\n</div>\n<h2 id=\"header-1\">Survey</h2>\n<h3 id=\"header-3\">Dynamic answer option: bad words list</h3>\n<p>In our summer release we introduced our new<em> Dynamic Answer Option</em> question type. This question type allows you to present a respondent with a singleresponse list that dynamically updates based on the responses given by previous respondents. In an enhancement to this question type, we have now introduced the option to block certain words or phrases. To avoid inappropriate responses (e.g. swear words) being added to the response lists. You can upload a bad words list via the media library in the configuration of the Dynamic answer option question type. First you have to add the bad words list in CSV format to the media library, before you can use that list in the configuration of the question type. The values in the bad words list will not be treated as case-sensitive. By clicking on the <strong>View</strong>-icon, you can view the contents of the bad words list in the Questionnaire Editor.</p>\n<p>Two additional settings have also been added for the <em>Dynamic Answer Option</em> question type. The “Confirm new answer options” setting results in a new icon being shown in the questionnaire editor, alongside each new option that has been dynamically added to the option list. This icon allows you to approve or decline new answers, allowing you to benefit from the dynamic addition of new options, whilst retaining absolute control of the values that are ultimately added to the list and presented to your respondents. In addition, we have the new “Email notification on new answer option” setting. When this setting is turned on an email notification is sent to all users nominated to receive project notifications each time a new answer is dynamically added to the list.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998286021138\" alt=\"Blacklist.png\"></p>\n<h3 id=\"header-5\">New import tool</h3>\n<p>One of the great features of EFS is the ability to import projects and data, helping you to test new versions of surveys, or just migrate to new installations. But some projects can be huge, so you don’t want to hang around waiting for an import to complete. Now, on enabled installations, you can tick off whether you want to be notified as soon as the import is finished. Contact us to use this and other queued features. In addition, in personalised projects, you have a second tap under the menu item “Result import”: <strong>Data migration</strong>. There you select the projects you want to import (you must have access to this project). You can only import projects within in the same installation. The import is then queued to improve performance and free up your time.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998298552338\" alt=\"Migrate data.png\"></p>\n<p>In the lower area, you can check on the status of all your imports. The following fields are available to you:</p>\n<ul>\n<li>\n<p>Status</p>\n</li>\n<li>\n<p>File name</p>\n</li>\n<li>\n<p>Created</p>\n</li>\n<li>\n<p>Finished uploads</p>\n</li>\n<li>\n<p>Remove</p>\n</li>\n</ul>\n<p>Each import is automatically removed from the list after three days. You can also manually remove the imports.</p>\n<p><strong>Coping with projects with huge amount of data</strong></p>\n<p>The import process can take time for very large projects. Now, you will be able to see projects that are still in the process of being imported / copied in the normal project overview page.</p>\n<p>Projects that have not yet been completely imported or copied can only be selected in the project overview if they have been created completely and without errors. Until completion, these projects are only visible, but not selectable. If an error occurs while copying a project, the project can be deleted after twenty minutes.</p>\n<h3 id=\"header-6\">New question type: People selection</h3>\n<p>Sometimes you want to give survey respondents a quick and easy way of selecting a person from a list. For instance, if you want employees to choose someone from their organization to give recognition to, like a high-five or a shout out. In EFS this has always possible, but required some complex setup and integration. Now, we’ve made it really simple, with a brand-new question type!</p>\n<p>This gives survey respondents direct accurate access to other people in the Panel during a survey. Respondents can search for people by first name, last name and e-mail address.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998342539154\" alt=\"Options.png\"></p>\n<p>In the Options section of this question type, you configure the following settings: Select a panel group to be used as the source group (the panelists that are displayed in the questionnaire view are taken from this group). Enter placeholder text and a value in relation to the list size, i.e. how many panelists are to be displayed via the drop-down list. The maximum value is 100.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998330391058\" alt=\"People selection.png\"></p>\n<p>Please note that for panelists to appear in the search results, the options \"Show profile to others\", \"First name\", \"Last name\" and “E-mail address” must be ticked in the panelist administration.</p>\n<h2 id=\"header-8\">Portals</h2>\n<h3 id=\"header-10\">The redesign of the<em> Report list</em>\n</h3>\n<p>The <em>Report list</em> page module has been redesigned to improve usability and match the same design as other Portal modules, such as the <em>Portal invitation</em> module. It’s also been updated to provide a larger amount of generated reports for download. In the module setting, you can select which projects of the <em>Employee survey</em> type you want to offer for selection.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998313439890\" alt=\"Reports.png\"></p>\n<p>In the external view of the module, the released ES projects are then available to you in a drop-down list so that you can select them individually to download the reports available for each project. We’ve also greatly improved the filter options so it’s easier to find the right reports, quickly. In addition to the name or meta name of the units, you have two further filter functions by clicking on the filter icon: File type and language. If you do not select an ES project from the drop-down list, the project with the latest field phase end time is displayed first.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998330867986\" alt=\"Reports 2.png\"></p>\n<h3 id=\"header-11\">Available master data in the user profile of <em>Portals</em>\n</h3>\n<p>It is really great to give Portal users contol over their own data, and we’ve been able to do that for a while in the Profile module. This gives them a place where they can change their name, email, address, etc. But it was always limited to text fields, which was frustrating some people.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998287307410\" alt=\"image2018-10-25_13-13-49.png\"></p>\n<p>So we’ve improved this by adding two new types of control: switches and lists. Switches will be diplayed for Master Data variables that are YES/No (boolean). A select box is displayed for integer variables that have response categories. A select box is also displayed for integer variables that do not have response categories. The default setting for all Master Data variables is a text box.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998331286802\" alt=\"Master data.png\"></p>\n<p><strong>New features for the </strong><em><strong>Action Board</strong></em></p>\n<p>People love the Action Board! But they’ve also got a lot of great ideas of how it can be even better. So we’ve added some important new features in this release. You can now assign a due date to an action, easily share files, and we’ve added more notification settings to make sure people don’t miss a single thing!</p>\n<p><u>Due date</u></p>\n<p>In the detail view of the action ticket, you specify a due date to ensure that the action will have been executed by a certain date (of course, you can’t add a due date to items that have already been archived or completed). In the<br><em>Action Board</em> module configuration, you can configure email notifications regarding the due date and a due date reminder. You also specify how many days before the due date a reminder email is to be sent.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998299984018\" alt=\"Due date.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998287892498\" alt=\"Due Date 2.png\"></p>\n<p><u>Adding files</u></p>\n<p>You can now add files to the details view of your action, making it even easier to collaborate with your team. You can even Drag &amp; Drop from your desktop right into the action. Files can be uploaded by anyone the action has been shared with, and all viewers can click on the file to download. If an action is deleted, all uploaded files are immediately removed; however, if an action is archived all files are retained. A maximum of 5 files with a maximum individual file size of 8MB can be added to each action in the board.</p>\n<p><u>Do not send e-mails</u></p>\n<p>Email notification are fine, but some users asked for more control. So from now on you can also use the option “no emails” in the module configuration of the<em> Action Board</em> module to send no e-mail notifications for that particular trigger. Note that if you select this option, then neither e-mails nor push messages are sent, even if those notification options have been activated in the user profile.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998300451218\" alt=\"No email.png\"></p>\n<h3 id=\"header-12\">Module modifications</h3>\n<p><u>Task List</u></p>\n<p>The Task List module connects directly to the Action Planner in EFS, and is very useful for complex workflows like Closed Loop Feedbacks. So we’ve added support for the file upload/download to this, too.</p>\n<p>After upload, files are displayed in the tasks, but only for those who have access to this task. You also have a new sort order that allows you to sort the tasks in ascending or descending order by title, end date, status, or creation. A maximum of 5 files, with a maximum file size of 8MB can be added to each task.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998344763026\" alt=\"Upload Task list.png\"></p>\n<p><u>Portal invitation: role selection </u></p>\n<p>In the <em>Portal invitation</em> module, you can now define the role to which the invited persons are assigned to. The<br>available roles are: Moderator, Survey Manager and Translation Manager. If you choose “Select all”, then all roles will be assigned to the invited person. If you do not select a role, the invited person will be assigned a default Participant role.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998332560914\" alt=\"Portal invitation.png\"></p>\n<p><u>Displaying topics</u></p>\n<p>For the <em>Cards</em> and <em>Discussion modules</em> of <em>Portals</em>, you can now display the topics on the tiles, which you create under the Topic tab. So when you start a new discussion in the external view, you can choose from the topics created in the CMS area of Portals. The selected topics will then appear on the corresponding discussion tile. Two of the selected topics also appear on the discussion tile of the <em>Cards</em> module if you have shared the corresponding discussion board in the module configuration of the <em>Cards</em> module.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998345208210\" alt=\"Topic.png\"></p>\n<h3 id=\"header-13\">User managed groups</h3>\n<p>To avoid confusion when managing groups in <em>Portals</em>, we’ve made it simpler. The person who creates a User-managed group is defined as the ‘owner’. Only group members can view a public group, and only the owner can edit the group. Thus, only group owners can publish or make changes to a groups. This is consistent across all modules in<em> Portals</em>, so when inviting new people to a Portal using the <em>Portal Invitation</em> module you can only select groups that you are the owner of.</p>\n<h3 id=\"header-14\">‘Blue collar’ worker scenario</h3>\n<p>It’s one of the biggest problems for organizations wanting to survey their employees: pretty much everyone has access to a device to respond on, but how do you get the survey invitations to people who don’t have an email address? This is what we refer to as the ‘Blue Collar’ scenario. We refer to people who don’t have email addresses in EFS as ‘offline participants’.</p>\n<p>We want this to be as simple as possible, so in Guides, you can now invite offline users. This does require some setup and configuration before you get started:</p>\n<p>To declare panelists as offline participants, first set the new master data m_offlineusers to 1 (= yes) in the Panelist administration of the People module. In Guides (in Portals) select the appropriate template under the <strong>E-mail Settings</strong> tab of and configure the code voucher under the <strong>Offline Participants</strong> tab. These voucher are then sent by email as a PDF to the person who initiated the survey in Guides. They can also be downloaded from the Guide Status page in Portals. The intention is for the person who initiates the Guide to then print off the vouchers, and distributed them in person to the offline participants. The vouchers include a unique participation code, a QR code that links to the survey, the first and last name of the participant and the survey URL.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998333023506\" alt=\"Offlineusers.png\"></p>\n<p>Offline participants are then free to access the survey, either directly using the URL or by scanning the QR code with their own mobile devices. They will be prompted to enter their participant code before completing the survey.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998316052626\" alt=\"Guides 2.png\"></p>\n<h3 id=\"header-15\">Multi language</h3>\n<p><em>Portals</em> now has even better multi-language support. You can now create different language versions of all your pages, so your Portal users can select their own language and never miss a thing! You can provide page titles, module headers and content in the available portal languages, each page that you want to configure in the CMS area of Portals has a header that displays the available portal languages in a drop-down list.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998345950098\" alt=\"Header.png\"></p>\n<p>You select one of the languages, enter the page title in the selected language. Then open the module configuration and assign a module heading. For modules such as the<em> Multimedia</em> module or <em>Content slider</em>, you also create the content in the various portal languages. Again, select one of the available languages in the header and insert the corresponding content in the selected language. In the external view of the profile you can choose between the different languages. Depending on which language you choose, the page title, module heading and module content change according to the selected language.</p>\n<p>As soon as you click on Publish, the Globe icon turns green. As long as you do not enter a translation, the icon remains red.</p>\n<p>Portal user can then choose between the different languages in their profile settings. All translated content with then update immediately according to the selected language, without the user having to refresh their browser.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998333750674\" alt=\"Profile settings.png\"></p>\n<h2 id=\"header-17\">People</h2>\n<h3 id=\"header-19\">The search via voucher code</h3>\n<p>Under the menu item \"Payment list\" you now have the possibility to search for the voucher code. The table is also equipped with the column \"Voucher code\", which you can optionally add.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998350039826\" alt=\"Voucher code.png\"></p>\n<h2 id=\"header-21\">Privacy Assistant</h2>\n<h3 id=\"header-23\">The features of the consent form</h3>\n<p><u>Create record</u></p>\n<p>Under the menu item \"Consent form\" you generate a record which allows you to print out the consent form together with the entries made in the configured languages. Additional information such as comment and date can be provided in this print version. Additional options can also be ticked off.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998346635666\" alt=\"Record.png\"></p>\n<p><u>Consent messages</u></p>\n<p>In order to be able to maintain the labels of the Consent form centrally, you can also find the \"GDPR Consent Messages\" section on the page by clicking on the drop-down arrow when you click on the Consent form in the questionnaire editor. There you enter the corresponding labels in the selected language, which can then be seen in the questionnaire view.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998303163282\" alt=\"Consent messages.png\"></p>\n<p><u>Privacy Options</u></p>\n<p>In the section \"Privacy information\" you will find three radio buttons that allow you to decide, depending on the project requirement, whether you want to create a Consent form and Privacy notice, a consent form only or a Privacy notice only. The selection made regulates which of the fields appear in the questionnaire view and can be filled in.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998357754642\" alt=\"image2018-10-25_14-30-22.png\"></p>\n<p><u>Overview of the languages</u></p>\n<p>In the People module, under the \"Panel configuration\" menu item, you have a language overview so that you can quickly check in which languages the Consent form has already been created.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998350844818\" alt=\"Languages.png\"></p>\n<h3 id=\"header-24\">Activities logs and ACL rights</h3>\n<p>If you have been assigned to a team that has read and/or write access to the gdpr_activites logs and gdpr_purpose templates, you can find the GDPR activities logs menu item under <strong>Documentation</strong>, <strong>Master Data</strong> and <strong>Consent form templates</strong>. In addition, under GDPR activity logs a table is available which informs you about GDPR activities by means of the columns \"Data\", \"Actions\", \"User\" and \"Log entry\". The table is also displayed in the <em>People</em> module.</p>\n<p><u>Read and write permissions for the template of the Consent form</u></p>\n<p>The new <em>gdpr_purpose_templates</em> right, which you tick in <strong>Options</strong> under the menu item \"Team rights\", allows you to control access to the templates of the Consent form by assigning read and write rights. The Team that obtains the write permission can create, edit, copy, delete, import and export templates. The team that that obtains the read permission can read and export the created Consent form.</p>\n<h3 id=\"header-25\">GDPR: Webservices</h3>\n<p>Two new web services for GDPR are now available. This can be used to create and retrieve a consent form. </p>\n<h2 id=\"header-27\">Report Manager</h2>\n<h3 id=\"header-29\">Direct Report Node and Direct Report Filter</h3>\n<p><u>Direct Report Node</u></p>\n<p>It was previously not possible to directly access the root units aggregating all values of the subunits. If, for example, you now want to display the response rate for a root node, simply take the <em>Direct report node</em> from the organizational structure in the first step of the report ordering process to set it as the focus unit.</p>\n<p>Direct report nodes that you use in the first step of the report ordering process (selecting the focus unit) are activated via the configuration that precedes each <em>Report Manager</em> project in order to make available in a report the values of a root unit that only belong to this root unit.</p>\n<p><u>Direct Report Filter</u></p>\n<p>You can also use filters to create <em>Direct report nodes</em>. You create these filters in two places. You use the <em>Direct reports</em> filter, which can be applied to each mapping cell, to filter individual mappings when creating a report definition in such a way that root units are available without the values of the subunits. In the third step of ordering the report, determining the general filter conditions, you also use the <em>Direct reports</em> filter to apply it to all root nodes of the selected report definition.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998351025426\" alt=\"Direct reports.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998358487314\" alt=\"Direct reports 2.png\"></p>\n<h3 id=\"header-30\">The Overview sub-navigation</h3>\n<p>The new <strong>Overview</strong> sub-navigation has been set up in the configuration area of the <em>Report Manager</em>. You mainly use the overview to centrally control the copying of elements of an available Report definition. In this way, you use slide switches to specify whether mappings, page conditions, dataspace entities, collections, and settings are to be copied from all Report definitions.</p>\n<p>As soon as you click on the <strong>Copy</strong> button, the Inspector opens and lists the Report definitions created on the installation, from which you can copy mapping, page conditions, Dataspace entities, Collections and settings.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998364620434\" alt=\"Overview.png\"></p>\n<p> </p>\n<p>Of course it is worth knowing in this context: Collections and Dataspace entities are only added to the target project as long as metanames are not identical. In the case of identical metanames, DSEs and Collections are replaced by those of the Report definition to be copied. The settings are also taken from the Report definition to be copied and replaced, as are the mappings.</p>\n<h3 id=\"header-31\">NPS: new standard calculation class</h3>\n<p>The <em>Report Manager</em> now has a new standard calculation class: the Net Promoter Score. You use this calculation class for mappings. However, you must note that the values are shifted by +1, because the IDs of the response options start at 1 and not at zero. So the scale is from 1 to 11 instead of 0 to 10.</p>\n<h3 id=\"header-32\">Language selection</h3>\n<p>You specify the language of the report to be ordered in the last step of the report ordering process, the Report Order. The language selected here has priority over the language selected in the global settings.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998304433170\" alt=\"Report Order.png\"></p>\n<h2 id=\"header-34\">Text Analytics</h2>\n<p>As many of our customers know, getting qualitative insights from their employees, customers and research panelists is extremely valuable. But sometimes the volumes of this data can be overwhelming to analyze and action. Whilst TIVIAN has been able to offer text analytics capabilities for some time to help our customers make sense of the large volumes of free text comments they capture as part of their feedback programmes, in our fall release we have looked to further extend our offering.</p>\n<p>We are now able to offer the services of the world’s leading text analytics providers with our new integrated APIs. In addition, we are releasing the first of our pre-built triggers which provide you with self-service access to some of the most commonly used text analytics services within your own surveys, without the need for paid consultancy services from TIVIAN.</p>\n<p>In summary, with our fall release we include:</p>\n<ul>\n<li>\n<p>Integrated APIs that connect to leading text analytics functions that can be used by our professional services teams to build out bespoke text analytics offerings for our customers.</p>\n</li>\n<li>\n<p>Two custom text analytics triggers for do-it-yourself projects</p>\n</li>\n</ul>\n<p>If you are interested in our text analytics offering, please contact us for further information.</p>\n<h3 id=\"header-36\">APIs for the text analysis</h3>\n<p>TIVIAN’s integrated APIs provide access to the commercial Text Analytics offerings of Microsoft, Google and Amazon, and in addition, the Natural Language Toolkit (an open source scientific collection of text analytic functions). Through these APIs we provide our customers with the freedom to choose their preferred Text Analytics provider, and these services can be incorporated into the services/solutions we deliver to our customers.</p>\n<p>Below is a list of the different Text Analytics APIs our customers will now have access to:</p>\n<ul>\n<li>\n<p>Sentiment Analysis</p>\n</li>\n<li>\n<p>Key Phrase Extraction</p>\n</li>\n<li>\n<p>Entity extraction</p>\n</li>\n<li>\n<p>Entity Sentiment</p>\n</li>\n<li>\n<p>Language detection</p>\n</li>\n<li>\n<p>Categorization (trainable, project based)</p>\n</li>\n<li>\n<p>Custom Natural Language Toolkit Models</p>\n</li>\n</ul>\n<h3 id=\"header-37\">Text analysis triggers</h3>\n<p>With our fall release we introduce two custom triggers that can be activated by support for each customer with their own EFS installation. These triggers use Microsoft Azure Cognitive Services APIs and provide support for a wide range of languages (<a href=\"https://docs.microsoft.com/en-us/azure/cognitive-services/text-analytics/language-support\">https://docs.microsoft.com/en-us/azure/cognitive-services/text-analytics/language-support</a>).</p>\n<p>Once activated by our support teams, our customers can use these triggers within any of their surveys/projects.</p>\n<p><u>Key Phrase Extraction Trigger</u></p>\n<p>The key phrase extraction trigger returns the key themes from within open text feedback. This trigger can be used for categorization or clustering of data. For example, given the feedback \"The food was delicious and there were wonderful staff\", the trigger would return the main themes of \"food\" and \"wonderful staff\".</p>\n<p>This trigger can use up to 20 variables to store the returned key phrases, with the last assigned variable storing all remaining key phrases as a comma separated list. The 911 user-defined question type (text variable max 65535 chars) is best suited for use with this trigger. These variables should be created prior to adding the custom trigger to the page within your survey. Select azurekeyphrase from the trigger behavior of the custom trigger. These variables should be created prior to adding the custom azurekeyphrase trigger to the page within your survey.</p>\n<p>When adding the trigger to a page in your survey it is recommended that you use a condition to check if the source text variable contains any text (e.g. by creating if(v_1 != '') in the standard or alternative condition editor).</p>\n<p>If your survey uses the back-button or resumption from beginning, we recommended that you allow multiple executions of the trigger (see screen shot below).</p>\n<p>In the detailed configuration of the trigger you will need to enter the text analytics API-Key provided to you by our support team (see screen shot below). In the field below this, you will enter the language code of the expected language in the source variable. You will find the list of supported language codes on the Azure Cognitive Services website.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998335927826\" alt=\"image2018-10-25_15-20-25.png\"></p>\n<p>In the target variables section of the configuration you can enter up to 20 text variables where the key phrases will be stored, as mentioned previously. The last variable will contain all remaining phrases as a comma separated list.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998318647186\" alt=\"image2018-10-25_15-21-22.png\"></p>\n<p><u>Sentiment Analysis Trigger</u></p>\n<p>The sentiment analysis trigger categorizes open text feedback as negative, positive or neutral. The usage of this trigger is similar to the key phrase extraction trigger, start by selecting a sentiment from the trigger behavior of the custom trigger. Again, we recommend setting up an execution condition to check that feedback has been provided in your source variable.</p>\n<p>This trigger uses up to two variables (custom or from a 911 user-defined question type) to store the result of the analysis. The first variable of type short text or text will contain the categorization (negative, positive or neutral) and the optional second variable of type float will store the sentiment score provided by the service. This will be a value between 0 and 1, where 0 is the lowest sentiment strength, and 1 is the highest.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998365487378\" alt=\"image2018-10-25_15-23-44.png\"></p>\n<p> </p>",
    "user_segment_ids": []
}