{
    "id": 20998484770706,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998484770706.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998484770706-EFS-Release-Winter-2017",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 17,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:42:38Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Winter 2017",
    "title": "EFS Release Winter 2017",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T08:51:17Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EN87R3JGX2DBNQE7C694AB\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Survey</a>\n<ul>\n<li><a href=\"#header-3\">The export queue</a></li>\n<li><a href=\"#header-5\">New question type: Autocomplete</a></li>\n<li><a href=\"#header-6\">Single response list and multi response list (mobile optimized)</a></li>\n<li><a href=\"#header-7\">Personalized invitation mail for a follow-up survey</a></li>\n<li><a href=\"#header-8\">Changing the language during the survey</a></li>\n<li><a href=\"#header-9\">Keyboard control of the questionnaire editor</a></li>\n<li><a href=\"#header-10\">Layout update button</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-12\">MySight</a>\n<ul>\n<li><a href=\"#header-14\">Update for published data sources</a></li>\n<li><a href=\"#header-15\">Multi language dashboards</a></li>\n<li><a href=\"#header-16\">External variables</a></li>\n<li><a href=\"#header-17\">Unique split names</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-19\">Portals</a>\n<ul>\n<li><a href=\"#header-21\">Feedback Assistant: new dashboard functions</a></li>\n<li><a href=\"#header-22\">Feedback Assistant: Manager Participation</a></li>\n<li><a href=\"#header-23\">UX optimization of the Feedback Assistant</a></li>\n<li><a href=\"#header-24\">A new module: Portal Invitation</a></li>\n<li><a href=\"#header-25\">Displaying a page once after the first login</a></li>\n<li><a href=\"#header-26\">Wildcards for the Text and Multimedia module of Portals</a></li>\n<li><a href=\"#header-27\">Additional information in the circle list</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-29\">People</a>\n<ul>\n<li><a href=\"#header-31\">Automated welcome email</a></li>\n</ul>\n</li>\n</ul>\n<div class=\"expand-macro\"> </div>\n<h2 id=\"header-1\">Survey</h2>\n<h3 id=\"header-3\">The export queue</h3>\n<p>As of the winter release, an export queue is available as an option, which helps to ease the workload especially on installations on which large projects have been set up. Using the two new buttons, + New export task and + Export immediate, which you will find in the “Survey menu” under “Export”, you can specify whether an export is to be made available directly for download or whether it is to be put in a queue. While the button for immediate export triggers the usual procedure with a known result, the click on the queue button relieves the system and offers further advantages for you.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998515995026\" alt=\"fd054110-3325-4d7b-a24f-816b0ac183b6\"></p>\n<p>Users no longer have to stay on the page until the export is available, but can continue their work with EFS during generation and are informed about the completion by means of the notification icon in the module bar of EFS. The export is also available for download for three days.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998544802706\" alt=\"c95b858a-e723-4d0b-930c-4522c12d5c51\"></p>\n<p>You only have to deviate slightly from the usual procedure by assigning a name to the exports to be queued. As soon as the exports are listed, they appear in a table and have the status “In process”. Once the exports have been successfully generated, download them by clicking on the download icon.</p>\n<p>The feature must be enabled by support.</p>\n<h3 id=\"header-5\">New question type: Autocomplete</h3>\n<p>This type of question allows you to provide potential answer options, from which up to ten choices are presented as suggestions based on the autocompletion of what is being typed into the input line by the user. The suggestions are shown in the list of a drop-down box in alphabetical order. They can also be called up by clicking on the drop down arrow.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998515511954\" alt=\"bfa20442-ff2d-4c59-953b-86508c03f927\"></p>\n<p>To use this type of questions with the advantages described above, upload a CSV file with the answer options to the media library. You can download an example file from the questionnaire editor.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998544330386\" alt=\"99b19e10-f228-4324-88cc-0192325b30e6\"></p>\n<p>To use this type of questions with the advantages described above, upload a CSV file with the answer options to the media library. You can download an example file from the questionnaire editor.</p>\n<p>Like all new question types, this is only available for projects that use Responsive Layout 3.</p>\n<h3 id=\"header-6\">Single response list and multi response list (mobile optimized)</h3>\n<p>For better usability on mobile devices, the two question types single and multiple response list have been optimized with regard to the positioning of the controls and the hidden background, which can be found in the Detail configuration of the questions</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998487015954\" alt=\"0bd4dd79-1530-497a-b3e2-c946bbaec5c8\"></p>\n<ol>\n<li>\n<p>The positioning of the control elements can be determined independently. Use the drop-down list to select whether you want to place the items to the left, above or below the response options. Hiding these elements is also available.</p>\n</li>\n<li>\n<p>You use the check box to check whether the background should be deactivated.</p>\n</li>\n</ol>\n<p>The alternating background color, as you know it from the other question types, is not used for these question types.</p>\n<h3 id=\"header-7\">Personalized invitation mail for a follow-up survey</h3>\n<p>CLF's e-mail invitation to the follow-up survey is personalized because you now have a direct salutation. Until now, the invitation mail contained only the e-mail address of the potential participant. Using the placeholders (#u_name# and #u_firstname#) you can equip this mail with the first and last name of the future participant. The participant variables are accessed for the information. If the information is not available or has been deleted in the meantime, the wildcard is replaced by an empty string (with no length).</p>\n<h3 id=\"header-8\">Changing the language during the survey</h3>\n<p>You can now switch between the survey languages created under Project properties during a survey. To do this, you have a drop-down list on the questionnaire page that can be opened using the globe icon.</p>\n<p>The language change applies directly to the page on which it is made. With the reloading, that is done automatically with this change all answers already given will be discarded. Even if a language change has been completed on a previous page using one of the question types that can be used for language selection, the feature can be used successfully.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998543834386\" alt=\"7b263fc3-b2ea-46c0-9f8e-7bfc486ad3f6\"></p>\n<p>In order to activate this feature, the option “enabled” must be set from the drop-down list of the menu item “Language selection in the survey”. This can be found under the tab “Internal organization” in the survey settings of the Project properties.</p>\n<h3 id=\"header-9\">Keyboard control of the questionnaire editor</h3>\n<p>As of the winter release, the questionnaire editor can be controlled by keyboard as follows: By clicking on + New question, the text box in which the question title can be entered is activated. Using the tab key, you can use the filter to jump to the question type selection. Because scrolling is not possible in the traditional sense, the individual question types must be scrolled through with the up-down arrow keys to change the superordinate question type category. If a question with title has been created before, this title is displayed as a suggestion when you browse through the question types. The control of the questionnaire editor via keyboard works equally well in the standard browsers Firefox, Chrome and Internet Explorer.</p>\n<h3 id=\"header-10\">Layout update button</h3>\n<p>In order to not only be informed about the EFS updates concerning the layout, but also to adopt them for a called project, a hint field is displayed in the Project information of the survey menu, which has the button “Apply layout updates”.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998543598866\" alt=\"c8d0849c-0601-4a98-83f2-b8eb43f5f24b\"></p>\n<p>It is also worth knowing that the changes refer exclusively to the layout and there is no risk of data loss. In addition, recent and future bug fixes can only take effect after applying the layout updates. It is recommended that you execute the update if the system recommends it. Layout migration is not possible with this feature.</p>\n<p> </p>\n<h2 id=\"header-12\">MySight</h2>\n<h3 id=\"header-14\">Update for published data sources</h3>\n<p>Previously published MySight projects could only be adapted retrospectively to a very limited extent. From now on, you can withdraw publications to both add and remove variable fields by clicking on the U-lock icon and unlocking the published MySight project. These changes can affect splits, recordings and new tables. After the changes, the project must be published again. The following must be noted: This feature can only be used in projects that have not been published before the winter release.</p>\n<h3 id=\"header-15\">Multi language dashboards</h3>\n<p>From now on, all survey languages created in an EFS project will be listed in MySight under the item “Language” and transmitted to Tableau as soon as the corresponding project is published. The user then filters which of the languages is to be displayed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998529952146\" alt=\"d7907c6f-d67b-45c2-9e6d-9d9a79302a10\"></p>\n<h3 id=\"header-16\">External variables</h3>\n<p>As of this release, the variables output_varname, gp_type and varname are also transferred to Tableau and can be used there. The variables can be found in the “Question” section under “External Variable Name”, ”Question Type” and “Var Name”. The additional information can only be viewed in the question table. The split tables remain unaffected.</p>\n<h3 id=\"header-17\">Unique split names</h3>\n<p>From now on the elements of the drill path use the following pattern: “Split PID VARNAME INDEX”. The paths looks like:</p>\n<ul>\n<li>\n<p>Split 123 v_15 1</p>\n</li>\n<li>\n<p>Split 123v_15 2</p>\n</li>\n<li>\n<p>Split 123v_15 3</p>\n</li>\n</ul>\n<p>The label of the split can be found under “Measure”. It is adjusted analogously and uses the following pattern: “Split PID VARNAME”. “Split by v_15” becomes “Split 123 v_15”. This change of the labels does not affect existing dashboards</p>\n<p> </p>\n<h2 id=\"header-19\">Portals</h2>\n<h3 id=\"header-21\">Feedback Assistant: new dashboard functions</h3>\n<p>Use the corresponding icon on the survey tile to access the dashboard of the Feedback Assistant survey. There you have the functions of e-mail forwarding and PDF and PNG download to share the result data even more easily. If you choose “Forward via email”, the standard mail client opens. All participants of the survey have already been included in the recipient line.</p>\n<h3 id=\"header-22\">Feedback Assistant: Manager Participation</h3>\n<p>You control the manager's participation in a Feedback Assistant survey by specifying in a personalized project under the item \"template configuration\" whether the manager never or always participates in a survey or whether he or she can decide about his or her participation.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998497324434\" alt=\"8be07ff5-5a13-4808-9c58-45f882d2fc4d\"></p>\n<p>As soon as the participant is selected during the creation of a Feedback Assistant survey, there is a slide switch on the right-hand side, whose control option is based on the definition under “Template configuration”. If you have decided upon never or always, the switch cannot be moved: The manager either participates in all surveys or not. As soon as you choose decided by the manager, the button will be unlocked, so that the manager can decide on his participation by means of the sliding switch.</p>\n<h3 id=\"header-23\">UX optimization of the Feedback Assistant</h3>\n<p>The setup of a Feedback assistant survey and the sending of invitations has been streamlined to enable an even smoother workflow. By selecting exactly one survey template and one e-mail template in the “Template Configuration”, it is possible to skip the step \"Template\" on the way to the Feedback Assistant survey automatically and the selection of an e-mail template is no longer necessary. The invitation mail will also be sent immediately after saving, if you have chosen to send invitations manually in the step \"Invitations\". In this case, shipping does not have to be triggered by the envelope icon on the survey tile.</p>\n<h3 id=\"header-24\">A new module: Portal Invitation</h3>\n<p>From now on you have the new module Portal Invitation, which is used to invite people to a portal as well as to add them to a circle. To do this, you make the following settings for module page integration: You assign a heading, select an e-mail template and a panel group to which the persons to be invited are to be<br>added by using the drop-down list. In addition, a limit is set for the maximum number of invitations that can be sent per user.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998485762450\" alt=\"14c4a1df-3e60-4ae1-ab65-924b292bcde4\"></p>\n<p>After successful integration, the Portal Invitation module can be accessed from the portal's exterior view. Clicking on the “Invite users” button opens a modal, inviting future users by entering their e-mail address, first name and surname.</p>\n<p>If you want to invite several users at the same time, you can proceed in two ways: Either you click on \"add another\", whereby further user invitations can be issued by entering the e-mail address, first name and last name, or you click on “add multiple at once”.</p>\n<p>In this case, you type in a free text field the first and last name and the e-mail address, whereby not only the first name, the last name and the e-mail address are separated by a semicolon, but two semicolons are set for the listing after each user to be invited.</p>\n<p>In addition, a circle can be selected in advance to which users who accept the invitation will be added. After the invitations have been sent, a table is created with all users who have received an invitation. It can be sorted by the column headers of the header. As long as an invitation has not been accepted, the status remains “Invited”. As soon as the user clicks on the link sent with the invitation e-mail and clicks on \"Register\" after filling in the registration form, the status changes and the user is logged in to the portal.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998529218066\" alt=\"9f1cdffb-c67b-4612-9ed6-7da10efc9080\"></p>\n<h3 id=\"header-25\">Displaying a page once after the first login</h3>\n<p>On the sub-navigation field “Settings” under the tab “Page connections” you have the possibility to define a page in the CMS area of Portals, which can be used as a welcome page after the first login. On this page you can, for example, list notes for the next steps.</p>\n<h3 id=\"header-26\">Wildcards for the Text and Multimedia module of Portals</h3>\n<p>The module Text and Multimedia, which is known from the module integration of portals, now has placeholders (#Wildcard#) in the editor that allow you to display user-related profile information and master data in the external view.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998496627602\" alt=\"866bf1de-af06-4194-a336-81be9067b88c\"></p>\n<p>You create variables on the sub-navigation field “Settings” under the tab “Profile Settings”. A list of the variables available to you can also be displayed in the exterior view by typing #showWildcards# into the input line during module integration of the Text and Multimedia module. However, you should restrict this functionality to processing and development scenarios.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998498181010\" alt=\"b04a7ee3-1f82-4bc5-8b44-cef49050573b\"></p>\n<h3 id=\"header-27\">Additional information in the circle list</h3>\n<p>To make information about the panelists available to the circle user so that they can be uniquely identified, you have the option of providing additional profile information in the CMS area of Portals.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998496259986\" alt=\"5a0515ff-c5b5-4391-a985-ddd269630346\"></p>\n<p>Proceed as follows: First you select the variables and master data to be made available as additional information in the sub-navigation field “Settings” under the tab “Profile Settings”. After you have selected the additional information and integrated the Circles module on the sub-navigation field “Pages”, you have two drop-down lists that allow you to select two u_variables from the previously provided variables, as well as a link that take you back to the field “Settings”. You also have the option to leave the field blank. Then no descriptions are stored either.</p>\n<p> </p>\n<h2 id=\"header-29\">People</h2>\n<h3 id=\"header-31\">Automated welcome email</h3>\n<p>The update rules in People have been extended. You can now define an update rule to automatically invite newly created panelists to a portal via welcome email.</p>\n<p>Under the menu item “Update rules” you make the known settings: You add a name to the rule, comment on it, select a group to receive the invitation, and under “Execution mode” you define the start time, interval type and interval value. Then select “Send mail” from the drop-down list under “Defined actions” and click on \"Save\". The page is reloaded and you set the value for the mail template to \"Invitation to participate in the portal\". You save again. The rule is now created and continues to be modified.</p>",
    "user_segment_ids": []
}