{
    "id": 20998427139346,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998427139346.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998427139346-EFS-Release-Summer-2018",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 15,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:38:50Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Summer 2018",
    "title": "EFS Release Summer 2018",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:06:54Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EN8A51AGJYEN2PM3Z5GWNH\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Portals</a>\n<ul>\n<li><a href=\"#header-3\">Name changes</a></li>\n<li><a href=\"#header-5\">Guides: the new page module of Portals</a></li>\n<li><a href=\"#header-6\">Modifications for the Action Board</a></li>\n<li><a href=\"#header-7\">Further module modifications</a></li>\n<li><a href=\"#header-8\">Multi language portals and a new role: Translation Manager</a></li>\n<li><a href=\"#header-9\">Template configuration</a></li>\n<li><a href=\"#header-10\">Miscellaneous: Sidebar, Feedback-Bubble, Profile</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-12\">Survey</a>\n<ul>\n<li><a href=\"#header-14\">Global categories</a></li>\n<li><a href=\"#header-15\">New and amended question types</a></li>\n<li><a href=\"#header-16\">New Trigger: Portal Action Trigger</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-18\">Privacy Assistant (GDPR)</a>\n<ul>\n<li><a href=\"#header-20\">Activating the Privacy Assistant and its consequences</a></li>\n<li><a href=\"#header-21\">Flagging c_ and p_ variables as personal data</a></li>\n<li><a href=\"#header-22\">Multi-Lingual consent page</a></li>\n<li><a href=\"#header-23\">Language switch</a></li>\n<li><a href=\"#header-24\">Personal data flagging</a></li>\n<li><a href=\"#header-25\">Write and read rights for the consent form</a></li>\n<li><a href=\"#header-26\">Portal registration</a></li>\n<li><a href=\"#header-27\">New filter function</a></li>\n<li><a href=\"#header-28\">New disposition code</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"header-1\">Portals</h2>\n<h3 id=\"header-3\">Name changes</h3>\n<p>Two of the page modules in Portals have been renamed. The page module called Circles is now called Groups and the Improvements module is now called Action-Board.</p>\n<h3 id=\"header-5\">\n<em>Guides</em>: the new page module of <em>Portals</em>\n</h3>\n<p>With our new page module <em>Guides</em> you are able to allow portals users to initiate a templated survey to send to specified group of people, all from the Portals interface. Much like our existing<em> Feedback Assistant</em> module,<em> Guides</em> empower your portals users; bringing feedback to their fingertips via a simple and intuitive user interface. This new module can be added to your portals through the CMS area by placing the new Guides page module on the desired page of your portal. Once you have added this new module, you can open the module configuration by clicking on the dropdown arrow. Under the configuration area you can select the panel group to which those individuals invited to participate in a Guide will be added. The additional profile settings allow you to specify two additional pieces of profile information that will be shown to the portals users when they are searching for those individuals they would like to send a Guide to. These additional pieces of information simply enhance the panelist search, making it easier to find individuals. Once you have completed the basic page module configurations, all additional configuration options can bee accessed from the new menu sub-navigation option <strong>Guides</strong>. Once you access the new <strong>Guides</strong> sub-navigation, you will be presented with the following six tabs:</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998410842002\" alt=\"image2018-10-26_10-29-21.png\"></p>\n<ul>\n<li>\n<p>Basic information</p>\n</li>\n<li>\n<p>Additional information</p>\n</li>\n<li>\n<p>Topics</p>\n</li>\n<li>\n<p>Questionnaire</p>\n</li>\n<li>\n<p>E-Mail templates</p>\n</li>\n<li>\n<p>Settings</p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998411090706\" alt=\"image2018-10-26_10-31-34.png\"></p>\n<p>Under the <strong>Basic information</strong> tab, you can provide a title for your newly added guide along with entering a description and uploading an image that will be visible to the portal’s users accessing the guide. The Title, description and picture are displayed in the guide overview area.</p>\n<p>The <strong>Additional information</strong> tab allows you to provide more details about the specific guide you are configuring, to help the end-user determine if this is the correct guide (template) that they would like to use. In this area you can provide more detailed descriptions of what the guide will measure and how it will operate. In addition to text descriptions, you can also add photos, videos and links using our new editor, to provide comprehensive details about your new guide.</p>\n<p>Under the <strong>Topics</strong> tab, you can associate your new guide with specific topics. These topics must be created first in the <strong>Topics</strong> area of the <strong>Content</strong> section of portals. You select a topic by ticking it and the can choose to display the topics alphabetically in either ascending or descending order.</p>\n<p>You use the <strong>Questionnaire</strong> tab to select the specific survey that this guide will send out. You can choose from the list questionnaires that you previously created in our <em>Project</em> module. In order to appear in the list, the project must have been set to <strong>Active</strong>. Only projects of the type <em>Personalized Survey</em> are available for <em>Guides</em>.</p>\n<p>The <strong>E-Mail templates</strong> tab is used to select the relevant mail templates that will be used in the guides workflow. You can select templates for the invitation, reminder and result e-mails.</p>\n<p>Under the <strong>Settings</strong> tab you can set the participation period for which the guide will remain active for respondents along with the minimum number of participants for the guide. The minimum number of participants setting allows you to maintain confidentiality and only make results available once a minimum number of people have responded to the guide. In this area you also define which portal role is allowed to start the guide and whether a reminder e-mail should be sent, and when. You define whether the e-mails should always be sent to all participants or whether participants who have already completed the survey will not receive any further reminder e-mails. Therefore you deactivate the option “Send reminder mails to all participants” by setting the slide switch to <strong>OFF</strong>. The manager participation setting controls whether the sender of the guide should be allowed to also respond, and a further setting controls whether the initiator of the guide should be able to send to respondents by simply entering in an email address. Lastly there are settings to determine whether a results e-mail should be sent, and where this results e-mail should direct the recipient to. You will see additional settings whereby you can specify a particular page within the portal, and can select a <em>MySight</em> project, a workbook and a view. These settings can direct people to a different dashboard than the one associated with the guide.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998395784082\" alt=\"Settings.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998385202194\" alt=\"image2018-10-26_10-43-45.png\"></p>\n<p>Once you have finished configuring your guide, you can make the guide available via your portal by publishing it.</p>\n<p><em><u>Guides</u></em><u> in the exterior view</u></p>\n<p>After all necessary settings have been made in the CMS area of portals, the new guides module can be accessed in the exterior view. The guide page module will provide a guide overview where all published guides are listed and can be initiated. The information that has been entered under the <strong>Additional information</strong> tab can be accessed by clicking the <strong>More Details</strong> link. You click on <strong>Start guide</strong> to start the guide setup, which is divided into three steps:</p>\n<ul>\n<li>\n<p>Questions</p>\n</li>\n<li>\n<p>Invitations</p>\n</li>\n<li>\n<p>Confirmation</p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998396242962\" alt=\"image2018-10-26_10-54-58.png\"></p>\n<p>In the first <strong>Questions</strong> you will be presented with an overview of the questions that will be asked to the individuals the guide will be sent to. Clicking <strong>Show questions</strong> will present the full list of guide questions. In addition, you will see the topics for this guide (that you had previously created under the Topics tab under the portals configuration). After this overview, which informs you about the key areas of the questionnaire, the second <strong>Invitations</strong> step follows.</p>\n<p>From the invitations screen it is possible to send the guide to an existing group of people or create a new group from scratch. When decided who to send the guide to, you can use the search facility to search of individual panelists by name or e-mail address, or you can search for existing groups. If creating a new group from scratch this will be created as a personal managed public group. If you wish to send the guide to people not already registered in the system, you can simply type in their email address and the respondent will automatically be created as a panelist. Please note that when creating a new group from individual panelists and/or unregistered people, this cannot at this time be combined with existing groups.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998442276626\" alt=\"Guide setup.png\"></p>\n<p>Finally, during the <strong>Confirmation</strong> step you will receive an overview confirming the number of questions included in the guide, along with which group it will be sent to. From this screen it is also possible to write a short personal message to the recipients of the guide. Once you confirm your selection the invitation emails will be sent.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998442539410\" alt=\"Confirmation.png\"></p>\n<p><u>After starting a guide</u></p>\n<p>To find out more information about the status of your guide, click on the <strong>View status</strong> button. In the overview page you can see which group was invited to take the survey, along with the current status of the survey (completed/running), and how many people have answered the survey. You also have the option to remind the group to participate, i.e. to send a reminder email, and to end the survey manually. Once the survey is complete, click the <strong>Results </strong>button to switch to the results dashboard. When a survey is complete, you can invite the group to conduct the survey again if desired.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998413922066\" alt=\"image2018-10-26_11-1-45.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998443178002\" alt=\"image2018-10-26_11-2-23.png\"></p>\n<h3 id=\"header-6\">Modifications for the <em>Action Board</em>\n</h3>\n<p>A number of enhancements have been made to our recently launched <em>Action Board</em> page module.</p>\n<p><u>E-mail templates for the </u><em><u>Action Board</u></em></p>\n<p>The selection of e-mail templates that inform about the assignment of an action, the status change of an action, the sharing of an action and the commenting of an action can now be found in the module configuration of the<em> Action Board</em>. All e-mail templates are created under the <strong>Libraries</strong> tab. The e-mail templates should be created first in the main system <strong>Libraries</strong> area and they can then be selected in page module configuration. Please note that every additional <em>Action Board</em> that will be added to an individual portal will be actually a clone of the first board added so these settings do not need to be configured more than once.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998443398162\" alt=\"image2018-10-26_11-12-5.png\"></p>\n<p><u>The archive of the </u><em><u>Action Board</u></em></p>\n<p>A new <strong>Show archived</strong> link will appear for any action board that has at least one ticket which has been archived. The column “Rating” has been added to the archive view, allowing you to see the average rating of an archived ticket. This way you can see at a glance which ticket has been rated high/low. In addition, the archived tickets can be sorted according to the average rating.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998413163538\" alt=\"image2018-10-26_11-13-50.png\"></p>\n<p><u>The overview of the </u><em><u>Action Board</u></em></p>\n<p>A new filter drop-down makes it easier to get an overview of the tickets created on the board. For example, you can use the filter function to filter your view so that you are only seeing those tickets that have been assigned to you, by selecting <strong>Assigned to me</strong> from the drop-down list. Alternatively, you can select a specific group to see all the actions that have been shared with that group. If you select <strong>All</strong>, all tickets to which you have access to will be displayed. The new search field can be used to search for actions by category, responsible person or the title of the action. You can also use this search feature in the archive view. In order to ensure you do not miss any changes made by another user to an action, a notification will be displayed at the bottom of the screen until the board has been updated. You will be informed about the following:</p>\n<ul>\n<li>\n<p>Change of ticket titles</p>\n</li>\n<li>\n<p>Moving the ticket from one column to the next</p>\n</li>\n<li>\n<p>Changing the vertical ticket order</p>\n</li>\n<li>\n<p>Deleting tickets</p>\n</li>\n<li>\n<p>Modification of ticket descriptions</p>\n</li>\n<li>\n<p>Ticket assignments</p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998413353234\" alt=\"image2018-10-26_11-18-27.png\"></p>\n<p><u>The link for tickets of the </u><em><u>Action Board</u></em></p>\n<p>It is possible to send a link in a notification e-mail that opens an action ticket directly as long as a valid session is running. To do this, you use the placeholder #detailview_link#. You can also access the link under <strong>More</strong> in the detail view of the action ticket and copy it directly into an e-mail.</p>\n<p><u>Improving the assignment of an action ticket</u></p>\n<p>The process of assigning a ticket to someone with whom you have shared the ticket has been simplified. The assignment can be made by simply clicking the edit icon by the name of the person responsible. The <strong>Assign to</strong> list will then appear, from which you can choose the new responsible person.</p>\n<p><u>Publishing of private groups by sharing of an action ticket</u></p>\n<p>Previously, when sharing an action ticket, only public groups were shown in the selection dropdown. From now on, also private groups are listed. When sharing with a private group, that group will be published and will no longer be private. This publishing of a private group needs to be confirmed through a dialog and cannot be undone.</p>\n<p><u>Maximum number of actions</u></p>\n<p>By default, the maximum number of actions that can be created is 200 per installation. If this value is exceeded, the tickets created after the 200th action ticket are hidden until the value fall below the maximum value again due to the deletion or archiving of tickets. The hidden tickets are still saved and can be archived.</p>\n<p>If you wish to increase this value, please contact support.</p>\n<p><u>Actions presented in the module </u><em><u>Activity stream</u></em></p>\n<p>The activities in the <em>Action Board</em> are now displayed in the page module <em>Activity stream</em>, so that you always have a good overview of what is happening on the <em>Action Board</em>. The stream will show changes to the tickets that are visible to you.</p>\n<h3 id=\"header-7\">Further module modifications</h3>\n<p><em><u>Portal invitation</u></em></p>\n<p>In the <em>Portal Invitation</em> page module configuration, it is now possible to assign invited participants to any or all of the following roles: moderator, survey manager or translation manager. If no role is selected the user is assigned the role <strong>Participant</strong>. You also have the option of selecting additional master data variables. By default, the variables e-mail, first name and last name are offered, however six more are additionally configurable. For each variable you can decide whether the field is required and whether it should be validated.</p>\n<p>These additional fields are presented to the portal users when they are inviting a new user to the portal. In the wizard, you can also select one of the panel-groups to which these new users are added. If you want to invite several users at the same time, use the CSV upload: CSV files can be imported by drag &amp; drop. To do this, download an import template and follow the instructions provided in the template.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998430305042\" alt=\"Portal invitation.png\"></p>\n<p><em><u>Feedback Assistant</u></em></p>\n<p>The ability to manually add participants in the <em>Feedback Assistant</em> has been modified to simplify this process. One or multiple participants can now be added by simply entering in the participants email addresses separated by comma. To use this feature, you have to tick the option “Add participants via email address only” in the module configuration.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998413773202\" alt=\"image2018-10-26_11-37-3.png\"></p>\n<p><u>Renaming and redesigning of </u><em><u>Circles</u></em></p>\n<p>Our <em>Circles</em> feature, released in Summer 2017, allowed you to create and manage your own contact lists from the participants of a portal. This feature has been renamed to <em>Groups (Portals)</em> and also redesigned. The exterior view of the <em>Groups</em> module displays the created groups in a clear overview. The groups can be created, deleted and privatized there.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998430727570\" alt=\"Groups.png\"></p>\n<p>The module can be configured in the Portals CMS. There you select which invitation template you want to send to future users and which panel group the invited persons should be assigned to. You provide two additional profile information by using variables.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998430974226\" alt=\"image2018-10-26_11-41-57.png\"></p>\n<p>The module is still accessible from our <em>People</em> module, under the Contracts sub-menu. These groups have been updated so that they no longer need to be owned by the person who created the group. It is now possible to change ownership by selecting one of the other group participants as future owner by accessing the <em>group list</em> view and then changing the group owner. The owner can edit or delete the group.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998444882834\" alt=\"image2018-10-26_11-43-22.png\"></p>\n<h3 id=\"header-8\">Multi language portals and a new role: Translation Manager</h3>\n<p>A new development that will delight many of our global customers is the additional of multi-language support for our portals. In the past if you wished to have a portal available in multiple languages, you would need to create a new portal for each of the languages you wished to make available to your users. This created a significant administration overhead and did not offer the best experience to your portal users. It is now possible to have one single portal and make it available in multiple languages.</p>\n<p>To add a new language to an existing or new portal you need to go to the subnavigation <strong>Settings</strong>, and then go to the <strong>Languages</strong> section.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998445110034\" alt=\"image2018-10-26_12-33-21.png\"></p>\n<p>In the languages section you are presented with a tabular display with the column headings: language, code, translation status, import/export, default language, publishers and delete. You click on <strong>+ Add new language</strong> to add a new language to the portal. Enter the name of the language and then select the corresponding ISO code. There is no limit to the number of languages that can be added to a portal. Once the new languages have been saved, the import and export functions will be activated.</p>\n<p>The default language for the portal is selected by checking this setting against the appropriate language, and the <strong>Publish</strong> slide switch will activate a language to make it available to portal users.</p>\n<p>In the lower area of the screen, all phrases used in a portal are listed in a table. You can search for individual phrases and add or modify translations there. To view the different languages translations, simply select the language from the <strong>Translation for</strong> drop-down list. Changes can then be made to the translations for that language and then saved against the portal, and where appropriate these can be exported and imported into another portal. The fields of untranslated phrases remain empty.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998416522642\" alt=\"image2018-10-26_12-35-38.png\"></p>\n<p>On all pages with \"public\" access rights, the language select is available. The pages will display a globe icon in the top right-hand corner of the screen, allowing the user to change the language to any of those that are currently published on the portal. Once the user is logged into the portal, they can edit their user profile and select one of the published portal languages under the new <strong>Settings</strong> tab. Any Portals user that has the role <strong>Translation Manager</strong> will also have access to the new translator mode feature, also accessible under Settings tab.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998456004242\" alt=\"image2018-10-26_12-38-12.png\"></p>\n<p>This feature can be activated by the slide switch, and once activated the user will be able to see the phrase ID alongside the translated text. This feature makes it easier for the translation owner to identify specific phrases that require translation and then they can access these and update them in the portals CMS.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998416942866\" alt=\"image2018-10-26_12-39-21.png\"></p>\n<h3 id=\"header-9\">Template configuration</h3>\n<p>As it is now possible to make projects available through portals as either Feedback Assistant templates, or Guides, we have updated the <strong>Template Configuration</strong> area available under <strong>Project Properties</strong>. There is now a “Usage” property where you can identify which of the two modules <em>Guides</em> or <em>Feedback Assistant</em>, you want to make the template configuration for. It is possible to configure a project so that it is available both through our new Guides module and our Feedback Assistant module.</p>\n<h3 id=\"header-10\">Miscellaneous: Sidebar, Feedback-Bubble, Profile</h3>\n<p>We have made it much easier for your portals users to provide quick feedback regarding their experience. Rather than relying on them to email you their feedback, you can now add a simple feedback bubble to the exterior view of the portal. This icon will appear on the bottom-left of each page of your portal, and upon clicking the icon the user will be taken to a new browser window and will be asked to complete a feedback survey that you have configured. You activate this feature in the sub-navigation <strong>Settings</strong> under the <strong>General settings</strong> tab, where you tick the option \"Show feedback bubble\". An available survey link will appear that can be replaced.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998446053010\" alt=\"image2018-10-26_12-46-59.png\"></p>\n<p><em>Portals</em> has a new navigation option. In addition to our existing tab, bar and user profile navigation, it is now possible to have a left-hand sidebar navigation on your portals. You configure this in the sub-navigation <strong>Navigation</strong> under the <strong>Sidebar</strong> tab. The sidebar is configured by simply adding the portal pages you would like to be accessible from the sidebar, in the order you would like them to appear. If you would like the sidebar to always remain visible, select the tickable option \"Menu always visible\". Once ticked, portals users will not be able to hide the sidebar navigation and it will remain visible at all times.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998446316050\" alt=\"image2018-10-26_12-48-18.png\"></p>\n<p>Under the new <strong>Settings</strong> tab, which you will find in your<strong> Profile</strong> area of the portal, you can now change your password, select your preferred language and activate the translation mode.</p>\n<h2 id=\"header-12\">Survey</h2>\n<h3 id=\"header-14\">Global categories</h3>\n<p>We have a new <strong>Categories</strong> area available within our <strong>Libraries</strong>. <strong>Libraries</strong> are accessible from the main top-right <strong>System</strong> menu. Categories allow you to create themes within your surveys/projects and can also be assigned to tickets within our <em>Action Board</em> portals module.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998446558866\" alt=\"image2018-10-26_12-55-21.png\"></p>\n<p>Once in the <strong>Categories</strong> area you can add a category using <strong>+ Category</strong>. The configuration area opens, where you assign an individual meta name, select a color and deliver a translation that is optional. The meta name is mandatory and limited to 3 to 30 characters. Umlauts cannot be used. If you want to delete a category, you must make sure that all connections have been disconnected. By clicking on the edit icon, you can find out which connections are available for a category. Questions can be assigned to a category in the questionnaire editor and action tickets in the detail view. Before you can delete a category, however, you must undo each individual connection for which the trashcan icon is available in the <strong>library</strong> area.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998418046738\" alt=\"Categories.png\"></p>\n<h3 id=\"header-15\">New and amended question types</h3>\n<p><u>Slider</u></p>\n<p>In the detail configuration of the <em>Slider</em> question type, check whether only the edge scale options should be displayed. When this setting is selected only the poles for the scale will be displayed. For example, a 5-scale question of 1,2,3,4 &amp; 5 would only display 1 and 5. This hides the other scale options, even if they have been defined.</p>\n<p>This feature is available for R<em>esponsive Layout 2</em> and <em>3</em>.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998433261586\" alt=\"image2018-10-26_12-59-33.png\"></p>\n<p><u>Dynamic answer option</u></p>\n<p>We have added a new <strong>Single response</strong> question type called <em>Dynamic answer option</em>. This question type will allow you to present a respondent with a single-response list that dynamically update based on responses given by previous respondents. This question type replies in the presence of a free text answer as part of the singleresponse list. For example, you may have a single-response question that asks a person their favorite brand of chocolate, with available answers: Cadbury, Lindt, Galaxy, Toblerone and Other. Against the other you have included a free text field (<em>Answer option + text</em>).</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998457714066\" alt=\"image2018-10-26_13-2-27.png\"></p>\n<p>The new <em>Dynamic answer option</em> type can be configured so that if a specified number of respondents enter Hersheys as their favorite chocolate, this option is dynamically added to the list of possible responses for the next respondent to answer the survey. The following settings control this new question type:</p>\n<p><strong>Treshold</strong> – this setting determines the number of respondents who need to have provided this new answer before it is added into the list of available answers. For example, we might decide that 10 people need to choose Hersheys before it is added to the list.</p>\n<p><strong>Max amount of answer options</strong> – this setting limits the number of new options that can be dynamically added to the single-response list.</p>\n<p><strong>Respect case sensitivity</strong> - this setting determines whether the case-sensitivity of a word produces a new answer option in each case.</p>\n<p><strong>Alternating rows</strong> – this setting determines whether the newly added options are displayed in the order they were dynamically added to the list, or in a more randomized order.</p>\n<p><u>Accordion matrix</u></p>\n<p>This question type allows a more accessible display of matrix questions on mobile devices. In addition to making the question more accessible on mobile devices, the nature of the layout of this question types reduces the likelihood of people straight lining their answers. Along with the settings known for a matrix question type, you will find further settings in the detailed configuration that control the structure of the question in the questionnaire view. The information icon informs you in detail about the various options.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998464390546\" alt=\"image2018-10-26_14-11-56.png\"></p>\n<h3 id=\"header-16\">New Trigger: Portal Action Trigger</h3>\n<p>It is now possible to add a new trigger to your questionnaire: the portal action trigger. This trigger is used to create an action ticket on the action board. Actions created using this trigger are generated initially in the column \"Inbox\". After you have selected this trigger, first go to the <strong>Settings</strong> tab, where you assign a title and enter a short description for the trigger. In the <strong>Detail configuration</strong> it is possible to set both the title of an action, as well as specifying the person responsible for the action and the action creator. For the action title you can either enter a hard-coded title, or more typically you can enter the variable from which you wish to pull the title of the action. For thecreator and assignee fields you can either enter the appropriate variable in the <em>survey variable</em> setting, enter a specific email-address in the fallback setting.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998458228498\" alt=\"image2018-10-26_14-14-36.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998464929042\" alt=\"image2018-10-26_14-15-18.png\"></p>\n<h2 id=\"header-18\">Privacy Assistant (GDPR)</h2>\n<h3 id=\"header-20\">Activating the Privacy Assistant and its consequences</h3>\n<p>The GDPR consent form has been separated into two sections; data retention period and consent form and only the <strong>data retention</strong> is absolutely required in order to activate a project. For existing projects, you activate the <em>Privacy Assistant </em>by checking it under <strong>Project properties</strong> and clicking <strong>Save</strong>. The survey status will then be automatically set to <strong>No further participations</strong>. This change in status remains in effect until you have configured the duration of the data retention for this survey. A convenient pop up message will confirm this and take you to simple screen where you are only required to set the data retention period. Where appropriate you can of course configure the full and complete consent form.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998403857042\" alt=\"image2018-10-26_14-23-12.png\"></p>\n<p>For new or copied projects, the <em>Privacy Assistant</em> will automatically be activated, and the survey will (depending on how it was created) be created with a status of <strong>Survey compiled</strong> or <strong>No further participations</strong>. Again, the data retention must be set before the status can be updated to <strong>Active</strong>.</p>\n<h3 id=\"header-21\">Flagging c_ and p_ variables as personal data</h3>\n<p>It is now possible to flag <strong>User-defined variables</strong> as personal data. These c_ and p_ variables are created under the the User-defined variables tab accessible from the <strong>Project properties</strong> under the main Survey menu. When deleting a participants data, the variables will be set to null.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998404078866\" alt=\"image2018-10-26_14-29-31.png\"></p>\n<h3 id=\"header-22\">Multi-Lingual consent page</h3>\n<p>In addition to the new subdivision of the GDPR area into <strong>Data retention period</strong> and <strong>Consent form</strong>, the consent form can now be configured in the different languages the survey is available in. Each survey language is configured individually.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998459106962\" alt=\"image2018-10-26_14-31-35.png\"></p>\n<p>The colored background for the two sections indicates to what extent the two areas have been configured. The data retention period will turn green as soon as you specify a duration, either<strong> Exact</strong> or <strong>Unlimited</strong>. The new “Status” column shows you which languages have already been configured. These are marked either red (not configured) or green (configured). The overall status of the consent form results from the configuration status of the individual languages. Three statuses can be displayed in color:</p>\n<ul>\n<li>\n<p><span style=\"color: #ff0000;\">Red</span>: Neither the default language nor any of the other languages have been edited.</p>\n</li>\n<li>\n<p><span style=\"color: #ffcc00;\">Yellow</span>: The default language has been configured, but at least one of the other languages has not been configured.</p>\n</li>\n<li>\n<p><span style=\"color: #008000;\">Green</span>: All languages have been edited.</p>\n</li>\n</ul>\n<p>The project can be activated even when the consent form is red.</p>\n<h3 id=\"header-23\">Language switch</h3>\n<p>The new language switch is available on the GDPR consent form with <em>Responsive Layout 2</em> and <em>3</em>. As soon as the switch has been activated under the <strong>Internal organizatio</strong>n tab in the survey settings, it will be displayed on the approval page and not only in the questionnaire of this control element. Participants can select the desired language on the approval page. If the page is not available in the selected language, it will be displayed in the default language that is used as a fallback.</p>\n<h3 id=\"header-24\">Personal data flagging</h3>\n<p>In order to make it easier for you to see which participant variables and questions in your project are flagged as personal data we have added a new menu option when viewing the GDPR settings. By clicking on the menu item <strong>Data retention period</strong> or <strong>Consent form</strong> you will reach the GDPR settings, where you will find an overview area under the menu item “Personal data flagging“.</p>\n<h3 id=\"header-25\">Write and read rights for the consent form</h3>\n<p>Your read/write access to the different language consent forms is determined by your language rights for the project the consent form is associated with. If you have only read access to a given survey languages (based on the team your user is assigned to) you will only be able to view the consent form, whereas if you have write access to the survey language you will be able to edit and update the consent form.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998435158162\" alt=\"image2018-10-26_14-38-46.png\"></p>\n<h3 id=\"header-26\">Portal registration</h3>\n<p>It is now possible to obtain consent to process personal data from new users registering on your portals. When this setting is configured, the portal login dialog has a second checkbox under the<strong> Register</strong> tab.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998435383570\" alt=\"image2018-10-26_14-40-8.png\"></p>\n<p>You activate this under General settings in the portal CMS by ticking the option “Activate Privacy consent form”. In the module People under <strong>Panel configuration</strong> you will find the menu item “Consent form”, where you can create the consent form for the purpose of registering a panelist. In order to be able to use this feature to capture the consent of future portal participants, you must configure the consent form in default language, otherwise the checkbox will not be displayed. One configuration applies to all portals. This feature is available both for the login dialog via the portal and for inviting other panelists via e-mail.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998420696978\" alt=\"image2018-10-26_14-41-27.png\"></p>\n<h3 id=\"header-27\">New filter function</h3>\n<p>To make it easier for you to maintain your consent forms, we have added a simple filter function under the menu item Consent form templates in the main<strong> Libraries</strong> area. This language identifier allows you to filter the templates of the consent forms according to the language.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998420940562\" alt=\"image2018-10-26_14-43-5.png\"></p>\n<h3 id=\"header-28\">New disposition code</h3>\n<p>Participants who have one of the disposition codes 20, 21, 22 and 23 will receive the disposition code 43 after deletion of their personal data. The purpose of this new disposition code is that participants who are in an 'intermediate state' such as 'participant is responding' (disposition code 21) can no longer participate in the survey after the deletion of their data.</p>",
    "user_segment_ids": []
}