{
    "id": 20998469417490,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998469417490.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998469417490-EFS-Release-Spring-2018",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 16,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:41:27Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Spring 2018",
    "title": "EFS Release Spring 2018",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T08:52:48Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EN88RQCSDD1Y9XYP4N4H5R\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">EFS Portals</a>\n<ul>\n<li><a href=\"#header-3\">The Improvements module: To improve the improvement</a></li>\n<li>\n<a href=\"#header-5\">The page integration of the new module and the first steps</a>\n<ul>\n<li><a href=\"#header-7\">The improvement ticket and the detail view</a></li>\n<li><a href=\"#header-8\">The share function</a></li>\n<li><a href=\"#header-9\">Adding categories</a></li>\n<li><a href=\"#header-10\">The comment function</a></li>\n<li><a href=\"#header-11\">Evaluation of an improvement</a></li>\n<li><a href=\"#header-12\">Archiving an improvement</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<a href=\"#header-15\">EFS Survey, MySight and People</a>\n<ul>\n<li>\n<a href=\"#header-17\">E-mail notification after the export is completed</a>\n<ul>\n<li><a href=\"#header-19\">Export templates</a></li>\n</ul>\n</li>\n<li><a href=\"#header-21\">List-Unsubscribe Header</a></li>\n<li><a href=\"#header-22\">Five variables for the Extended Search</a></li>\n<li><a href=\"#header-23\">Convenient folder structure</a></li>\n<li><a href=\"#header-24\">New table structure</a></li>\n<li><a href=\"#header-25\">Grouping filters for the export of the panel data</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-27\">GDPR: The Privacy Assistant</a>\n<ul>\n<li><a href=\"#header-29\">Role distribution</a></li>\n<li><a href=\"#header-30\">Create a new project</a></li>\n<li><a href=\"#header-31\">Subsequent activation of the Privacy Assistant</a></li>\n<li><a href=\"#header-32\">Configuration of the Privacy consent form</a></li>\n<li><a href=\"#header-33\">Libraries: Create consent form templates</a></li>\n<li><a href=\"#header-34\">The flagging of questions and variables as personal data</a></li>\n<li><a href=\"#header-35\">The privacy consent form preceding the survey</a></li>\n<li><a href=\"#header-36\">The portability of personal data</a></li>\n<li><a href=\"#header-37\">The deletion of personal data</a></li>\n</ul>\n</li>\n</ul>\n<div class=\"expand-macro\"> </div>\n<h2 id=\"header-1\">EFS Portals</h2>\n<h3 id=\"header-3\">The Improvements module: To improve the improvement</h3>\n<p>To initiate the improvement of engagement, the traditional approaches have been evolved. This development presents the current solution for such applications, the Action Planner, with a challenge. This module uses an organizational structure that restricts the actions to hierarchically coordinated actions and proves inflexible when teams are dynamically assembled. The new improvements module is designed for another use cases. By using the share function, fluctuating team compositions are possible and a commentary function and a lean evaluation option provide the key to sustainable commitment. The measures enacted from above will be replaced by the active cooperation.</p>\n<h3 id=\"header-5\">The page integration of the new module and the first steps</h3>\n<p>The page module integration in the CMS area of Portals finds no trouble: You place the module Improvements on a page and enter a heading. After that the module is already available in the exterior view. You use the button “Export list” to export important information in an excel list. The list contains the information of the persons who created the improvement, with whom it is shared and who is responsible. The exterior view of the user interface is clearly arranged and easy to handle. The new module offers you a search function and a board that is equipped with the columns “Inbox”, “Ongoing” and “Done”. The three columns help you to document the progress of a ticket. An improvement ticket is created by clicking on the button “Create improvement”. The corresponding ticket is generated in the column “Inbox”. This is furnished with a catchy title by you before the work starts. You sort the tickets horizontally and vertically via drag &amp; drop. Initially, the tickets can be moved back and forth as desired. The improvements are always in the same status for you and every other user.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998481388818\" alt=\"0ffef7c3-ef80-4a4d-b888-4ae49831a48c\"></p>\n<h4 id=\"header-7\">The improvement ticket and the detail view</h4>\n<p>Each improvement ticket has two icons on the right side of the ticket. They allow a quick orientation, i.e. whether the improvement is already shared and who the person responsible is. Clicking on the<br>ticket or its title gives you access to the detail view. There you share the Improvement with Circles and users who will work on it together, and you also equip the Improvement with a topic in which you can participate by means of the comment function. Any hierarchy, such as an organizational structure, is omitted. Besides you designate one of the users as the person responsible (assignee) by assigning the ticket to her or him.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998492138130\" alt=\"1501777d-bcff-4b2f-88ea-efb86c046f5f\"></p>\n<p>If you want to be the person responsible (assignee), you use the more option to assign yourself the ticket. Another setting option, regarding improvements, can be found on the profile page. Here you can determine what type of notification, push and/or e-mail you want to receive for what change to an improvement shared with you or for which you are responsible. You can also disable any notification. </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998523777298\" alt=\"bf663789-c5d7-4689-af41-0512768d3d5a\"></p>\n<h4 id=\"header-8\">The share function</h4>\n<p>To keep the share function simple, a distinction is now made between private and public circle. For new circles to be created, but also for existing ones, you deter- mine now whether they are private or public. Circles that have been published cannot be privatized. The default setting for each circle is: private.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998476027922\" alt=\"de272add-b714-4b6c-8556-77ef10b32281\"></p>\n<p>They share improvements with all public circles and with the panellists who have access to the portal. Under Shared with you can find out with whom the Improvement is shared, and you can revoke your choice if necessary.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998523154066\" alt=\"32155bbd-a3d7-4af7-b8f1-2906469cd3e2\"></p>\n<p>From the number of panellists you share the improvement with, you assign the improvement to one or another, making the person responsible. This choice can also be revoked, although every improvement requires a responsible person.</p>\n<h4 id=\"header-9\">Adding categories</h4>\n<p>For each improvement you add up to three categories, which you can create in the CMS area of portals on the sub-navigation field Content under <strong>Topics</strong> tab. The colors selected for the categories appear on the Improvement-Ticket. Subcategories that you also create in the CMS area of Portals are not supported currently.</p>\n<h4 id=\"header-10\">The comment function</h4>\n<p>In the detail view you comment on an improvement. A profile picture, name and surname are displayed. By clicking on name or profile picture you will be forwarded to the profile. The time of the comment is also displayed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998462813330\" alt=\"6d411044-fa23-4629-bef8-8c614caceac2\"></p>\n<p>Besides the possibility to enter a text, paste a video link and upload a photo, comments can be answered. If you have activated it, you will be notified by e-mail or push notification when an improvement has been commented on.</p>\n<h4 id=\"header-11\">Evaluation of an improvement</h4>\n<p>After moving an improvement ticket into the column \"Done\", you have the possibility to rate it by clicking on the button \"Evaluate\" visible only in this column. In the detail view you will now find a scale<br>from 1 to 5 on which you can rate the improvement. The rating must be confirmed. Once a user has rated a ticket, it can no longer be removed from the \"Done\" column.</p>\n<h4 id=\"header-12\">Archiving an improvement</h4>\n<p>An improvement is archived either automatically after all users have rated it, or manually by clicking on \"Archive\" under the more option. Tickets that have been archived can only be commented. Other functions are no longer available. Improvements cannot be reactivated either. The archived improvements can be hidden or displayed. If you decide to display archived improvements, the board view changes and an archive table is displayed with the column headings \"Title\", \"Person Responsible\" and \"Shared\". You determine how many improvements per page are listed in the table. You use the information icon to jump to the detailed view.</p>\n<h2 id=\"header-15\">EFS Survey, MySight and People</h2>\n<h3 id=\"header-17\">E-mail notification after the export is completed</h3>\n<p>In the export settings, check whether or not you want to receive an e-mail notification after completion of the export. This feature is only available for the new export.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998475213458\" alt=\"2fe96f1b-28ec-41de-a6d7-b16811dc472f\"></p>\n<h4 id=\"header-19\">Export templates</h4>\n<p>To reuse export templates, tick in the export menu whether these templates should also be part of the export. The template is then available for copying and import. This feature is only offered for the new export.</p>\n<h3 id=\"header-21\">List-Unsubscribe Header</h3>\n<p>E-mail templates can be provided with a link that allows users to unsubscribe from automatic email messages within their own email client or provider.</p>\n<p>Check the option \"List-Unsubscribe Header\" in the \"Advanced mail settings\" and paste a link or a header. You have the following options for the input field:</p>\n<p>#unsubscribe_survey#: Link in the e-mail that deactivates further e-mails for this survey.</p>\n<p>#unsubscribe_global#: Link in the e-mail that deactivates further e-mails for each survey.</p>\n<p>By entering a valid URL you create a link to the corresponding website.</p>\n<h3 id=\"header-22\">Five variables for the Extended Search</h3>\n<p>Since the winter release, the menu item “Sample” available for the project type \"Panel survey\" has had a second tab: “Search in all samples”. If you call this tab, a free text field search and a table with the column headings “First name”, “Last name”, “E-mail”, “Panel status”, “Code”, “Mails sent”, “Status”, “Date of first invitation” and “Last access” are displayed. With the Extended Search you can now add up to five variables, which you can select by drop-down list. To further refine the search, you define a specification for each added variable. The specification is added to the table.</p>\n<h3 id=\"header-23\">Convenient folder structure</h3>\n<p>Due to the restructuring of the folder structure, it is now easier for MySight users to understand and use MySight folders in Tableau. Folders are created and the variables are grouped in these folders.</p>\n<h3 id=\"header-24\">New table structure</h3>\n<p>Now MySight has a five-level table structure with unique labels. The column headers are: QuestionID, QuestionTitle, QuestionSubtitle, ResponseOption and EXT_Variable.</p>\n<h3 id=\"header-25\">Grouping filters for the export of the panel data</h3>\n<p>In the People module, you can create grouping filters now to filter panel data during export. You use the conditions you have specified. A group does not have to exist. The condition is created under: People -&gt; Groups -&gt; Grouping filters –&gt; Filter conditions. You select the desired grouping filter in the export settings.</p>\n<h2 id=\"header-27\">GDPR: The Privacy Assistant</h2>\n<h3 id=\"header-29\">Role distribution</h3>\n<p>The idea that all the world is a stage where actors have their exits and their entrances, will be in your head from the May 25th, 2018 at the latest, when you will have to act as a data controller. As of this date, the General Data Protection Regulation (GDPR) applies, which gives the data subject, i.e. the person whose data are processed, some rights. In order to ensure that your data processing complies with this welcome regulation, the Privacy Assistant has been implemented in EFS Survey, which both adds the necessary features to known work steps and adds new steps.</p>\n<h3 id=\"header-30\">Create a new project</h3>\n<p>The step Create project has been modified for the project types “Anonymous survey”, “Personalized survey” and “Employee survey”. As part of this step, the Privacy Assistant can be activated for each of the three project types. If the check mark for the Assistant is set and the project is created, a new step is necessary to create the questionnaire: the configuration of the privacy consent form. If you want to activate the Privacy Assistant for an existing project, you can also check it subsequently. The layouts Responsive Layout 3 and 2 are supported. The Privacy Assistant is already activated by default to meet the \"Privacy by default\" requirement.</p>\n<p>You can also disable the assistant by unchecking it.</p>\n<h3 id=\"header-31\">Subsequent activation of the Privacy Assistant</h3>\n<p>Under the \"General Options\" tab in the project properties, you tick the Privacy Assistant to activate it for existing projects. The Privacy Assistant, which can only be activated subsequently for existing projects, only applies to the surveys that are started after editing and saving the</p>\n<p>consent form, for which approval must be given for participation.</p>\n<h3 id=\"header-32\">Configuration of the Privacy consent form</h3>\n<p>Once the Privacy Assistant has been activated for a new or existing project, the next step is to obtain the<br>consent of informed participants for the data processing. You configure a privavy consent form not only to obtain the consent of the participants, but also to inform them about the most important privacy information such as the name of your company (controller), the contact details, the controller’s representative or the type of personal data and its use.</p>\n<p>To configure this page, follow these steps: Use the drop-down list to select a language. The default language of the survey is set by default. You write a welcome message. Placeholders and known text formats can be used for this purpose. Then you can use a template created in the libraries for the consent form. The selection of the templates that are displayed depends on which language you have selected previously. You use the following text field to inform about the purpose of the data processing. No content specification are made to you. Finally, you specify how long the data is retained. You can make your entry in years, month or days. You do not specify an expiry date by ticking \"Unlimited\" and writing an explanatory text for unlimited data retention. The disposition code 42 is assigned to the participants who do not give their consent.</p>\n<h3 id=\"header-33\">Libraries: Create consent form templates</h3>\n<p>You do not have to configure the privacy consent form for each project anew. Instead, you create templates in the Libraries, which you use as required when creating a privacy consent form. Pre-filled forms including the most common applications can also be found there, so that you have GDPR-compliant consent forms by means of minor but indispensable adjustments to your project conditions. The configuration is the same as in the questionnaire editor. When you create the consent page in the questionnaire editor you select the language first, so that the selection of the consent form is automatically limited to those with the matching language. Then you assign a name. In the text field, you enter the purpose for which the data is processed. By means of the following fields you inform the participant about the privacy information.</p>\n<h3 id=\"header-34\">The flagging of questions and variables as personal data</h3>\n<p>The creation of questions and participant variables has also been modified by giving you the<br>option for each question or variable you create: “Flag question as personal data” respectively “Flag as personal data”. In addition to the option of marking questions independently as personal data, question types 141 to 144, i.e. those that have a free text field, are marked as personal data by default. This setting can be deactivated. With the new icon, padlock, you can see which questions of the questionnaire have been marked as personal data or deselect them again. The selections cannot be removed for the following variables that have already been marked as personal data in the default settings: u_account, u_email, u_firstname, u_name, u_street, u_zip, u_city, u_address (all), u_phone, u_mobile, u_mobile2, u_www, u_gender, and panel_contact. The following participant data are unchangeably marked as personal data: u_email, u_firstname, u_name, u_mobile, u_gender, remote_addr, participant_latitude, participant_longitude, and remote_host. For the variables of the system users these are: u_account, u_firstname, u_name, u_email, u_mobile, u_gender, u_street, u_zip, u_city, u_country, u_phone, u_mobile2, and u_www. For the Org user these are: u_firstname, u_name, u_email, and u_gender.</p>\n<h3 id=\"header-35\">The privacy consent form preceding the survey</h3>\n<p>The privacy consent form precedes the survey and is structured as follows for the potential survey participants: After the welcome message, they read the text informing about the purpose of the data processing. The contact data of the controller follows. By means of a link they can then call up further privacy information and agree on the basis of the given information. The survey is started by clicking the corresponding button. The link “I don’t want to participate” gives those who do not wish to give their consent the opportunity to do so. However, before the participants finally leave the privacy consent form, they must confirm their rejection. The privacy consent form has the language switch, so that the survey language can be changed on this page.</p>\n<h3 id=\"header-36\">The portability of personal data</h3>\n<p>If a data subject requests you as a data controller to view the personal data collected about him or her, please contact Tivian. You provide the code and/or e-mail address of this subject and Quesback will provide you with an overview of the personal data concerning this subject in a common and readable format.</p>\n<h3 id=\"header-37\">The deletion of personal data</h3>\n<p>In principle, personal data will be deleted at the end of the retention period specified for a project. It is also possible for the data subject to contact the data controller with the request for data deletion. You pass on the e-mail address and/or code of the participant who wishes to be deleted to Tivian. In this way, the participant can be identified and deleted from the system. One way of independently deleting personal data of all participants in a project can be found in the survey menu under \"Text and Validation\", where you can click on the \"Delete personal data\" button via the \"Reset survey\" item. The personal data of all participants who have a disposition code higher than 12 within the scope of the project will be deleted. The deleted data no longer appear in MySight after automatic synchronization. These are removed from the existing dashboards. The deleted personal data can no longer be found in the detailed view of a project, but also not in the corresponding participant lists.</p>",
    "user_segment_ids": []
}