{
    "id": 20998534492562,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998534492562.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998534492562-EFS-Release-Fall-2017",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 18,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:44:05Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Fall 2017",
    "title": "EFS Release Fall 2017",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T08:45:51Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EJYNVYNZ3Z3W5R2K4B4261\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Survey</a>\n<ul>\n<li>\n<a href=\"#header-3\">Responsive Layout 3</a>\n<ul>\n<li><a href=\"#header-5\">Accessibility</a></li>\n<li><a href=\"#header-6\">Prequalification Trigger</a></li>\n<li><a href=\"#header-7\">Additional disposition codes</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<a href=\"#header-9\">Portals</a>\n<ul>\n<li><a href=\"#header-11\">Feedback Assistant</a></li>\n<li><a href=\"#header-12\">Template configuration in personalized project</a></li>\n<li><a href=\"#header-13\">Portals module Feedback Assistant Overview – filtering, searching, sorting</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-15\">Report Manager</a>\n<ul>\n<li><a href=\"#header-17\">Requirement profiles</a></li>\n<li><a href=\"#header-18\">The Report Definition</a></li>\n<li><a href=\"#header-19\">The mapping</a></li>\n<li><a href=\"#header-20\">The report order</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-22\">Updates for the Report Manager</a>\n<ul>\n<li><a href=\"#header-24\">Page conditions</a></li>\n<li><a href=\"#header-25\">Rights and roles management</a></li>\n<li><a href=\"#header-26\">A new column in the report order table</a></li>\n<li><a href=\"#header-27\">Report order management and control</a></li>\n<li><a href=\"#header-28\">Improvements for the tables: refresh button and fixed header</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"header-1\">Survey</h2>\n<h3 id=\"header-3\">Responsive Layout 3</h3>\n<p>Our new standard layout for surveys named “Responsive Layout 3” is now available.</p>\n<p>The preselected layout button for creating a new project was replaced respectively, so “Responsive Layout 2” is no longer selectable directly. Via the button “My layouts”, individualized templates based on “Responsive Layout 2” will remain selectable though.</p>\n<p>Old layouts which were created individually for “Responsive Layout 2” are not applicable to “Responsive Layout 3” and are therefore not selectable per default.</p>\n<p>If you would like to keep on working with “Responsive Layout 2” as standard layout, your Tivian contact person will reset your layout configuration to the previous version and deactivate “Responsive Layout 3”.</p>\n<p>Surveys created with the layout template of “Responsive Layout 3” adapt themselves dynamically to different display sizes:</p>\n<ul>\n<li>\n<p>Wide Screen - Desktop</p>\n</li>\n<li>\n<p>Tablet</p>\n</li>\n<li>\n<p>Mobile</p>\n</li>\n</ul>\n<p>All question types implemented so far are supported by “Responsive Layout 3”.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998568307474\" alt=\"a27ff9cc-0267-4122-a33e-2dac182f7d62\"></p>\n<h3 id=\"header-5\">Accessibility</h3>\n<p>The new standard layout for Survey “Responsive Layout 3” contains major improvements in the area of accessibility.</p>\n<p>All standard question types are created barrier-free, meaning that each page can be captured, structured and read by a screen reader software and be completely controlled by keyboard (via tab and arrow keys).</p>\n<p>Complex question types (Hotspot, Images) are not necessarily created barrier- free, since these rely on further descriptions of the visible image by the survey creator for example.</p>\n<h3 id=\"header-6\"><em>Prequalification Trigger</em></h3>\n<p>With the <em>Prequalification Trigger</em>, new panelists can be generated from anonymous surveys.</p>\n<p>These panelists are generated through survey variables. Entering the e-mail address is mandatory.</p>\n<p>To use this feature, the panel module must be active.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998560975378\" alt=\"2efb7575-7178-4306-9339-914d3f2a6188\"></p>\n<h3 id=\"header-7\">Additional disposition codes</h3>\n<p>New disposition codes are available enabling a more precise classification of survey participants. These additional codes for classification can be assigned on final pages or through customizing.</p>\n<p>The new disposition codes behave like existing disposition codes:</p>\n<ul>\n<li>\n<p>Screenouts – codes 38, 39 and 40 behave like code 37. Classification example: Quality screenout. Labels: Custom Screenout 1, Custom Screenout 2, Custom Screenout 3.</p>\n</li>\n<li>\n<p>Completes – codes 33 and 34 behave like codes 31 and 32. Classification example: Complete, high quality. Labels: Custom completed 1, Custom completed 2.</p>\n</li>\n<li>\n<p>Final-not-participated – codes 18 and 19 behave like code 15. Classification example: blacklisted. Labels: Custom unavailable 1, Custom unavailable 2.</p>\n</li>\n<li>\n<p>Non-final-not-participated – codes 16 and 17 behave like codes 11 and 12. Classification example: Has opened e-mail. Labels: Reserved 1, Reserved 2.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-9\">Portals</h2>\n<h3 id=\"header-11\"><em>Feedback Assistant</em></h3>\n<p>The module <em>Feedback Assistant </em>(formerly named <em>On-Demand Guided) </em>for creating template-based ad hoc surveys was completely revised and is now available in an extended scope.</p>\n<h3 id=\"header-12\">Template configuration in personalized project</h3>\n<p>The new template configuration for <em>Feedback Assistant </em>can be found in the respective project under “Project properties” and is divided into different areas.</p>\n<p>The access to each template configuration is controlled via the rights and role system of EFS. EFS administrators with respective rights can extensively configurate each personalized project as templates for use and choice within the module <em>Feedback Assistant</em>.</p>\n<p><strong>Basic information</strong></p>\n<p>Here, administrators define a title as well as a description and a background image to make your template in the module <em>Feedback Assistant </em>visible.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998560751506\" alt=\"34729a45-116e-4054-a724-233a0f105765\"></p>\n<p><strong>Synchronizing panelist data</strong></p>\n<p>Via the new functionality “Synchronize panelist data”, you have the possibility to keep the data of panelists as participants of <em>Feedback Assistant </em>surveys up- to-date at all times.</p>\n<p><strong>Selecting and creating context variables</strong></p>\n<p>Select or create variables you want to offer to the survey manager within the module <em>Feedback Assistant </em>for free definition. Accordingly selected and filled variables will be available for evaluation in the dashboard afterwards.</p>\n<p><strong>Selecting panelist variables</strong></p>\n<p>If panelists take part in your survey, here you can select the panelist specific variables you want to be available for evaluation in the dashboard of the respective <em>Feedback Assistant </em>survey for further use.</p>\n<p><strong>Selecting manager variables</strong></p>\n<p>Master data variables which are solely allocated to the respective survey manager initiating the <em>Feedback Assistant </em>survey via the respective module in Portals can be selected in this section and appended to the template for later evaluation in the dashboard.</p>\n<p><strong>Allocating the template to certain portals</strong></p>\n<p>By selecting certain portals, you have the possibility to control in which portals your template will be available within the module <em>Feedback Assistant</em>.</p>\n<p><strong>Defining mail templates for invitations and reminders</strong></p>\n<p>You have the possibility to allocate mail templates of type “Projects” to the template to be configured, for invitation mails as well as reminder mails for participants of the <em>Feedback Assistant </em>survey.</p>\n<h3 id=\"header-13\">Portals module <em>Feedback Assistant </em>Overview – filtering, searching, sorting</h3>\n<p>On the overview page of the module <em>Feedback Assistant</em>, you can now search for created <em>Feedback Assistant </em>surveys, filter the status of the surveys and sort the view by creation date.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998537004050\" alt=\"07953dd2-e8b2-4af4-9273-62b981880998\"></p>\n<p><strong>List of participants</strong></p>\n<p>By clicking on the banderole in the middle of the tile or optionally on the list icon, you get to the list of participants displaying the invitation status of survey participants in an overview. Also, you can export participants from here.</p>\n<p><strong>Copying and editing</strong></p>\n<p>In the context menu of each tile, the menu items “Copy” and “Edit” can now be found to edit created <em>Feedback Assistant </em>surveys subsequently or to make a copy of the tile.</p>\n<p><strong>Adding participants</strong></p>\n<p>From now on, you can additionally invite single panelists from your <em>People </em>module to <em>Feedback Assistant </em>surveys.</p>\n<p><strong>HTML preview for invitations and reminders</strong></p>\n<p>With mail templates of the formats “text + HTML” or “HTML”, you now have the possibility to show the rendered HTML e-mail in a preview.</p>\n<p><strong>Configuring and sending reminder mails</strong></p>\n<p>The new menu item “Remind” enables you to select a mail template defined via template configuration as well as to set the time of dispatch of reminder mails (manually or controlled by a timer). After the dispatch of invitation mails, the manual dispatch is triggered by clicking on the envelope symbol of the respective tile in the overview.</p>\n<p><strong>Limiting the creation of </strong><em><strong>Feedback Assistant </strong></em><strong>surveys</strong></p>\n<p>To avoid over-surveying for example, you now have the possibility to limit thenumber of permitted surveys within a certain period of time.</p>\n<p> </p>\n<h2 id=\"header-15\">Report Manager</h2>\n<h3 id=\"header-17\">Requirement profiles</h3>\n<p>The <em>Report Manager </em>is the new product of the Employee portfolio. Rather unpretentious in the appearance, its advantages are on the side of the report generation, which can be carried out in a very large amount. But its qualities are not limited to such a scenario. </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998552416402\" alt=\"43f37ae1-5736-41f4-a1ae-11adeb95e3f4\"></p>\n<p>By the means of this new module, you evaluate the results of an employee survey that covers the many different departments of a company and you assemble those in reports instructively.</p>\n<h3 id=\"header-18\">The Report Definition</h3>\n<p>The Report Definition that underlies each report of an order is the basis for the report generation. So you are working at a very abstract level. Finally, an order can contain thousands of reports and each of these reports is addressed to a different department. Nevertheless, you depict the individual shade of each department. To show how this works, you can emphasize two stations on the way to the completed reports: the mapping and the report order.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998566550290\" alt=\"c29b8273-bfe7-43f5-a988-a7366b9d1fdd\"></p>\n<h3 id=\"header-19\">The mapping</h3>\n<p>The mapping is conducive to create a path for the data space query (DSQ). You define for which departments values are determined without first having to specify which departments are involved. The paradigmatic use case can serve as an illustration: If you want to generate reports for all departments that show the comparison of the regarding unit with the next higher one in relation to any value, it is sufficient to use the two units elements focus unit and level-up comparison unit and define the properties or result types that you want to query.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998505219474\" alt=\"2ee3de3e-8f5d-45b3-8ebf-23e58ede1edc\"></p>\n<h3 id=\"header-20\">The report order</h3>\n<p>In the first step of the report order process, you determine the unit that is to function as the focus unit. As a consequence, the abstract relation to the next higher unit is automatically transformed into a concrete one. Besides, the report type “Standard Report” allows you an easier workload. You are able to hook “Include subunits” and order reports for all units that are located in the organizational structure below the unit you selected. They will be functioned as the focus unit of these reports.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998558913682\" alt=\"b07d3fdc-a238-4dc5-be3b-e8f29b4811a3\"></p>\n<p>According to this, the relation to the next higher unit is respectively transferred differently. But you don’t have to adjust it manually.</p>\n<p> </p>\n<h2 id=\"header-22\">Updates for the Report Manager</h2>\n<h3 id=\"header-24\">Page conditions</h3>\n<p>To guarantee a higher standard of anonymity and to present the reports in a scope that is tailored to the addressed unit, you define the page conditions for each page of the report.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998558759186\" alt=\"8a79d15b-654e-4973-8168-f7cafb007c79\"></p>\n<p>You can use a page condition to determine the conditions under which the respective page is included in the report or not. To define a page condition, you pick a DSQ (Data Space Query), select the desired set operator from the six available set operators (=, !=, &gt;,&gt;=, &lt;,&lt;=) and enter the reference value. Words and numbers can be used as a reference value. If you select “Metaname” or “Label” as unit property or “Label” as a scale property, you use the set operators = or != to be able to enter in the reference value field the label or the metaname. You are able to deactivate a page pointedly because you deactivate the page for a specific unit.</p>\n<h3 id=\"header-25\">Rights and roles management</h3>\n<p>In the role management of the Data Voyager, you hook the right to create, edit and delete page conditions for the roles “Admin” and “Analyst”.</p>\n<p>You hook the access right to the elements of the page conditions for the roles “Admin”, “Analyst” and “Reader”. These three roles are then given the right to view defined page conditions.</p>\n<p>The following use cases are worth mentioning:</p>\n<ul>\n<li>\n<p>The user can view, create, edit and delete page conditions in the role of “Admin” or “Analyst” if the following rights have been activated or deactivated in the role management of the <em>Data Voyager</em>:</p>\n<ul>\n<li>\n<p>Access to elements of the conditions is disabled or enabled.</p>\n</li>\n<li>\n<p>Report management is activated.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The user cannot see, create or edit the page conditions in the roles</p>\n<p>“Admin”, “Analyst” and “Reader” if the following rights have been deactivated in the role management of the <em>Data Voyager</em>:</p>\n<ul>\n<li>\n<p>Access to elements of the conditions is disabled.</p>\n</li>\n<li>\n<p>Report management is deactivated.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The user can view the page conditions in the roles “Admin”, “Analyst”</p>\n<p>and “Reader” but cannot create, edit and delete them if the following rights have been activated or deactivated in the role management of the <em>Data Voyager</em>:</p>\n<ul>\n<li>\n<p>Access to elements of the conditions is enabled. o Report management is deactivated.</p>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"header-26\">A new column in the report order table</h3>\n<p>The report order table (under the tab report orders) obtains the new column “Order State”. By the means of this update, it is possible to depict the four different order statuses clearly:</p>\n<ol start=\"1\">\n<li>\n<p>Created</p>\n</li>\n<li>\n<p>In Progress</p>\n</li>\n<li>\n<p>Done</p>\n</li>\n<li>\n<p>Cancelled</p>\n</li>\n</ol>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998519872530\" alt=\"bf63a5d3-6ad0-471f-86ab-14ae596733ef\"></p>\n<p>Each order is initially set to the status “Created”.</p>\n<h3 id=\"header-27\">Report order management and control</h3>\n<p>The report order management gives you direct access to the processing of an order. This saves you time, especially in the case of orders that contain large quantities of reports to be generated. If a report definition turns to be in need of correction, the report order management allows you to cancel and to delete the corresponding order. Of course, you are able to pause an order and check any possible changes before placing it. You continue the processing with “Resume”.</p>\n<p>By mouse over, the icon available in the respective order status appear in the row of the report order table. Not all actions are available in each status. Accordingly, the icons of the non-executable actions are not displayed. All in all, you have the following actions:</p>\n<ul>\n<li>\n<p>Pause</p>\n</li>\n<li>\n<p>Resume</p>\n</li>\n<li>\n<p>Cancel</p>\n</li>\n<li>\n<p>Delete</p>\n</li>\n</ul>\n<h3 id=\"header-28\">Improvements for the tables: refresh button and fixed header</h3>\n<p>The report table, the report order table and the report distribution table obtain a refresh button.</p>\n<p>A scrolling header provides a better overview of the report order table and the report distribution table: the header of the table remains in screen when you scroll.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998504254610\" alt=\"6ce65dfc-b1dc-44ea-912c-d21db05d99c4\"></p>",
    "user_segment_ids": []
}