{
    "id": 20998088089106,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/20998088089106.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20998088089106-EFS-Release-Fall-2019",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 10,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-27T13:25:51Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Fall 2019",
    "title": "EFS Release Fall 2019",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:16:17Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EP741TRV19F50HN8TN2Q41\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Portals: Platform Enhancements</a>\n<ul>\n<li>\n<a href=\"#header-3\">E-mail and Push Notifications</a>\n<ul>\n<li><a href=\"#header-5\">Look &amp; Feel</a></li>\n<li><a href=\"#header-6\">Activity Tracking: A New Portals Page Module</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<a href=\"#header-8\">Guides Enhancements</a>\n<ul>\n<li><a href=\"#header-10\">Suggested Group (Guide Setup)</a></li>\n<li><a href=\"#header-11\">Additional Questions Remain Activated</a></li>\n<li><a href=\"#header-12\">Additional Questions - Description of Context Variable</a></li>\n<li><a href=\"#header-13\">Information</a></li>\n<li><a href=\"#header-14\">Extended Cards-Module (ME- and US-Guide)</a></li>\n<li><a href=\"#header-15\">Guide Waves</a></li>\n<li><a href=\"#header-16\">E-mail Delivery Status</a></li>\n<li><a href=\"#header-17\">Add Participants to an Ongoing Survey (for ME- &amp; US-Guides)</a></li>\n<li><a href=\"#header-18\">E-mail Preview Text</a></li>\n<li><a href=\"#header-19\">Question Preview in Portal's Language</a></li>\n<li><a href=\"#header-20\">Information</a></li>\n<li><a href=\"#header-21\">Remove Participants</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-23\">Leadership-Guides (ME-Guides)</a>\n<ul>\n<li><a href=\"#header-25\">Rater-Groups</a></li>\n<li><a href=\"#header-26\">Deactivate Self-Assessment</a></li>\n<li><a href=\"#header-27\">Anonymity Criteria</a></li>\n<li><a href=\"#header-28\">New Tab: Process Control</a></li>\n<li><a href=\"#header-29\">Information</a></li>\n<li><a href=\"#header-30\">Start Date in Guide Status</a></li>\n<li><a href=\"#header-31\">Information</a></li>\n<li><a href=\"#header-32\">Finished Guide Waves</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-34\">Ideation-Guide (IDEA)</a>\n<ul>\n<li><a href=\"#header-36\">New Guide Statuses</a></li>\n<li><a href=\"#header-37\">Automatic Pre-grouping Using Key Phrase Extraction</a></li>\n<li><a href=\"#header-38\">Information</a></li>\n<li><a href=\"#header-39\">New Placeholder</a></li>\n<li><a href=\"#header-40\">Registration: New Participants</a></li>\n<li><a href=\"#header-41\">Deep-Linking: Guide Waves</a></li>\n<li><a href=\"#header-42\">Grouping Phase: Assigning Titles</a></li>\n<li><a href=\"#header-43\">Using #detailview_link# Placeholder as Temporary Login</a></li>\n<li><a href=\"#header-44\">New Result Page</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-46\">Action-Board Improvements</a>\n<ul>\n<li><a href=\"#header-48\">Evaluation Duration</a></li>\n<li><a href=\"#header-49\">The New E-mail Settings</a></li>\n<li><a href=\"#header-50\">Description Text</a></li>\n<li><a href=\"#header-51\">The New Review Column</a></li>\n<li><a href=\"#header-52\">Deleting Actions</a></li>\n<li><a href=\"#header-53\">All Participants Will Receive a Notification</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-55\">Enterprise Feedback Suite</a>\n<ul>\n<li><a href=\"#header-57\">Multilingual E-mail Templates</a></li>\n<li><a href=\"#header-58\">People: Ways of Entry</a></li>\n<li><a href=\"#header-59\">Media Library: New ACL Right</a></li>\n<li><a href=\"#header-60\">Information</a></li>\n<li><a href=\"#header-61\">ACL Right: Panel Master Data</a></li>\n<li><a href=\"#header-62\">Password Column</a></li>\n<li><a href=\"#header-63\">Active Project</a></li>\n<li><a href=\"#header-64\">The Accordion Matrix Question Type</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-66\">Privacy Assistant (GDPR)</a>\n<ul>\n<li><a href=\"#header-68\">The Record of the Consent Form</a></li>\n<li><a href=\"#header-69\">Deleting Participants</a></li>\n</ul>\n</li>\n</ul>\n<p>The summer's faded and the year is drawing to a close. The leaves are falling from the trees, the days are getting shorter again. But there can be no question of the dreaded autumn blues - quite the opposite. The Fall 2019 release also offers a wealth of new features to discover. Find out more about the <em>Portals</em> platform enhancements, the three guide types (ME, US and IDEA), the <em>Action Board</em>, the <em>Enterprise Feedback Suite</em> and the <em>Privacy Assistant</em> (GDPR).</p>\n<h2 id=\"header-1\">Portals: Platform Enhancements</h2>\n<p>The new <em>Portals</em> page module called <em>Activity Tracking</em> is available. Some minor improvements have also been implemented. For example, new options have been added to the <strong>Look &amp; Feel</strong> sub-navigation. The default settings of the push and e-mail notifications have been changed.</p>\n<h3 id=\"header-3\">E-mail and Push Notifications</h3>\n<p>From now on, e-mail and push notifications are <em>enabled</em> by default. To access the <strong>Notifications</strong> menu, click on your user avatar or initials in the upper right corner of the external view. You can <em>disable</em> the notifications yourself by clicking the respective slide switch. <strong>Save</strong> the settings.</p>\n<h3 id=\"header-5\">Look &amp; Feel</h3>\n<p>The menu item <strong>Look &amp; Feel</strong> offers you new options for adjusting the appearance of your guide. You can change the background color and font color of the menu items in the sidebar of your guide.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998109109266\" alt=\"EN_sidbarcolor.png\"></p>\n<p>And in the new menu item <strong>Header</strong> you can choose whether you want to display the <strong>notification menu icon</strong> and the <strong>search function icon</strong>. Set or remove the check mark accordingly.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998095277714\" alt=\"EN_headermenu.png\"></p>\n<p>In addition, the menu item <strong>Custom CSS</strong> has been changed to match the line numbering and code formatting of the HTML module's appearance.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998082289298\" alt=\"EN_custom_css.png\"></p>\n<h3 id=\"header-6\">\n<em>Activity Tracking</em>: A New <em>Portals</em> Page Module</h3>\n<p>You can use the new <em>Activity Tracking</em> page module to display the KPIs related to the started guides per time period. You have to define the time interval type in the module configuration of the new module.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998090961170\" alt=\"Activity Tracking.png\"></p>\n<p>You can choose:</p>\n<ul>\n<li>\n<p>weekly</p>\n</li>\n<li>\n<p>monthly</p>\n</li>\n<li>\n<p>quarterly</p>\n</li>\n<li>\n<p>yearly</p>\n</li>\n</ul>\n<p>In the external view of your portal, the module will display all guides that have been started during the selected interval type, e.g. all guides started in one week. For each guide, a tile will be created that shows the guide title, the number of guides started per interval type, the trend, 4 team avatars and the total number of managers who started a guide. The data collection within the selected period will start by starting the module. For example, if you will start the module on Tuesdays and will have selected <em>weekly</em> as the interval type, all guides started since the last Tuesday will be displayed and compared with the 3 weeks before. The users of your portal can change the interval type selected in CMS area.</p>\n<p>Activities are tracked as of the release update. As soon as the module is added, the data can be displayed in your portal.</p>\n<h2 id=\"header-8\">\n<em>Guides</em> Enhancements</h2>\n<p>Many enhancements have been implemented to improve the usability of <em>Guides</em>. The guide status module called <em>Guide Waves</em> can be used within the workflow of the <em>ME-</em> and <em>US-Guides</em>. The preview of questions (Guide Setup) can be displayed in the language specified in the <strong>Project properties</strong>. <em>ME-</em> and <em>US-Guide</em> surveys can be offered via the <em>Cards</em> module.</p>\n<h3 id=\"header-10\">Suggested Group (Guide Setup)</h3>\n<p>Initially, the group whose participant is the initiator of the guide is displayed. The prerequisite for this is that no company-administered group has been preselected.</p>\n<h3 id=\"header-11\">Additional Questions Remain Activated</h3>\n<p>An <strong>Additional question</strong> that you had already activated for a previous guide wave remains even after it has ended. If you query the group again in the <strong>Guide Status</strong> menu, the <strong>Additional Questions</strong> set for the previous guide wave still exist.</p>\n<h3 id=\"header-12\">Additional Questions - Description of Context Variable</h3>\n<p>To be able to create multilingual labels faster, it is now possible to enter a <strong>Description</strong> for the context variable in the <strong>Questionnaire</strong> configuration, which is then displayed as a title in the guide setup. Go to the <strong>Questionnaire</strong> menu of the desired guide and <strong>Show Additional Questions</strong>. The input field<strong> Description</strong> is now available in which you can enter a translation of the question. <strong>Save</strong> your entries. When you now start your guide setup, you will see the previously entered description as the title of the question.</p>\n<p><em>Questionnaire menu:</em></p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998110197266\" alt=\"EN_description_contextvariable.png\"></p>\n<p><em>Guide setup:</em></p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998083651346\" alt=\"EN_description_contextvariable2.png\"></p>\n<p> </p>\n<h3 id=\"header-13\">Information</h3>\n<p>In addition, you no longer have a character limit for <strong>Additional Questions</strong> and line breaks are automatically inserted when displayed in the guide.</p>\n<h3 id=\"header-14\">Extended Cards-Module (ME- and US-Guide)</h3>\n<p>Guide surveys can now also be answered directly from the Cards module. For this, the invited user must be logged in and the survey must still be running. The background image of the card corresponds to the image of the associated guide. The remaining time for participation is displayed in the upper right corner.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998068812306\" alt=\"Guides_CardsModule.png\"></p>\n<p>The guides are also listed in the <strong>Pages</strong> configuration when you select the <strong>Cards</strong> module.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998069039378\" alt=\"EN_cards.png\"></p>\n<h3 id=\"header-15\">Guide Waves</h3>\n<p>Since the summer 2019 release, the<em> Guide Waves</em> page module is available to the<em> Ideation Guide</em>. From Fall 2019 release, this module will also be available to the<em> Team Improvement Guide</em> (<em>US-Guide</em>) and the<em> Leadership Guide</em> (<em>ME-Guide</em>). As part of the <em>Team Improvement Guide</em> (<em>ME-Guide</em>), you can also use the option item \"Consult group again\".</p>\n<h3 id=\"header-16\">E-mail Delivery Status</h3>\n<p>The <strong>E-mail delivery status</strong> of a guide now has an additional status. In addition to \"delivered\" and \"not delivered\" there is the status \"pending\", which indicates that e-mails are still in the queue. Also, the display has changed slightly: Instead of an icon, the status is now displayed as text. In addition, participants in a survey are grouped according to the <strong>rater groups</strong> from which they originate. Click on the name of the group to open the list of participants.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998137912082\" alt=\"EN_mail_delivery_status.png\"></p>\n<h3 id=\"header-17\">Add Participants to an Ongoing Survey (for ME- &amp; US-Guides)</h3>\n<p>It is now possible to add participants to an ongoing survey/guide wave. Go to the guide setup and open the<strong> E-mail delivery status</strong>. The delivery status is displayed and you can add a participant.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998137715730\" alt=\"EN_addparticipant.png\"></p>\n<p>A search box opens, in which you can enter the name or the e-mail address of the desired participant. By click on the participant's name or e-mail address a confirmation dialog opens. Click <strong>OK</strong> to add the selected participant to your survey.</p>\n<p>The participant will now receive an invitation by e-mail. If you have made the appropriate guide setting, the new added participants will also receive e-mails informing them of the results or reminding them that they have not yet participated.</p>\n<h3 id=\"header-18\">E-mail Preview Text</h3>\n<p>In the <strong>E-Mail preview Text</strong> you can now also use our standard editor. This allows you to format your e-mail text in a small amount already at this point. You can work with line breaks and present your text in bold, italic, underlined or colored. The <strong>E-Mail preview Text</strong> can be found in the <strong>Guides</strong> menu <strong>E-Mail settings</strong>.</p>\n<h3 id=\"header-19\">Question Preview in Portal's Language</h3>\n<p>A change relevant to the creation of multilingual projects concerns the question texts in the question preview in the <strong>guide setup</strong>: These questions are now displayed in the language specified in the <strong>Project properties</strong> (bread crumb: Projects → Survey menu → Project properties → Survey languages).</p>\n<h3 id=\"header-20\">Information</h3>\n<p>Only when survey language and portal language match, the question texts are output in the appropriate language.</p>\n<p> </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998123809042\" alt=\"DE_EN_portallanguage.png\"></p>\n<h3 id=\"header-21\">Remove Participants</h3>\n<p>You can remove participants from a company managed group. Therefore, you have to edit the group. An <strong>X</strong> icon will appear next to each member of the group. The company managed group itself will not be affected by this process. You can undo the removal by searching for this group again and selecting it. As of this release, this feature will be available to the <em>Leadership-Guide</em> (ME-Guide) and the <em>Team-Improvement-Guide</em> (US-Guide).</p>\n<h2 id=\"header-23\">Leadership-Guides (ME-Guides)</h2>\n<p>The configuration and control options of the <em>Leadership Guide</em> (ME-Guides) have been refined: You can set an anonymity limit and the <strong>Process Control</strong> tab allows you to set conditions for when the survey process can be considered successful. The start date of the Guide waves will be displayed and completed guide waves will not be overwritten after a restart, but will be listed.</p>\n<h3 id=\"header-25\">Rater-Groups</h3>\n<p>In the configuration menu <strong>Rater-Groups</strong> it is now excluded that a rater group is selected and configured twice. An already selected group is grayed out (in the example the group \"Self Assessment\" is already selected and therefore grayed out).</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998094359442\" alt=\"EN_ratergroup_grayed.png\"></p>\n<h3 id=\"header-26\">Deactivate Self-Assessment</h3>\n<p>The rater group <strong>Self-Assessment</strong> can now be deactivated (for a ME-Guide). Simply uncheck the checkbox for this. The creator of the guide will not be invited to the survey and will not receive any reminder e-mails. However, he will still be informed of the survey's results by e-mail and will receive voucher codes (if there are offline participants).</p>\n<h3 id=\"header-27\">Anonymity Criteria</h3>\n<p>You can define an <strong>Anonymity Criteria</strong> for the rater group of a guide. You specify the minimum number of participants in the rater group who must participate in the survey in order to maintain their anonymity. Therefore, with this value, you also define when a guide wave was successful and results are displayed.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998138926866\" alt=\"EN_anonymitycriteria.png\"></p>\n<h3 id=\"header-28\">New Tab: Process Control</h3>\n<p>In the guide configuration there is the new tab <strong>Process Control</strong>. Here you define the conditions under which the survey process is considered successful or unsuccessful, and the actions that this should entail. It is divided into the following three sections:</p>\n<ul>\n<li>\n<p>Definition of a successful process</p>\n</li>\n<li>\n<p>Define actions to be triggered on successful process</p>\n</li>\n<li>\n<p>Define actions to be triggered on unsuccessful process</p>\n</li>\n</ul>\n<p>In the first section, you specify the conditions that define the process as successful. If you have activated <strong>Self-Assessment</strong> (see above), the first condition is, that the Self-Assessment is <strong>completed</strong>. As second condition, enter the <strong>Number of Rater-Groups above the anonymity-threshold</strong>.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998126269714\" alt=\"EN_processcontrol1.png\"></p>\n<p>Then, in the second and third sections, determine which actions should be triggered if your process is considered <em>successful</em> or <em>unsuccessful</em>. The following options are available:</p>\n<ul>\n<li>\n<p><strong>Order report</strong>: In the <em>Report Manager</em>, a report is ordered based on the settings made in the guide configuration (<em>Settings &gt; Report-Manager Connection</em>). This is created in PDF format and in the portal language of the guide creator.</p>\n</li>\n<li>\n<p><strong>Create action</strong>: Specify here whether an Action should be created in the <em>Action Board</em> (with a certain due date, where appropriate).</p>\n</li>\n<li>\n<p><strong>Send e-mail</strong>: You can choose to send an e-mail to the guide initiator or to a panelist whose e-mail address you should enter. Also select the appropriate mail template.</p>\n</li>\n<li>\n<p><strong>Update Master data</strong>: The date on which the successful process occurred is added to the selected master data variable.</p>\n</li>\n</ul>\n<p>For a process that has been classified as <em>unsuccessful</em>, only the actions <strong>Send e-mail</strong> and <strong>Update Master data</strong> are available.</p>\n<p> </p>\n<h3 id=\"header-29\">Information</h3>\n<p>The actions can be combined with each other and the same action can be selected several times.</p>\n<h3 id=\"header-30\">Start Date in Guide Status</h3>\n<p>For a better overview of your surveys, the guide status now shows when a guide wave was started. In the external view, go to the <strong>Guides</strong> menu and select the button <strong>View status</strong> for the desired guide. The newly added <strong>Start</strong> column shows you whether and when your survey was last started.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998093410066\" alt=\"EN_start_column.png\"></p>\n<p> </p>\n<h3 id=\"header-31\">Information</h3>\n<p>Depending on the language setting, a time stamp in the format MM-DD-YYYY HH:MM (English) or DD-MM-YYYY HH:MM (German) is used for the start date display.</p>\n<h3 id=\"header-32\">Finished Guide Waves</h3>\n<p>So far, a completed guide wave was overwritten by a restart of the guide. But now finished guide waves are listed in the <strong>guide status</strong>. So the access to the results of the completed guide waves is quick and easy. The <strong>View results</strong> button in the menu of the corresponding guide wave takes you to the linked dashboard. The current guide wave is at the top, below are finished guide waves in descending chronology.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998082139154\" alt=\"EN_endedWaves.png\"></p>\n<h2 id=\"header-34\">Ideation-Guide (IDEA)</h2>\n<p>New features have also been developed and implemented. Two new guide statuses have been added. An automatic pre-grouping can be done by using <em>Key Phrase Extraction</em>. New placeholders are available and the results page has been redesigned.</p>\n<h3 id=\"header-36\">New Guide Statuses</h3>\n<p>As of now, the <em>Ideation Guide</em> has the <em>Completed</em> status and <em>Failed</em> status. The <em>Completed</em> status is defined as follows: All actions of a guide wave transferred to the <em>Action Board</em> have been evaluated by the participants and the tickets have been transferred to the <em>Done</em> status.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998074538386\" alt=\"Ideation Guide completed.png\"></p>\n<p>In addition to the <em>Completed</em> status, you also have the new <em>Failed</em> status. This status indicates that no suggestion has been received at the end of the suggestion phase, or that no one has been voted at the end of the voting period. In these cases, the <em>Ideation Guide</em> wave will be obtain the status <em>Failed</em>. The <em>Failed</em> status has the <em>Show Participants</em> and <em>Summary</em> options.</p>\n<h3 id=\"header-37\">Automatic Pre-grouping Using <em>Key Phrase Extraction</em>\n</h3>\n<p>The suggestions made by the participants can be pre-grouped using <em>Key Phrase Extraction</em>. To use this feature, the new section \"Settings Grouping\" has been added to the <strong>Settings</strong> tab of your<em> Ideation Guide</em> (CMS area of <em>Portals</em>). There you activate the feature \"Automatic Pregrouping\" by means of a slide switch. You have to enter the <em>Azure API key</em>. The connection needs to be tested. After a successful test, the feature can be used. This option is used to analyze the suggestions made by the participants and to pre-group them. By default, the \"Automatic Pregrouping\" option is disabled.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998067839634\" alt=\"Merge Settings.png\"></p>\n<p>The suggestions made by the participants are analyzed, combined and pre-grouped into groups of at least 2 to max. 5 similar suggestions. On the guide status page called <em>Guide Waves</em>, click the <strong>Group</strong> button to access the pre-grouped suggestions. The grouping and the label for each group can be changed.</p>\n<p> </p>\n<h3 id=\"header-38\">Information</h3>\n<p>To obtain the <em>Azure API key</em>, please contact the support team.</p>\n<h3 id=\"header-39\">New Placeholder</h3>\n<p>A new e-mail template placeholder can be used to display the name of the guide initiator of the<em> Ideation Guide</em>. Use the <em>#guide initiator#</em> placeholder! The pipe function can be used to display first or last name of the guide initiator. Otherwise the complete name will be displayed.</p>\n<ul>\n<li>\n<p>#guideinitiator|firstname#</p>\n</li>\n<li>\n<p>#guideinitiator|name#</p>\n</li>\n</ul>\n<p>This new placeholder is available for the following e-mail template types:</p>\n<ul>\n<li>\n<p>Survey-Invitation</p>\n</li>\n<li>\n<p>Merge-Mail</p>\n</li>\n<li>\n<p>Voting-Mail</p>\n</li>\n<li>\n<p>Result-Mail</p>\n</li>\n</ul>\n<h3 id=\"header-40\">Registration: New Participants</h3>\n<p>If an external participant (no panelist)  will be invited to take part in an <em>Ideation Guide</em>, the participant will be assigned the <em>Admitted temporarily</em> status. In the CMS area of portals, these participant will be assigned the <em>Not invited yet</em> status. At the beginning of the voting phase the participant will receive an invitation. The link embedded in the e-mail will lead to a registration page. On this registration page, there will be no password area. Thus the participant can enter his or her first name and surname, activate the checkbox before jumping to the voting page. In the CMS area of <em>Portals</em>, the \"Login code\" option of the <strong>Access rights </strong>menu has to be activated.</p>\n<p>After registration, the participant will land on the voting page instead of the target page, which has been defined in the CMS.</p>\n<h3 id=\"header-41\">Deep-Linking: Guide Waves</h3>\n<p>To get quick access to the grouping phase of the <em>Ideation Guide</em>, the new <em>#guide_status_link#</em> placeholder can be used. By clicking on this link, the guide initiator will jump to the <em>Guide Waves</em> status page. The login code is valid as long as the group phase will last.</p>\n<h3 id=\"header-42\">Grouping Phase: Assigning Titles</h3>\n<p>Assigning a title is now mandatory. You will not be able to click on the <strong>Merge</strong> button until a title has been entered.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998052888082\" alt=\"Grouping.png\"></p>\n<h3 id=\"header-43\">Using <em>#detailview_link# P</em>laceholder as Temporary Login</h3>\n<p>You can obtain access to the detail view of an action by using the <em>#detailview_link#</em> placeholder as a temporary login. A link embedded in an e-mail will be sent to the participants. The participants will be able to access the detail view of an action without logging in.</p>\n<h3 id=\"header-44\">New Result Page</h3>\n<p>The results page of the<em> Ideation Guide</em> has been redesigned to present the most important information to you quickly and clearly. At a glance, you can see how many people have been taken part in the voting phase, how many suggestions have been proposed, how many participants have been voted for one suggestion. It also indicates how many suggestions have been created. There is an overview of the top voted actions. It will list which actions have been added to the <em>Action Board</em>.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998078437778\" alt=\"Result page 1.png\"></p>\n<p>The other suggestions will also be added.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998052500754\" alt=\"Result page 2.png\"></p>\n<h2 id=\"header-46\">\n<em>Action-Board</em> Improvements</h2>\n<p>Many improvements have been implemented. As of this release, you can define a rating duration. The number of characters that can be used in the description text of an action has been increased. A column has also been added to the external view of the<em> Action Board</em>.</p>\n<h3 id=\"header-48\">Evaluation Duration</h3>\n<p>A new option called \"Define evaluation duration\" can be ticked. Expand the <em>Action Board</em> module configuration to activate or deactivate this new option. You can activate this option to specify an evaluation duration. The action must be rated within this period. Once the evaluation period has expired, the action cannot be moved to another column.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998106055570\" alt=\"Action Board_Duration.png\"></p>\n<ul>\n<li>\n<p>This option is activated by default.</p>\n<ul>\n<li>\n<p>The default value is an evaluation period of 14 days, which you can adjust manually to your own project specifications.</p>\n</li>\n</ul>\n</li>\n<li>\n<p>The evaluation period applies to the entire portal.</p>\n</li>\n</ul>\n<h3 id=\"header-49\">The New E-mail Settings</h3>\n<p>Due to the implemented evaluation duration, the e-mail settings have also been extended. The option \"action status changed\" option has been implemented. Expand the <em>Action Board</em> module configuration and select an e-mail template. This template will be sent to the participants as soon as the status of an action has been changed. You can also select a template to remind participants of the rating. Then you can specify how many days before the evaluation period expires a reminder e-mail should be sent.</p>\n<ul>\n<li>\n<p>A default value of 3 days is set. </p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998089393810\" alt=\"Action Board email configuration 2.png\"></p>\n<p>The panelists can activate the \"Rate expires soon\" option via slide switch (Push or/and Email). They have to open the <strong>Profile</strong> menu and click on the <strong>Notification</strong> tap. The e-mail selected in the e-mail configuration of the <em>Action Board</em> will be sent as a push and/or e-mail notification. </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998066463122\" alt=\"Technical Writer Portal Action Board.png\"></p>\n<h3 id=\"header-50\">Description Text</h3>\n<p>The description text of an action was limited to 1000 characters. This value has now been increased. From now on, 65000 characters can be used.</p>\n<h3 id=\"header-51\">The New <em>Review C</em>olumn</h3>\n<p>The <em>Review</em> column has been added to the <em>Action Board</em>. Actions that are moved to this column can be rated. After moving the action to this column, the evaluation duration will start (The option has to be activated).</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998065922706\" alt=\"Action Board exterior view.png\"></p>\n<p>By moving the action to the <em>Review</em> column, the following options can no longer be edited:</p>\n<ul>\n<li>\n<p>Title</p>\n</li>\n<li>\n<p>Description</p>\n</li>\n<li>\n<p>Due date</p>\n</li>\n</ul>\n<p>Furthermore, a rated action that has been moved to the<em> Review</em> column can no longer be moved to the <em>Ongoing</em> column. A unrated action can be moved from the <em>Review</em> column to the <em>Ongoing</em> column. By moving the action to <em>Review</em> column, the evaluation duration will start again. An action that will be rated by all participants will automatically end up in the <em>Done</em> column. Special feature: After removing a panelist who has not rated an action yet, the action will be immediately moved to the <em>Done</em> column.</p>\n<ul>\n<li>\n<p>Existing tasks that are in the <em>Done</em> column when the fall release is installed are moved to the <em>Review</em> column.</p>\n</li>\n<li>\n<p>After 14 days, which corresponds to the default value, the tasks are automatically moved to the <em>Done</em> column.</p>\n</li>\n</ul>\n<h3 id=\"header-52\">Deleting Actions</h3>\n<p>Archived actions can be deleted using the <strong>More</strong> option by clicking <strong>Delete</strong>. A dialog will open to confirm the final deletion of the action.</p>\n<h3 id=\"header-53\">All Participants Will Receive a Notification</h3>\n<p>From now on, all participants of a guide wave will receive a notification. If the status of an action has been changed, all involved participants will receive a notification. The person making the change will not be notified. The prerequisite is that the corresponding notifications have been activated on the<strong> Settings</strong> tab of the user profile. The e-mail settings in the CMS area of <em>Portals</em> must also be set accordingly. The following action triggers a notification:</p>\n<ul>\n<li>\n<p>Status change from <em>Inbox</em> to <em>Ongoing</em>, to <em>Done</em>, to <em>Archived</em> (also in the opposite direction)</p>\n</li>\n<li>\n<p>Assignee Action</p>\n</li>\n<li>\n<p>Sharing an Action</p>\n</li>\n<li>\n<p>Comments</p>\n</li>\n<li>\n<p>Rate Action</p>\n</li>\n<li>\n<p>Action due date expiration</p>\n</li>\n</ul>\n<h2 id=\"header-55\">Enterprise Feedback Suite</h2>\n<p>The multilingualism of<em> EFS</em> has been improved. You can create multilingual e-mail templates, for example. New ACL rights have been added so that uploading files to the media library can be restricted to certain users. The <em>Accordion Matrix</em> question type has also been extended.</p>\n<h3 id=\"header-57\">Multilingual E-mail Templates</h3>\n<p>Previously, e-mail templates could only be created in one language. This obstacle could be circumvented by using if-else conditions. The solution implemented as of this Fall 2019 release will be more practically. You will be able to create e-mail templates in several languages, but also to create SMS texts in several languages. Surveys will also be displayed in the language defined in the panelist account.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998121677074\" alt=\"Mail templates new.png\"></p>\n<p><u>Multilingual e-mail templates and SMS</u></p>\n<p>To create multilingual e-mail templates, first click on the <strong>Mail Templates</strong> menu item. Either select an existing e-mail template which you want to translate, or create a completely new template of the default language which you want to translate. For this purpose, each template now has the \"Additional Translations\" area. Click the <strong>+ New</strong> button to create your translation of the e-mail template and the SMS text.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998067343890\" alt=\"Mail templates.png\"></p>\n<p>First, you must select the language identifier according to the language you want to translate into. Then you have to translate the mail text (also HTML) and the SMS text. Finally, click <strong>Save</strong>. The created translations will be listed in the \"Additional translations\" section. They can also be edited or deleted there. For editing, simply click on the link or the edit icon.</p>\n<p><u>Sending e-mail to a panelist</u></p>\n<p>To send panelists an e-mail or a SMS in their preferred language, a language must be stored in the <em>u_locale</em> variable (e.g. French). This variable is used to check whether an e-mail template was created in the corresponding translation. If no translation is available, the e-mail will be sent in the default language. This also applies if no language has been stored in the <em>u_locale</em> variable.</p>\n<p><u>Category labels for guides</u></p>\n<p>The category labels for guides that you manage using the <em>#guidewave_category_label#</em> placeholder will also be available in the selected translation of the e-mail template. The prerequisites for this are that an e-mail template has been created in the language preferred of the panelist. The preferred language of the panelist has to be stored in <em>u_locale</em> variable. The labels of the guide categories has to be created by using the corresponding language identifier (ISO code).</p>\n<p><u>Multilingualism for participants in a survey</u></p>\n<p>Survey participants can also receive e-mails, SMS and surveys in their preferred language.</p>\n<p>In order to be able to use multi-lingual email/sms templates and survey languages through a single variable in a PE or ES project, you will have to manually create a new participant variable of display type text field in the participant administration first. For consistency reasons, we recommend to name that variable <em>u_locale</em>. When importing new participants to the system, you can now store the preferred language of each participant, by specifying the ISO language code as value for <em>u_locale</em> and the code should always correspond to language identifiers of existing languages in the survey, e.g. <em>en_GB</em> for British English. PA projects already contain the user variable <em>u_locale</em>, so this step is not necessary, just set the preferred language of the panelist in the panelist administration.</p>\n<p>After the new participant variable was created, you have to select the variable in the<strong> language editor</strong> of the survey and after saving, a new option will appear, <em>Assign language by ISO code</em>. By checking this option, you will enable the <em>u_locale</em> variable for use as the language selection for the survey and all survey related mails or SMS to the participant.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998097524370\" alt=\"Pasted Graphic.png\"></p>\n<p>If no e-mail template is available in the selected language, the default language will used as a fallback, just like in the survey. This also applies if no preferred language has been set</p>\n<ul>\n<li>\n<p>This feature is only available for the project types PE and ES and PA!</p>\n</li>\n</ul>\n<h3 id=\"header-58\">People: Ways of Entry</h3>\n<p>The ways of entry of a panelist can now be tracked even more precisely. In the <strong>People</strong> menu <strong>Panelist Administration</strong> &gt; <strong>Detail view</strong> of the panelist &gt; <strong>Status information</strong> you will now find the <strong>Mode of entry</strong> as well as the <strong>Way of entry</strong>. If the Way of entry is via a portal, you can see from the Mode of entry whether the panelist did this himself (mode: <strong>registered</strong>) or by invitation (mode:<strong> invited</strong>).</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998068554642\" alt=\"EN_modeofentry1.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998068318866\" alt=\"EN_modeofentry2.png\"></p>\n<h3 id=\"header-59\">Media Library: New ACL Right</h3>\n<p>In order to restrict the import of media files to certain users, read and/or write rights  of the new <em>upload_media_file </em>ACL right can be assigned to this users. The activation of the <em>High Security</em> mode is required for this new ACL right. If this mode has been activated and no write permission has been assigned, it will not be possible to upload files to the media library. The read permission of this ACL right allows you to open the media library. The write permission of this ACL right allows you to upload files to the media library. Images can not be uploaded via the<strong> Edit</strong> icon of already imported images. This new ACL right affects the following areas:</p>\n<ul>\n<li>\n<p>Media library in the questionnaire editor</p>\n</li>\n<li>\n<p>Panel Website Asset Library</p>\n</li>\n<li>\n<p>Media library (Libary menu bar)</p>\n</li>\n</ul>\n<p>After a project has been migrated and a new group has been created, the new ACL right is activated for all teams.</p>\n<ul>\n<li>\n<p>Read and write rights are activated by default.</p>\n</li>\n</ul>\n<h3 id=\"header-60\">Information</h3>\n<p>To activate High Security Mode, please contact the support team.</p>\n<h3 id=\"header-61\">ACL Right: Panel Master Data</h3>\n<p>You need the write permission of the ACL right <em>Panel Master data</em> to select one of the following export options:</p>\n<ul>\n<li>\n<p>Master Data for Project</p>\n</li>\n<li>\n<p>Master Data and Result Data</p>\n</li>\n<li>\n<p>Master Data, Address Data and Result Data</p>\n</li>\n<li>\n<p>User Defined Templates Based on the Upper 3 Options</p>\n</li>\n</ul>\n<p>Path:</p>\n<p><strong>Export</strong> → <strong>New Export Order</strong></p>\n<p>The feature can be used to export the panel data of PA and MD projects. The change affects the existing ACL rights. For example, if you have the read permission of ACL rights <em>export_with_Ifdn</em> or <em>search_panel</em> (you only have read permission of the ACL right <em>panel master data</em>) the options mentioned will not be displayed. These options will not be available, if you want to copy or create new export templates.</p>\n<h3 id=\"header-62\">Password Column</h3>\n<p>After activating the <em>High Security</em> mode, the option to display the password column will no longer be available. This applies to both PE and ES projects.</p>\n<h3 id=\"header-63\">Active Project</h3>\n<p>If a guide project is connected to a PE project, you can no longer activate the <em>Privacy Assistant </em>(GDPR) subsequently. The <em>active</em> status in the <em>Survey</em> menu can no longer be set to <em>No further participations</em> and/or <em>Completed </em>manually. The <em>Define target value</em> icon and the Pop-up will not be displayed.</p>\n<h3 id=\"header-64\">The <em>Accordion Matrix </em>Question Type</h3>\n<p>To configure the <em>Accordion Matrix</em> question type, you can enable the option \"Inside title\" to create a new dimension that will be displayed the entered text as a headline.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/20998090576274\" alt=\"2019-09-23 15_29_24-Question.png\"></p>\n<h2 id=\"header-66\">Privacy Assistant (GDPR)</h2>\n<p>The<em> Privacy Assistant</em> (GDPR) has also been enhanced. The record of the consent form has been modified and the deletion of participant data has been improved.</p>\n<h3 id=\"header-68\">The Record of the Consent Form</h3>\n<p>The record of the consent form has been modified to improve the usability of the print version. The complete text of text field will be displayed completely without a scrollbar.</p>\n<h3 id=\"header-69\">Deleting Participants</h3>\n<p>Participants who do not participate in a survey cannot give their consent to data processing. They have no access to the consent form. Nevertheless, the data of these participants will be stored in the participant administration. As of the Fall release, you will be able to delete this data.</p>\n<p>You can tick the option \"Automatic deletion of personal data\" to activate this feature. After ticking this option, a period of time has to be defined. If a participant will not participate in the survey within this period of time the personal data (e-mail, first name, surname) will be deleted automatically. The disposition code 43 is described as <em>Personal data deleted</em>.</p>\n<ul>\n<li>\n<p>By default, the feature is disabled.</p>\n</li>\n</ul>",
    "user_segment_ids": []
}