{
    "id": 21037617366802,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21037617366802.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21037617366802-EFS-Release-Notes-24-2",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": true,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-29T10:00:33Z",
    "updated_at": "2024-11-13T07:40:01Z",
    "name": "EFS Release Notes 24.2",
    "title": "EFS Release Notes 24.2",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-11-13T07:40:01Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6ESGYQXE17ZBM6ZC5C5TFTV\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">New Features in the Enterprise Feedback Suite</a>\n<ul>\n<li><a href=\"#header-5\">Modernized CAPTCHA for Panel Websites with Responsive v2 Layout</a></li>\n<li><a href=\"#header-6\">Optimized Overview Page for Uploaded Files</a></li>\n<li><a href=\"#header-7\">Modernized SSO Login Page</a></li>\n<li><a href=\"#header-8\">New API Endpoints</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-10\">New features for More Effective Dashboard Creation</a>\n<ul>\n<li><a href=\"#header-12\">Tivian Analytics</a></li>\n<li><a href=\"#header-13\">MySight</a></li>\n</ul>\n</li>\n</ul>\n<div class=\"expand-macro\">Below, you will find an overview of the new features and improvements that are part of the new EFS 24.2 release. Among other things, they relate to the website module and the general login experience in EFS.</div>\n<div class=\"expand-macro\">We would also like to share with you some other technical improvements and developments that Tivian has recently implemented to further improve the performance and user experience of our solutions – especially with regard to the creation of dashboards.</div>\n<h2 id=\"header-1\"><strong>New Features in the Enterprise Feedback Suite</strong></h2>\n<p>First of all, we would like to introduce you to all the new features that are directly related to the Enterprise Feedback Suite.</p>\n<h3 id=\"header-5\"><strong>Modernized CAPTCHA for Panel Websites with Responsive v2 Layout</strong></h3>\n<p>On panel websites based on the Responsive v2 layout, the previous CAPTCHA implementation has been replaced by a new, modern ALTCHA-based alternative (<a href=\"https://altcha.org/\" data-card-appearance=\"inline\">https://altcha.org/</a>). ALTCHA does not use external services, does not apply cookies or fingerprinting, does not track users and is fully GDPR compliant.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037619387794\" alt=\"image-20240624-084323.png\"></p>\n<p>ALTCHA is the default setting. As of EFS 24.2, you can now also optionally activate Google reCAPTCHA v2. To do this, simply select the option <strong>Google reCAPTCHA v2</strong> from the drop-down menu <strong>Use CAPTCHA plugin</strong> on the <strong>Registration</strong> page and click <strong>Save</strong> at the top right of the page. You will then see two more fields where you need to enter your site key and secret key.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037603660946\" alt=\"image-20240624-084245.png\"></p>\n<p>Further information about reCAPTCHA and how to register for the service can be found <a href=\"https://developers.google.com/recaptcha?hl=en\">here</a>.<br>We would like to point out that it is your own responsibility to check and ensure the data protection-compliant use of Google reCAPTCHA.</p>\n<p> </p>\n<h3 id=\"header-6\"><strong>Optimized Overview Page for Uploaded Files</strong></h3>\n<p>In your survey project, you can view the questions for which files have been uploaded under <strong>Statistics &gt; Uploaded files</strong>. Previously, you had to click on each question individually to view detailed information. With the new release, we have improved the overview page for uploaded files. You can now see at a glance when the last participation for the corresponding upload question took place and for how many participations a file was uploaded. This significantly reduces the workload, especially for surveys with many upload question types.</p>\n<p> </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037618012050\" alt=\"image-20240624-094237.png\"><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037619176210\" alt=\"image-20240624-085712.png\"></p>\n<h3 id=\"header-7\"><strong>Modernized SSO Login Page</strong></h3>\n<p>For EFS installations with activated single sign-on, the login page has been redesigned and adapted to the EFS look and feel for a more consistent user experience.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037634748562\" alt=\"image (1)-20240624-090339.png\"></p>\n<h3 id=\"header-8\"><strong>New API Endpoints</strong></h3>\n<p>Four new API endpoints are now available:</p>\n<ul>\n<li>\n<p><em>efs.mailtemplates.getWithAttachments</em> for retrieving mail templates with attachments</p>\n</li>\n<li>\n<p><em>efs.mailtemplates.send</em> for sending test mails</p>\n</li>\n<li>\n<p><em>survey.questionnaire.getStructureWithIds</em> for retrieving the questionnaire structure with internal IDs for further use, for example by translation services</p>\n</li>\n<li>\n<p><em>survey.statistics.getListOfDispoCountsGroupedBy</em> for retrieving the number of participants based on disposition codes – split by variable and with optional filtering</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-10\"><strong>New features for More Effective Dashboard Creation</strong></h2>\n<p>Our goal at Tivian is always to improve the functionality and user experience of our products. In order to be able to set up projects even more efficiently and provide you with dashboards even faster, we have successfully completed two other internal undertakings – the development of Tivian Analytics and the migration of MySight to AWS Hosting.</p>\n<h3 id=\"header-12\"><strong>Tivian Analytics</strong></h3>\n<p>Tivian Analytics is an important internal release that allows us to create guide-based dashboards for you even faster and more efficiently. It has been specifically designed for multi-rater feedback, such as Leadership 360° and Pulse surveys, and its simple configuration options ensure that you can start your projects even faster.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037634541074\" alt=\"image-20240621-090824.png\"></p>\n<p> </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037634310162\" alt=\"image-20240424-085719-20240621-090339.png\"></p>\n<h3 id=\"header-13\"><strong>MySight</strong></h3>\n<p>We have switched to high-performance AWS hosting for MySight so that you can now benefit from optimum speed when using the software. In addition, a number of new Tableau-based features for analytics and dashboards are now available, providing an even better web-authoring experience and making it even easier to create and edit visualizations directly from the web browser. These features include, for example:</p>\n<ul>\n<li>\n<p><strong>Improved accessibility</strong>: A more consistent tab order makes it easier to navigate the dashboard using the keyboard.</p>\n</li>\n<li>\n<p><strong>Explain Data</strong>: This feature provides an explanation of the data displayed and identifies interesting data points such as extreme values.</p>\n</li>\n<li>\n<p><strong>Set Control</strong>: Set controls allow users to dynamically change the elements of a set without having to change the underlying data source.</p>\n</li>\n</ul>",
    "user_segment_ids": []
}