{
    "id": 21037575177490,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21037575177490.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21037575177490-EFS-Release-Notes-24-1",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 1,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-29T09:58:48Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Notes 24.1",
    "title": "EFS Release Notes 24.1",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T10:07:34Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6ESGXV6WZ0WR6EZBHQ1BEDD\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">General Changes in EFS</a>\n<ul>\n<li>\n<a href=\"#header-3\">Redesign of the Admin Area UI</a>\n<ul>\n<li><a href=\"#header-5\">TivAI Support</a></li>\n<li><a href=\"#header-6\">Zoom Setting under Personal Preferences</a></li>\n<li><a href=\"#header-7\">New Default Mail Sender</a></li>\n<li><a href=\"#header-8\">Enforcement of SPF Record When Adding Mail Senders</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li>\n<a href=\"#header-10\">Updates in Projects</a>\n<ul>\n<li><a href=\"#header-12\">Support for SVG Files</a></li>\n<li><a href=\"#header-13\">Placeholders in CC and BCC fields</a></li>\n<li><a href=\"#header-14\">Video Recorder Question Type</a></li>\n<li><a href=\"#header-15\">Editing of Completed Employee Surveys</a></li>\n<li><a href=\"#header-16\">Password Search in the Participant Administration of Personalized Projects</a></li>\n<li><a href=\"#header-17\">Configurable Page Breaks in Receipts</a></li>\n<li><a href=\"#header-18\">Updated File Size Limits for Upload Question Types</a></li>\n<li><a href=\"#header-19\">Simplified Addition of Variables to Advanced Search</a></li>\n<li><a href=\"#header-20\">Creating a Print Version of Questionnaires</a></li>\n<li><a href=\"#header-21\">Updated File Format for Export/Import of Translation File</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-23\">Updates in People</a>\n<ul>\n<li><a href=\"#header-25\">Mass Generation of Registration Keys</a></li>\n<li><a href=\"#header-26\">Renaming of ACLs</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-28\">Updates in Website</a>\n<ul>\n<li>\n<a href=\"#header-30\">Two-Factor Authentication for Panel Websites</a>\n<ul>\n<li><a href=\"#header-32\">Setting Options for App-based Two-Factor Authentication</a></li>\n</ul>\n</li>\n<li><a href=\"#header-34\">Resetting Two-Factor Authentication in the People Module</a></li>\n<li><a href=\"#header-35\">Behavior in Case of Incorrect Code Entry</a></li>\n<li>\n<a href=\"#header-36\">Feed Subscriptions</a>\n<ul>\n<li><a href=\"#header-38\">[1] Important Disclaimer for Survey Question Types with Video and Audio Recording</a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>Introducing our latest release: EFS 24.1 comes with numerous enhancements and improvements that provide even more usability and functionality. In addition to some minor bug fixes, we have made general changes to EFS, and we have optimized the <em>Projects</em>, <em>People</em> and <em>Website</em> modules for you.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037544524050\" alt=\"image-20240301-084906.png\"></p>\n<hr>\n<h1 id=\"header-1\"><strong>General Changes in EFS</strong></h1>\n<p>For the new EFS release 24.1, there are some fundamental updates that immediately catch the eye. These include a redesign of the admin area's user interface and direct access to our chatbot TivAI.</p>\n<h2 id=\"header-3\"><strong>Redesign of the Admin Area UI</strong></h2>\n<p>With the new 24.1 release we have redesigned and optimized the EFS user interface for you. Above all, the modern design impresses with higher contrasts and up-to-date colours, providing even better usability than before. It also seamlessly integrates with the look and feel of our existing software portfolio so that you enjoy a consistent and streamlined user experience with TIVIAN software products.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037605907986\" alt=\"image-20240313-082218.png\"></p>\n<p>While developing the new user interface, we have put the requirements of our customers first: to ensure that you can use EFS just as effectively and intuitively as before, we have only changed the design – all features, menus and options can still be found in their usual places and their functionality remains the same.</p>\n<p> </p>\n<h3 id=\"header-5\"><strong>TivAI Support</strong></h3>\n<p>In the top right-hand corner, you will now find the TivAI Support button: your direct access to our new AI-based chatbot for immediate support regarding questions about EFS.</p>\n<p> </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037590169746\" alt=\"image-20240306-103124.png\"></p>\n<p> </p>\n<p> </p>\n<p>Simply click on the button, enter your question in the <strong>Message</strong> field and then click on the <strong>Send</strong> icon. After only a short time, the chatbot will send you an answer. If necessary, you can ask follow-up questions as often as you like. If the chatbot cannot answer your question to your satisfaction, our support staff will of course still be happy to help you.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037576723090\" alt=\"image-20240223-090404.png\"></p>\n<p> </p>\n<h3 id=\"header-6\"><strong>Zoom Setting under Personal Preferences</strong></h3>\n<p>You can now adjust the size of the EFS Admin layout in your user account. To do this, proceed as follows:</p>\n<ul>\n<li>\n<p>Click on your user account in the top right-hand corner.</p>\n</li>\n<li>\n<p>Select <strong>Personal Preferences</strong> from the drop-down menu.</p>\n</li>\n<li>\n<p>On the<strong> Common settings </strong>tab, under <strong>Layout size of EFS</strong>, select the desired setting. You can choose between <strong>Default</strong>, <strong>Smaller</strong> and <strong>Smallest</strong>.</p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037608775954\" alt=\"image-20240305-081602.png\"></p>\n<p>Currently, Firefox does not support this setting. To adjust the size of the layout, press the Alt key and select <strong>View &gt; Zoom</strong> instead.</p>\n<p> </p>\n<h3 id=\"header-7\"><strong>New Default Mail Sender</strong></h3>\n<p>From now on, the mail sender \"noreply@customervoice360.com\" will be used by default for new mail templates. If you would like a different default mail sender for your installation, please contact our support team. You can still add your own mail senders in the <strong>Libraries</strong> area. However, additional security requirements apply from now on (for more information, see the next point \"Enforcement of SPF Record When Adding Mail Senders\").</p>\n<h3 id=\"header-8\"><strong>Enforcement of SPF Record When Adding Mail Senders</strong></h3>\n<p>As of version 24.1, EFS requires a SPF record when creating a mail sender with your domain. This is to ensure that your emails are properly authenticated and delivered to your participants. If your domain settings do not include our mail servers yet, you need to update your SPF record with the following include: <strong>include:_spf.tivian.com</strong>. Otherwise, you will get an error message when trying to add a mail sender with your domain under <strong>Libraries → Mail templates → Mail senders</strong>. If you cannot change the SPF record for your email domain, you still have the option of using the default sender address<em> “Survey &lt;noreply@customervoice360.com&gt;”</em>. Just create a new mail sender using the mentioned email address and enter the name of your company as a realname instead of \"Survey\", for example. More information on this topic can be found here.</p>\n<hr>\n<h2 id=\"header-10\">\n<strong>Updates in </strong><em><strong>Projects</strong></em>\n</h2>\n<p>We have also optimized the <em>Projects</em> module and can present you with several practical improvements that make using the software even more efficient and easier.</p>\n<p> </p>\n<h3 id=\"header-12\"><strong>Support for SVG Files</strong></h3>\n<p>In the past, it was not possible to use SVG files for question types that supported uploading images (for example <em>111 Hotspot</em>, <em>111 Single response list with icons</em>, <em>121 Hotspot, 121 Multiple response list with images</em> or <em>998 Text and image</em>). As of EFS 24.1, this is possible.</p>\n<p> </p>\n<h3 id=\"header-13\"><strong>Placeholders in CC and BCC fields</strong></h3>\n<p>You can now use placeholders not only in the text of emails sent from EFS, but also in the <strong>Additional mail recipient (CC)</strong> and <strong>Additional hidden mail recipient (BCC)</strong> fields. These are then automatically replaced when the email is sent. Clicking the question mark symbol next to the respective fields will display an overview of the available placeholders you can use.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037591455122\" alt=\"image-20240305-102124.png\"></p>\n<p> </p>\n<h3 id=\"header-14\"><strong>Video Recorder Question Type</strong></h3>\n<p>We already introduced the audio recorder question type with release 22.2. With EFS 24.1, we have now also implemented the video recorder question type. With this question type, your participants can now record and upload a video as an answer. The recordings are saved in the same way as with the upload question type, and you can access them via the \"Statistics\" menu. Please note our <a href=\"https://qbdocs.atlassian.net/wiki/spaces/DOC/pages/edit-v2/4115922983?draftShareId=c2640296-4dd8-4613-9c57-871f46210515#%5B1%5D-Important-Disclaimer-for-Survey-Question-Types-with-Video-and-Audio-Recording\">disclaimer</a> on the video recorder question type.<sup>1</sup></p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037608577554\" alt=\"image-20240305-082255.png\"></p>\n<p> </p>\n<h3 id=\"header-15\"><strong>Editing of Completed Employee Surveys</strong></h3>\n<p>In the past, you could only edit completed anonymous and personalized surveys via the <strong>Statistics &gt; Detailed view</strong> menu and thus update information or adjust the answers accordingly if questions were changed. This is now also possible for employee surveys. If you now open the<strong> Statistics</strong> menu and then the <strong>Detailed view</strong> menu item for an employee project, you will find one button for displaying and one for editing in the <strong>Actions</strong> column for completed participations.</p>\n<p>The detail_view_edit ACL is required for editing. We do not grant access rights by default.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037545534610\" alt=\"image-20240305-082547.png\"></p>\n<p> </p>\n<h3 id=\"header-16\"><strong>Password Search in the Participant Administration of Personalized Projects</strong></h3>\n<p>As of EFS 24.2, you can search for participants in the participant administration of personalized projects using their password. In personalized projects, passwords are not defined by participants, but are rather access strings that can be sent to participants by e-mail or postal mail. By default, the <strong>Code</strong> option is selected as the login type for personalized projects. However, you can change this to <strong>Password</strong> under <strong>Survey menu</strong> &gt; <strong>Project properties</strong> &gt; <strong>Login options</strong>.</p>\n<p> </p>\n<h3 id=\"header-17\"><strong>Configurable Page Breaks in Receipts</strong></h3>\n<p>The feature for creating receipts for projects has been optimized with the new release. Previously, a new PDF page was created for each survey page when creating receipts. This resulted in extremely long receipt reports. From now on, you will find the option <strong>Insert page break for each page of the questionnaire</strong> in your survey project under <strong>Survey menu &gt; Questionnaire editor &gt; Receipts</strong>. This option is activated by default so that the standard behavior for creating receipts remains unchanged. However, if you no longer want annoying page breaks in your receipt, you can simply deactivate this option.</p>\n<h3 id=\"header-18\"><strong>Updated File Size Limits for Upload Question Types</strong></h3>\n<p>For the <em>143 Upload</em> question type, you can now select the options <strong>12 MB, 32 MB</strong> and <strong>64 MB</strong> as <strong>Max. file size</strong> in the <strong>Detail configuration</strong>. For the <em>143 Audio recorder </em>question type the options <strong>16 MB</strong> and <strong>32 MB </strong>have been added as file size limits.</p>\n<h3 id=\"header-19\"><strong>Simplified Addition of Variables to Advanced Search</strong></h3>\n<p>Under <strong>PA Project &gt; Sample &gt; Search All Samples &gt; Advanced Search</strong>, you can configure up to five additional variables for use in the advanced search by selecting the gear icon on the right-hand side. Previously, these variables could only be selected statically from a list. From now on, the search field supports text input so that you can search the list of available variables more easily.</p>\n<p> </p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037583970962\" alt=\"image-20240305-082840.png\"></p>\n<p> </p>\n<h3 id=\"header-20\"><strong>Creating a Print Version of Questionnaires</strong></h3>\n<p>Some technical changes have been made to the feature for creating a print version of your questionnaire. However, you can still use the feature as usual.</p>\n<p> </p>\n<h3 id=\"header-21\"><strong>Updated File Format for Export/Import of Translation File</strong></h3>\n<p>Under <strong>Projects &gt; Project &gt; Questionnaire editor &gt; Language editor &gt; Export/Import</strong> you can export the text elements and messages of your questionnaire for external editing or translating with MS Excel or a professional translation software. Afterwards, they can be imported again. In the past, the format of the export/import file was XLS. As this format is outdated, we have updated the format to XLSX. So you don’t have to worry about converting files anymore.</p>\n<p> </p>\n<hr>\n<h2 id=\"header-23\">\n<strong>Updates in </strong><em><strong>People</strong></em>\n</h2>\n<p>The <em>People</em> module has remained mostly unchanged in this release. Only two minor changes have been made.</p>\n<h3 id=\"header-25\"><strong>Mass Generation of Registration Keys</strong></h3>\n<p>The limit for the generation of registration keys has been increased from 100,000 keys for a single way of entry and per generation process to 15,000,000.</p>\n<h3 id=\"header-26\"><strong>Renaming of ACLs</strong></h3>\n<p>Two ACLs related to panel privacy have been renamed: \"panel_email_sample\" to \"panel_privacy_sample\" and \"panel_email_groups\" to \"panel_privacy_groups\".</p>\n<p>The change only affects the naming of the ACLs, the rights themselves remain unchanged.</p>\n<p><strong>panel_privacy_sample</strong>:<br>With read rights, the first name, surname and email address of panelists can be displayed in the samples of panel surveys and master data surveys.</p>\n<p><strong>panel_privacy_groups</strong>:<br>With read rights, the first name, last name and email address of panelists can be displayed in the editing dialog of panel groups.</p>\n<hr>\n<h2 id=\"header-28\">\n<strong>Updates in </strong><em><strong>Website</strong></em>\n</h2>\n<p>The<em> Website</em> module has also been optimized for you. In the past, many customers have often asked us about the topic of two-factor authentication in particular, so we are now very pleased to present the new feature to you.</p>\n<h3 id=\"header-30\"><strong>Two-Factor Authentication for Panel Websites</strong></h3>\n<p>You can now set up app-based two-factor authentication for websites. This feature is primarily intended to improve security and prevent unauthorized persons from gaining access to panelists' bonus points. In addition to their password, panelists must enter an app-generated code when logging in with two-factor authentication. The setting options for app-based two-factor authentication are <strong>Disabled</strong> (default setting), <strong>Enabled</strong> and <strong>Enforced</strong>. If you want to change the setting, click on the desired website in your website list to go to the settings page. You can then select the appropriate option from the drop-down menu in the <strong>Login</strong> area.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037583720594\" alt=\"image-20240305-084400.png\"></p>\n<p>Two-factor authentication has been implemented for the current responsive layout of the panel website. Depending on what adjustments have been made to your Panel websites, it may be necessary to adjust the page templates and apply the changes. It is also possible to retrofit older layout versions with two-factor authentication. In both cases Professional Services can provide you with a quote.</p>\n<p>In order to use app-based two-factor authentication, a compatible authentication app is required. Further information on this topic and a list of compatible apps can be found here.</p>\n<p> </p>\n<h4 id=\"header-32\"><strong>Setting Options for App-based Two-Factor Authentication</strong></h4>\n<p>Three different setting options are available:</p>\n<p><strong>Disabled</strong>: Two-factor authentication for the panel website is disabled.</p>\n<p><strong>Enabled</strong>: The panelist has the option of activating two-factor authentication under \"My Details\". The setup is initiated by clicking on the <strong>Show QR Code</strong> button.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037561335186\" alt=\"image-20240229-091152.png\"></p>\n<p>The displayed QR code must then be scanned using a mobile phone and the code displayed must be entered in the corresponding field. After clicking <strong>Send</strong>, the successful activation of the two-factor authentication is confirmed. If the panelist now attempts to log in to their account, they will be asked to enter the generated code from the app apart from their login credentials. They can only log in once they enter this code. After successful activation, two-factor authentication can be deactivated again in the same area under “My details”.</p>\n<p><strong>Enforced</strong>: If you select the option <strong>Enforced</strong>, panelists will be prompted to scan the QR code and enter the code from the app immediately after entering their login credentials. So they will no longer be able to access the account without setting up two-factor authentication. When setting two-factor authentication to <strong>Enforced,</strong> it can also no longer be deactivated by the panelist once it has been set up. However, panelists have the option of scanning a new code under “My Details”, if desired.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037582422162\" alt=\"image-20240229-102959.png\"></p>\n<p> </p>\n<h3 id=\"header-34\">\n<strong>Resetting Two-Factor Authentication in the </strong><em><strong>People</strong></em><strong> Module</strong>\n</h3>\n<p>As soon as the panelist has fully set up two-factor authentication by scanning the QR code and entering the code from the app, the <strong>Reset 2FA</strong> button is displayed in the panelist administration for this panelist. By clicking this button, you can reset the two-factor authentication for the panelist in question so that they have to scan the QR code again the next time they log in.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21037607701650\" alt=\"image-20240305-085340.png\"></p>\n<p> </p>\n<h3 id=\"header-35\"><strong>Behavior in Case of Incorrect Code Entry</strong></h3>\n<p>The behavior in case of incorrect code entry is similar to the behavior of incorrect password entry. The settings (such as the number of permitted failed attempts, brute force account lockout time, etc.) that you configure for your website under <strong>Global configuration</strong> &gt; <strong>Login </strong>or<strong> Global configuration</strong> &gt; <strong>Password security</strong> therefore also apply to two-factor authentication.</p>\n<p> </p>\n<h3 id=\"header-36\"><strong>Feed Subscriptions</strong></h3>\n<p>The menu item <strong>Feed subscriptions</strong> under<strong> Website &gt; Language version &gt; Standard content &gt; Feed subscriptions</strong> has been removed.</p>\n<hr>\n<p> </p>\n<h4 id=\"header-38\">\n<strong><sub>[1] </sub></strong><sub>I</sub><sub>mportant Disclaimer for Survey Question Types with Video and Audio Recording</sub>\n</h4>\n<p><sub>As part of our commitment to effective feedback and experience management, we are pleased to introduce the new question types video and audio recording functions to our offerings. While we strive to provide our users with a wide range of tools, we also emphasize the importance of using these functions responsibly.</sub></p>\n<ol start=\"1\">\n<li>\n<p><strong><sub>Use with care: </sub></strong><sub>The video and audio recording functions must not be misused. This includes, but is not limited to, recording content that violates privacy regulations, copyright laws, or other legal provisions.</sub></p>\n</li>\n<li>\n<p><strong><sub>Limited Use:</sub></strong><sub> We employ a fair use policy for the video recording function to ensure equitable access and optimal service levels for all our users. Rather than imposing a strict limit, we expect each user to use the video storage feature reasonably, within the bounds of average usage patterns. This approach is designed to prevent overloading our servers while offering flexibility for our users' diverse needs.</sub></p>\n<ol start=\"1\">\n<li>\n<p><sub>Should your usage significantly exceed typical patterns, we will engage in a dialogue to explore solutions, which may include optimizing video use or discussing alternative arrangements for high-volume needs.</sub></p>\n</li>\n<li>\n<p><sub>This policy aims to balance the need for generous access with the sustainability of our services, ensuring all users benefit from the video recording function.</sub></p>\n</li>\n</ol>\n</li>\n<li>\n<p><strong><sub>Prohibited Material:</sub></strong><sub> It is strictly forbidden to upload material that is considered banned, offensive, defamatory, or otherwise inappropriate. This includes content that depicts or promotes violence, hate speech, sexually explicit materials, or illegal activities.</sub></p>\n</li>\n</ol>\n<p><sub>We reserve the right to suspend access and remove content that violates these guidelines. Users who breach these terms may be subject to legal action.</sub></p>\n<p><sub>By using our video and audio recording features, you agree to these terms and acknowledge that you are responsible for the content you create. The concluded contractual provisions and our GTC shall always apply to the survey question types with video and audio recording.</sub></p>\n<p> </p>",
    "user_segment_ids": []
}