{
    "id": 21036789446162,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21036789446162.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21036789446162-EFS-Release-Notes-22-1",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 4,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-29T09:27:46Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Notes 22.1",
    "title": "EFS Release Notes 22.1",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:43:28Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6ER31E7D63N2189G7YQTQAJ\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Enhancements to EFS platform</a>\n<ul>\n<li><a href=\"#header-3\">App-based Authentication</a></li>\n<li><a href=\"#header-5\">New Security Headers</a></li>\n<li><a href=\"#header-6\">Do-Not-SMS List</a></li>\n<li><a href=\"#header-7\">Other Enhancements to EFS Platform</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-9\">Enhancements to Projects</a>\n<ul>\n<li><a href=\"#header-11\">PDF Receipts</a></li>\n<li><a href=\"#header-12\">Other Enhancements to Projects</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-14\">Enhancements to People</a>\n<ul>\n<li><a href=\"#header-16\">Management of Genders</a></li>\n<li><a href=\"#header-17\">Other Enhancements to People</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-19\">Enhancements to Portals</a>\n<ul>\n<li><a href=\"#header-21\">Adding the Guide Initiator to the Panel Group</a></li>\n<li><a href=\"#header-22\">Report List: Improved Usability</a></li>\n<li><a href=\"#header-23\">Other Enhancements to Portals</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-25\">Enhancements to Panel Website</a>\n<ul>\n<li><a href=\"#header-27\">Community Content disabled by default</a></li>\n<li><a href=\"#header-28\">Usability Improvement</a></li>\n</ul>\n</li>\n<li><a href=\"#header-30\">New Service Layer Services</a></li>\n</ul>\n<div class=\"expand-macro\">\n<p><em>In this release, we have improved the security of our platform and our modules, by developing a new two-factor authentication and extending the security related header function.</em></p>\n<p>We have also rebuilt the receipts feature. You're now able to provide the completed survey as a PDF receipt via download link and e-mail to your participants without our help.</p>\n<p>Read more about our <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229702688786\" target=\"_blank\" rel=\"noopener noreferrer\">updated cookie list</a>.</p>\n</div>\n<h1 id=\"header-1\">Enhancements to EFS platform</h1>\n<hr>\n<h2 id=\"header-3\">App-based Authentication</h2>\n<p>To add an extra layer of security, you can now optionally protect the EFS admin area account with the new two-factor authentication. You'll be required to provide an additional authentication code from an <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231346702866\" target=\"_blank\" rel=\"noopener noreferrer\">Authenticator app</a>, each time you login into your EFS account.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036790746002\" alt=\"Bildschirmfoto 2022-03-14 um 11.11.09.png\"></p>\n<p>After entering invalid codes several times, the accounts will be blocked. This behavior is similar to the behavior of entering an invalid password. In addition to this brute force protection, EFS also has a replay protection, so that an already used code cannot be reused by an attacker who might have somehow intercepted it.</p>\n<ul>\n<li>\n<p>Two-factor authentication is available on all installations and can be enabled by any user.</p>\n</li>\n<li>\n<p>Your installation can be configured to force all accounts to use app-based authentication. Please contact our support team.</p>\n</li>\n</ul>\n<h3 id=\"header-5\">New Security Headers</h3>\n<p>To increase the security of the <em>Projects</em>, <em>Portals</em>, and <em>Panel Website </em>modules, we have implemented new security-related headers. These headers will be sent with each page to ask the browser not to allow certain actions or script types.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036810779922\" alt=\"screen_englisch.png\"></p>\n<p>The following security headers are available:</p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Referrer-Policy\" target=\"_blank\" rel=\"noopener noreferrer\">Referrer-Policy</a>: Use this header to define which referrer information will be sent to 3<sup>rd</sup> party websites when clicking on a link within EFS. </p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy\" target=\"_blank\" rel=\"noopener noreferrer\">Content-Security-Policy</a>: The Content Security Policy is an effective measure to protect your website from XXS attacks. By whitelisting sources for approved content, you can prevent the browser from loading malicious assets.</p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Feature-Policy\" target=\"_blank\" rel=\"noopener noreferrer\">Permissions-Policy</a>: Use this header to define which APIs might be used, e.g. payment, camera, microphone or USB access.</p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options\" target=\"_blank\" rel=\"noopener noreferrer\">X-Content-Type-Options</a>: Use this header to block a request, if the request destination is of type “style” and the MIME type is not “text/css”, or of type “script” and the MIME type is not a “JavaScript” MIME type.</p>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-XSS-Protection\" target=\"_blank\" rel=\"noopener noreferrer\">X-XSS-Protection</a>: Use this header to enable XSS filtering (usually default in browsers). If a cross-site scripting attack is detected, the browser will sanitize the page (remove the unsafe parts).</p>\n<p>In <em>Projects</em>, the option \"Should an X-Frame-Options header be sent to the client?\", has been moved from the <strong>General Options</strong> tab to the new <strong>Security</strong> tab within the <strong>Survey Options</strong>.</p>\n<h3 id=\"header-6\">Do-Not-SMS List</h3>\n<p>In addition to the <em>Do-Not-Email</em> list, you now also have a <em>Do-not-SMS list</em> to block mobile phone numbers from receiving SMS notifications on a global and/or project-specific level.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036807240978\" alt=\"Bildschirmfoto 2022-03-08 um 15.20.12.png\"></p>\n<p>You can import, export (Excel and CSV) the <em>Do-not-SMS list</em>, and configure the table view. Use the checkbox to remove mobile phone numbers from the list. Just check the mobile phone numbers you want to remove from the list. Use the <em>#unsubscribe_global#</em> and <em>#unsubscribe_survey#</em> placeholders to insert links in SMS messages, so that participants are allowed to add their own mobile phone number to the <em>Do-not-SMS</em> list.</p>\n<p>New <a href=\"#header-30\">service layer methods</a> are also available for adding to the list, checking, and removing mobile numbers from the list.</p>\n<h3 id=\"header-7\">Other Enhancements to EFS Platform</h3>\n<ul>\n<li>\n<p><strong>Uploading fonts and new file types (media library)</strong>: As of this release, the media library supports new file types, such as web-fonts (<em>woff, woff2, otf, eot, svg, jp2, webm, webp</em>).</p>\n</li>\n<li>\n<p><strong>Customized maintenance page</strong>: The maintenance page can now be adapted to your corporate identity. Customers with extended access rights, will find a new <strong>Maintenance</strong> tab of the <strong>Branding</strong> menu (Options).</p>\n</li>\n<li>\n<p><strong>Changed user menu</strong>: We made changes to the user menu. The <em>Edit account</em> menu item was renamed. It is now called <em>Edit user data</em>. We also added the <em>Security</em> menu item to connect the user menu with security area. There you can now change your password.</p>\n</li>\n<li>\n<p><strong>Sending SMS</strong>: When sending SMS, additional information are now available, for example the encoding of the SMS and a SMS counter that counts how many SMS will be used for the message.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-9\">Enhancements to <em>Projects</em>\n</h2>\n<hr>\n<h3 id=\"header-11\">PDF Receipts</h3>\n<p>We have rebuilt the <strong>Receipts</strong> section of the <strong>Questionnaire Editor</strong> completely. You are now able to provide survey participants with the completed questionnaire as a PDF receipt via a download link and/or via e-mail attachment, without the need to involve Tivian.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036827033362\" alt=\"Bildschirmfoto 2022-03-11 um 09.47.17.png\"></p>\n<p>Using the <strong>Exclude questions</strong> tab, you can customize the PDF receipt and exclude questions. Thus, the PDF receipts will contain the questions seen by a participant and the ones you exclude.</p>\n<p>Use the <strong>Layout</strong> menu to edit layout elements of the PDF receipts, for example Header, Footer und CSS.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036791404434\" alt=\"Bildschirmfoto 2022-03-10 um 15.29.51.png\"></p>\n<p>PDF receipts are available for Responsive Layout 3 and Responsive Layout 3.1.</p>\n<h3 id=\"header-12\">Other Enhancements to <em>Projects</em>\n</h3>\n<ul>\n<li>\n<p><strong>The </strong><em><strong>Block email</strong></em><strong> question type</strong>: The <em>Block email</em> question type, which can be selected on end pages, also supports the SMS block list. This applies to Responsive Layout 3.1.</p>\n</li>\n<li>\n<p><strong>Additional headers for your email templates</strong>: Using the new function \"Additional headers\" you can add your own headers to your email template. The placeholders <em>#unsubscribe_global#</em> and <em>#unsubscribe_survey#</em> can be used.</p>\n</li>\n<li>\n<p><strong>Layout Pro Editor</strong>: The Layout Pro Editor has been extended to provide <strong>Create Template, Export and Import</strong> functionality for all sections.</p>\n</li>\n<li>\n<p><strong>New Panlist ID column (ES projects)</strong>: The column \"Panelist ID” is available in the participant administration of ES projects for user groups that have the read permission <em>search_panel.</em> Participants will be linked to the panelist and you can jump from the participant management of your ES project to the panelist administration. This works for employee projects where the \"Panelist import from employee project\" feature was used. The feature is disabled by default.</p>\n</li>\n</ul>\n<p>For more information about all the changes in Responsive Layout 3.1, see the <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231051934610\" target=\"_blank\" rel=\"noopener noreferrer\">Layout Change-Log</a>.</p>\n<p> </p>\n<h2 id=\"header-14\">Enhancements to <em>People</em>\n</h2>\n<hr>\n<h3 id=\"header-16\">Management of Genders</h3>\n<p>The People module now allows you to create and use more than the previously two genders for your panelists. New genders can be created and be managed via your own list in the <strong>Panel configuration</strong>. A handy panelist counter shows the usage of genders and blocks the deletion if panelists are assigned to a gender.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036817992082\" alt=\"Bildschirmfoto 2022-03-14 um 15.31.10.png\"></p>\n<p>Your manually created genders will be available in Panelist administration, Portals and Panel/ Master data surveys. They will also be available in <em>Panel Service Layer</em> calls.</p>\n<p>The <strong>Panelist administration</strong> is single-language. Translations into other languages can be made within the individual features/ modules, just like for other master data variables .</p>\n<h3 id=\"header-17\">Other Enhancements to <em>People</em>\n</h3>\n<ul>\n<li>\n<p><strong>Bulk edit of panelists</strong>: The bulk edit of the panelist administration now allows updating based on the <em>site id</em> (language version), <em>u_gender</em>, <em>pci</em>, <em>u_timezone</em>, <em>u_locale</em> variable</p>\n</li>\n<li>\n<p><strong>New update rule</strong>: In the <strong>Actions</strong> menu, you can now create the <strong>Delete panelists</strong> update rule, which minimizes the maintenance effort of the panel groups. If this action is performed, the panelists to whom this rule applies will be deleted from the panel.</p>\n</li>\n<li>\n<p><strong>Removing panelists from a group</strong>: To make removing panelists from a panel group more intuitive, you have a <strong>Delete</strong> icon in the <strong>Actions</strong> column that allows you to remove the panelist from the group (if you have the <em>panelgrp_admin</em> read permission). Removing panelists from the default group is not possible.</p>\n</li>\n<li>\n<p><strong>Panelist Detail View</strong>: Panel groups for which an update rule has been set up are now marked with an icon. This icon will also serve you as a link to go to the update rules of the panel.</p>\n</li>\n<li>\n<p><strong>Search for e-mail addresses</strong>: From now on, the advanced search of the panelist administration offers the possibility to search for multiple panelists by e-mail address. Simply enter one e-mail address per line. You can search for up to 50 e-mail addresses simultaneously.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-19\">Enhancements to <em>Portals</em>\n</h2>\n<hr>\n<h3 id=\"header-21\">Adding the Guide Initiator to the Panel Group</h3>\n<p>Setting up <em>Tableau</em> dashboards to visualize your guides' results used to take some effort because the panel groups you selected rarely included the members you wanted. Using the new option <strong>\"Add guide initiators to the following panel-group\"</strong>, you can specify in the <em>Guides</em> module configuration to which panel group guide initiators will be added.</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036809947666\" alt=\"Bildschirmfoto 2022-03-14 um 15.37.23.png\"></p>\n<p>The feature takes multi-tenancy into account. Guide initiators will only be added to panel groups of their organization.</p>\n<h3 id=\"header-22\">Report List: Improved Usability</h3>\n<p>The usability of the <em>Portals</em> page module <em>Report List</em> has been improved. The reports that participants have access to are now sorted by the new default filter All. The filter is available by default for the report list types <em>ES Projects</em> and <em>Guides</em>.</p>\n<p>In addition, the two list views of the module (<em>ES projects</em>,<em> Guides</em>) have a new table column. This new column lists the ES project names or Guide names in descending order based on the creation date.</p>\n<h3 id=\"header-23\">Other Enhancements to <em>Portals</em>\n</h3>\n<ul>\n<li>\n<p><strong>Adding participants by e-mail address (Action Board)</strong>: From now on, the e-mail address of participants you want to add to an action will also be displayed, so that you always know who you are adding to an action.</p>\n</li>\n<li>\n<p><strong>Removing participants (Action Board)</strong>: The process of removing groups and users has been improved. Depending on whether you select the group avatar or user avatar in the participant section of an action, the corresponding button, i.e. group or user, is already preselected in the overlay menu.</p>\n</li>\n<li>\n<p><strong>New character limit in guide setup (Guides)</strong>: In the guide setup, guide initiators can write a message. Until now the character limit was 255 characters. With this release, the limit is raised to 65535 characters.</p>\n</li>\n<li>\n<p><strong>New tooltips in the Look &amp; Feel area (CMS area)</strong>: New tooltips inform you about the effects of possible color changes in the <em>Look &amp; Feel </em>area.</p>\n</li>\n<li>\n<p><strong>New character limit (Text and Multimedia)</strong>: The character limit of the text field of the <em>Text and Multimedia </em>module has been increased to 100,000.</p>\n</li>\n<li>\n<p><strong>Adjustment (Extension)</strong>: The API of the <em>Portals</em> module <em>Extension </em>has now an <em>EFS</em> object instead of a <em>Questback</em> object, for example, you should use <em>EFS.portalsApi.isInitialized();</em> now. <em>Questback</em> is also available as an alias for now to ensure backwards compatibility.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-25\">Enhancements to <em>Panel Website</em>\n</h2>\n<hr>\n<h3 id=\"header-27\">Community Content disabled by default</h3>\n<p>As of this release, the community content will be disabled by default on <strong>new</strong> EFS installations. The <strong>Quick Polls</strong> menu item is moved from <strong>Community content</strong> to <strong>Standard content</strong>.</p>\n<h3 id=\"header-28\">Usability Improvement</h3>\n<p>To prevent incorrect assignment of panelists to offline websites, <em>offline</em> will be added to the language version, if the the language or the whole website is offline.</p>\n<p> </p>\n<h2 id=\"header-30\">New Service Layer Services</h2>\n<hr>\n<table border=\"1\" data-layout=\"default\">\n<colgroup> <col style=\"width: 340.0px;\"> <col style=\"width: 340.0px;\"> </colgroup>\n<tbody>\n<tr>\n<th data-highlight-colour=\"#c0b6f2\">\n<p><strong>Service</strong></p>\n</th>\n<th data-highlight-colour=\"#c0b6f2\">\n<p><strong>Meaning</strong></p>\n</th>\n</tr>\n<tr>\n<td>\n<p>efs.smsblocklist.add(array(phone-numbers))</p>\n</td>\n<td>\n<p>Imports a list of numbers into the blocklist, returns list of numbers and their import status</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>efs.smsblocklist.delete(array(phone-numbers))</p>\n</td>\n<td>\n<p>Deletes a list of numbers from the blocklist, returns list of numbers and their delete status</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>efs.smsblocklist.getList</p>\n</td>\n<td>\n<p>Returns the list of all numbers on the blocklist</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>efs.smsblocklist.getListByDateRange(daterange)</p>\n</td>\n<td>\n<p>Returns the list of all numbers on the blocklist within the given date range</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>efs.smsblocklist.getListByNumber(phone-number)</p>\n</td>\n<td>\n<p>Returns a list of all surveys where given number is on the blocklist. In case of global bocklist, the surveyId is 0.</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>efs.smsblocklist.isBlocked(number,surveyId (opt))</p>\n</td>\n<td>\n<p>Check whether number is on the blocklist for given survey, in this case the global blocklist will not be checked. If surveyId is not specified checks whether email is in global blocklist.</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p> </p>",
    "user_segment_ids": []
}