{
    "id": 21036859457938,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21036859457938.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21036859457938-EFS-Release-Notes-21-2",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 5,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20232761313554,
    "created_at": "2024-08-29T09:29:11Z",
    "updated_at": "2024-08-29T10:11:56Z",
    "name": "EFS Release Notes 21.2",
    "title": "EFS Release Notes 21.2",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-08-29T09:39:39Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<h2 id=\"h_01J6EQM5F3D9DJEY1X361XBY5R\">Table of Contents</h2>\n<ul>\n<li>\n<a href=\"#header-1\">Enhancements to Surveys (Projects)</a>\n<ul>\n<li><a href=\"#header-3\">Project-Snapshots</a></li>\n<li><a href=\"#header-5\">Layout versioning</a></li>\n<li>\n<a href=\"#header-6\">Responsive Layout 3.1</a>\n<ul>\n<li><a href=\"#header-8\">Carousel question type</a></li>\n<li><a href=\"#header-9\">Dynamic questions on the same page</a></li>\n<li><a href=\"#header-10\">Enhancements to Upload question type</a></li>\n<li><a href=\"#header-11\">New Page fade-in</a></li>\n</ul>\n</li>\n<li><a href=\"#header-13\">Back button data correction</a></li>\n<li><a href=\"#header-14\">Update to the SMS module and SMS delivery notifications</a></li>\n<li><a href=\"#header-15\">Additional survey improvements</a></li>\n</ul>\n</li>\n<li>\n<a href=\"#header-17\">Enhancements to Portals</a>\n<ul>\n<li><a href=\"#header-19\">Multi-tenant Portals</a></li>\n<li><a href=\"#header-20\">Other new features in Portals</a></li>\n</ul>\n</li>\n<li><a href=\"#header-22\">Enhancements to People</a></li>\n<li><a href=\"#header-23\">Enhancement to MySight</a></li>\n</ul>\n<div class=\"expand-macro\"> </div>\n<h2 id=\"header-1\">Enhancements to Surveys (Projects)</h2>\n<hr>\n<h3 id=\"header-3\">Project-Snapshots</h3>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036860449298\" alt=\"image-20210824-145549.png\"></p>\n<p>Our new <em>Project snapshots</em> features allows you to take a snapshot of an existing project. The snapshot is a copy of the questionnaire and the layout assigned to that questionnaire, and can be previewed and tested like a normal project. Existing live projects can be updated with a snapshot version without any impact to existing survey or participant data. There are two main ways in which you may wish to use a snapshot of a project:</p>\n<ul>\n<li>\n<p>As a <strong>backup of a project</strong> to which you plan to make changes. By taking the snapshot you can rollback any change you make to the master project should you be unhappy with them, by simply updating the project with the snapshot version.</p>\n</li>\n<li>\n<p>As a <strong>test version of your project</strong>. You can create a snapshot of your project and make any required changes to both the questionnaire and the layout to the snapshot. These can be fully tested before updating the master project with the snapshot, removing any risk of making incorrect changes to a live project.</p>\n</li>\n</ul>\n<h3 id=\"header-5\">Layout versioning</h3>\n<p>Our new <em>layout versioning </em>feature ensures that any live projects are not negatively impacted should we make any changes to a layout version. Sometimes we will make changes to a survey layout version to apply security updates, bug fixes and enhancements. In the past these changes have been applied directly to the layout version and therefore all projects using that layout version. In some cases, this has led to issues with the project where local changes or customisations have not been compatible with the new version. From now on, any changes Tivian make to a layout version will be introduced as a new layout version. For example, changes to Responsive Layout 3 included in this release will now be introduced as Responsive Layout 3.1.</p>\n<p>This means you can now control when you would like to apply the latest layout version to your live projects, for example, after the field phase has ended, using our <em>Layout migration</em> feature. It is also possible to revert projects back to earlier layout versions, so should you have local changes in your project that are not compatible with the latest layout version you can simply migrate the project back to a previous version with which the project was compatible.</p>\n<p>It is possible to migrate a layout version to an earlier version or a later version within the same major version (e.g. moving between Responsive Layout 3 and 3.1) but not between major versions (e.g. you cannot migrate a survey’s layout from Responsive Layout 2 to Responsive Layout 3).</p>\n<p>Please note, customised layout are not automatically updated with a new version release, and custom question types are not automatically available in later versions (these must be manually updated to support a later layout version).</p>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036815912850\" alt=\"image-20210824-154735.png\"></p>\n<h3 id=\"header-6\">Responsive Layout 3.1</h3>\n<p>Our new version of Responsive Layout 3 (version 3.1) includes a new question type, improvements to an existing question type and also a new feature that will allow you to create more streamlined and user-friendly questionnaires.</p>\n<p> </p>\n<h4 id=\"header-8\">Carousel question type</h4>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036816658450\" alt=\"image-20210824-122607.png\"></p>\n<p>The carousel question type is one that has been requested by many customers so we are delighted to include this new question type with Responsive Layout 3.1. This question type provides a more intuitive and simple way for a respondent to provide answers to a long list of questions. Rather than presenting a long list of questions, each question is shown individually to the respondent and the survey automatically switches to the next question upon completion of the current question. This new question type supports both left to right and right to left languages.</p>\n<p> </p>\n<h4 id=\"header-9\">Dynamic questions on the same page</h4>\n<p>We are very excited to introduce an improvement to our current <em>hiding conditions</em> feature. Previously, if you wanted to show additional questions to a survey respondent based on an answer to a question they had already completed, these additional questions would need to appear on a new page in the survey. With our new enhancement it is now possible to create hiding conditions for questions, based on questions appearing on the same page of the questionnaire. This provides a much nicer respondent experience, allowing you to present all related questions on one page, rather than interrupting the respondents concentration by requiring a page submission and a new page load before follow up questions could be asked.</p>\n<p>Please note that only the variables of the displayed questions (and not the variables of the hidden ones) will be stored.</p>\n<p> </p>\n<h4 id=\"header-10\">Enhancements to Upload question type</h4>\n<p>Our new <em>Force creation of new video of photo</em> setting improves the respondent experience by automatically starting the camera application when the respondent has selected to upload an image or video and has clicked the upload button. This feature will work for any respondent using a suitable mobile device (iOS and recent Android version). Users responding on a desktop or unsupported mobile devices will still be able to upload a file using the file selection dialog.</p>\n<p>Furthermore, to increase the security of our projects and prevent the malicious uploading of dangerous files, this question type now checks the contents of the file to ensure that the file is of the correct file type.</p>\n<p> </p>\n<h4 id=\"header-11\">New Page fade-in</h4>\n<p>In our new layout version we include our new page fade-in feature. New pages in the questionnaire will fade in to prevent “visual distractions” whilst the new page is being loaded. This feature is turned on by default.</p>\n<p>For more information about all the changes in Responsive Layout 3.1, see the <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20231051934610\" target=\"_blank\" rel=\"noopener noreferrer\">Layout Change-Log</a>.</p>\n<h3 id=\"header-13\">Back button data correction</h3>\n<p>Previously, when respondents used the back button in the survey or their internet browser, all responses already provided would be saved in the survey. If the respondent, after going backwards in the survey, changed an answer based on which the survey branched, this could result in data being saved in that respondents record for questions that should not be presented to them based on the new branching question response. Worse still, it could result in the respondent being taken down an incorrect path in the survey based on these stored responses. Now, if a respondent goes backwards in the survey and changes a previous branching question answer, and our new <em>Back button data correction </em>project property is set, the system will reset any questions that are part the previous branching path to their default value. This ensures that invalid data is not stored for the respondent, and the correct path is taken throughout the survey.</p>\n<p>Please note, all other survey responses not impacted by a change in branching logic are not reset and are saved in the respondents record. This property is disabled by default.</p>\n<p> </p>\n<h3 id=\"header-14\">Update to the SMS module and SMS delivery notifications</h3>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036824422162\" alt=\"Screenshot 2021-08-24 at 15.16.54-20210824-131700.png\"></p>\n<p>In addition to being able to send notifications to survey respondents via email, we have an optional SMS module supporting the delivery of invites, reminders and other notifications via SMS message. This module had undergone some technical improvements to provide a more reliable service. In addition, we have extended our <em>Mail Report</em> area to include delivery information for your SMS messages. The brand new mail report for SMS will allow you to see how many messages are <em>In Dispatch</em>, <em>Sent</em> and <em>Not Delivered</em>. This way you always have an overview of your SMS delivery rates and can react immediately if they are lower than expected.</p>\n<p><a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20371076859410#sms\" target=\"_blank\" rel=\"noopener noreferrer\">Read more...</a></p>\n<p> </p>\n<h3 id=\"header-15\">Additional survey improvements</h3>\n<ul>\n<li>\n<p>#pauth# and #pstaff# are two new placeholders now available for use in mail templates. These will show the author and co-author of the survey.</p>\n</li>\n<li>\n<p>#pid# and #sid# are two new placeholders now available for use in Projects. These will show the Project ID and Sample ID of the project.</p>\n</li>\n<li>\n<p>It is now possible to recode the labels of the u_ and m_ variables into survey variables. This is possible for the following project types : Personalised, Employee, Panel and Master Data Surveys.</p>\n</li>\n<li>\n<p>It is now possible to make any questions using the Linked Slider and Constant Sum questions types mandatory.</p>\n</li>\n<li>\n<p>The mail report now displays selected delivery options (e.g. “use timezone of recipient”)</p>\n</li>\n<li>\n<p>The default value for the duration of participation (30 minutes) is now customizable. Please ask the Tivian support team, if you want to customize it.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-17\">Enhancements to Portals</h2>\n<hr>\n<h3 id=\"header-19\">Multi-tenant Portals</h3>\n<p>We have carried out some significant enhancements to our portals module that means, as of our 21.2 release, all portals are by default multi-tenancy ready. This means that one portal can be used by multiple groups. These could be different organizations, brands or divisions. Basically any group of individuals that should be silo’d from another group of individuals. Each user accessing the portal will only have access to the features, modules and data appropriate to their group.</p>\n<p>To utilise multi-tenancy all you need to do is create one or multiple <em>categories/organizations</em> within the groups area of the People module, and one or multiple panel groups for each group of panelists that you wish to separate from others in the panel. Once your groups have been created, any new users invited to join the portal will be automatically added to the correct group. Users joining the portal via the registration module will be added to the default panel group and category/organization.</p>\n<p> </p>\n<h3 id=\"header-20\">Other new features in Portals</h3>\n<ul>\n<li>\n<p><strong>More convenient portal testing</strong>: As an admin user you typically want to preview or test the changes that you have done in the backend. This workflow has been simplified with our new direct login feature that will be visible in the breadcrumbs of the portals module. All panelists with the status tester will be available for direct, one-click login into the portal. No need to copy &amp; paste the email and remember the password anymore!</p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036835464594\" alt=\"image-20210914-151151.png\"></p>\n<ul>\n<li>\n<p><strong>Page access via user roles</strong>: In addition to panel groups, pages can now also be restricted to user roles within the portal.</p>\n</li>\n</ul>\n<p><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21036845695250\" alt=\"image-20210825-071235.png\"></p>\n<ul>\n<li>\n<p><strong>Allow deletion of logos</strong>: You now have the option to reset the customized logo and favicon to the default value.</p>\n</li>\n<li>\n<p><strong>Displaying the IDEA and TOPIC guides in cards:</strong> From now on it is possible to display the survey from IDEA and TOPIC guides directly in the portal using the <em>Cards</em> page module Cards. Some other minor enhancements have been made to this portals page module.</p>\n</li>\n<li>\n<p><strong>Prevent selection of offline users in IDEA guide setup: </strong>Offline users can no longer be added through the IDEA Guide Setup search, as they will not be able to participate in the guide type.</p>\n</li>\n<li>\n<p><strong>Mandatory self-assessment for ME guide</strong>: The ME guide has been amended so that any guide configured to include a self-assessment step requires the completion of that self-assessment. It is no longer possible to have an optional self-assessment as part of the process.</p>\n</li>\n<li>\n<p><strong>Updated Login/Registration module: </strong>It is now possible to hide the Account, First Name and Last Name fields from the registration module. In addition these fields can also be mandated.</p>\n</li>\n<li>\n<p><strong>Immediate login after registration : </strong>Previously, when users were invited to register for a portal, they would complete their registration details and would then be directed to log into the portal. With this release, new users will be logged in immediately after registration is complete.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-22\">Enhancements to People</h2>\n<hr>\n<p>We have made some minor changes in the People module:</p>\n<ul>\n<li>\n<p><strong>Bonus point deduction using update rules : </strong>It has always been possible to add bonus points to a panelist using our update rules, but now we have also added the ability to subtract bonus points using update rules. <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229223482514\" target=\"_blank\" rel=\"noopener noreferrer\">Read more</a></p>\n</li>\n<li>\n<p><strong>Dependency checking when deleting groups</strong>: It is no longer possible to delete a group that is used elsewhere in the platform. If you are being prevented from deleting a group, you can use our new <em>Usage </em>tab in the detail view for each group to see where the group is currently being used. <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20229223482514\" target=\"_blank\" rel=\"noopener noreferrer\">Read more</a></p>\n</li>\n<li>\n<p><strong>Fix to </strong><em><strong>Update data</strong></em><strong> batch update function</strong>: When updating a panelist to a status of <em>Inactive </em>via the panel administration area, these panelists were automatically deactivated in any surveys they were included in. However, when doing a batch update using the <em>Update data</em> function to set panelists to <em>Inactive</em> this deactivation in the survey was not taking place. This issue has now been resolved.</p>\n</li>\n<li>\n<p><strong>Sample overview update: </strong>The panelist's survey expiry is now displayed in the sample overview of Panel and Master Data surveys.</p>\n</li>\n</ul>\n<p> </p>\n<h2 id=\"header-23\">Enhancement to MySight</h2>\n<hr>\n<p>In the MySight module the support for Employee projects has been extended. The data sources now use the new <a href=\"https://help.tableau.com/current/pro/desktop/en-gb/datasource_datamodel.htm\" target=\"_blank\" rel=\"noopener noreferrer\" data-card-appearance=\"inline\">Tableau Data Model</a>, and the organizational structures of a project in the data source have been extended with many useful properties and information. All these changes allow our experts to provide you with even faster and better dashboards.</p>",
    "user_segment_ids": []
}