{
    "id": 21254295226386,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21254295226386.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21254295226386-Extending-Organization-Expiration-date",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20389541164690,
    "created_at": "2024-09-09T11:42:47Z",
    "updated_at": "2024-12-04T15:06:36Z",
    "name": "Extending Organization Expiration date",
    "title": "Extending Organization Expiration date",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-12-04T15:06:36Z",
    "user_segment_id": 360000084973,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [
        "License",
        "Expiration",
        "Dropbox",
        "Stripe",
        "Extension"
    ],
    "body": "<h1 id=\"h_01J7BAA33G8YBTHJ7C2NYREBZS\">Overview</h1>\n<p>This article provides a step-by-step guide on how to extend an organization's expiration date in the system.</p>\n<h3 id=\"h_01J7BC0VX6E8CMED96SCJBRJP2\">Handling the Request</h3>\n<ul>\n<li>\n<strong>If the request is coming from BU (internal requester):</strong> You can proceed with the solution provided below.</li>\n<li>\n<strong>If the request is coming from a customer:</strong> You will need to contact the account manager (as per SRT) to confirm the extension request before proceeding.</li>\n<li>\n<strong>If the request is coming from <a rel=\"noopener\">techsupport@tivian.com</a> (with the subject \"Organisationscheck a-prod-de-03\"):</strong> This indicates the ticket was generated by an automated job checking for soon-to-expire environments.\n<ul>\n<li>If the ticket body shows \"No Content\". this means the script is having an issue, and should be investigated by L2 team.</li>\n<li>If the ticket shows the message <code>No organisations were found</code>, the ticket can be closed.</li>\n<li>If you find some listed URLs, you will need to search in <a href=\"https://trilogy-sales.lightning.force.com/lightning/page/home\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>Central Trilogy SF</strong></a> for each customer organization and decide based on the SF details whether the org requires extension or not.\n<ul>\n<li>If SF is unclear or you can't find the customer, please contact the account manager (as per SRT) to confirm the extension request for each organization before proceeding.</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3 id=\"h_01J7BC0VX64427VQ27RKSGVG22\">Solution: Extending the Organization Expiration Date</h3>\n<p>To extend the organization's contract and user accounts in the system, follow these steps:</p>\n<ol>\n<li>Open <strong>System =&gt; Users =&gt; Organizations</strong>.</li>\n<li>Locate and open the organization that needs to be extended.</li>\n<li>Adjust the 'End of contract' date to reflect the new expiration date.<br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21255751210770\">\n</li>\n</ol>\n<p>After extending the organization, ensure that you check the associated user accounts:</p>\n<ol>\n<li>Open <strong>System Users Organizations</strong>.</li>\n<li>Open the organization that has been extended, and click on 'Show assigned users.'</li>\n<li>Review the expiry dates of all users.</li>\n</ol>\n<ul>\n<li>\n<strong>For accumulative installations:</strong> Extend the expiry dates of all users accordingly. Inform the customer of the changes.</li>\n<li>\n<strong>For customer installations:</strong> Extend the expiry date of the user who made the request. If this is an administrator, inform them to extend the other user accounts as needed.</li>\n</ul>\n<h1 id=\"h_01J7BAA33GFGQZTAMYAZZVYXG2\">Summary</h1>\n<p>Extending an organization’s expiration date involves updating both the organization’s contract end date and the associated user accounts. The process differs slightly depending on whether the request comes from internal teams, customers, or automated system checks. Always ensure to confirm extension requests with the account manager before proceeding.</p>\n<p> </p>\n<hr>\n<p> </p>\n<p><strong>FAQ:</strong></p>\n<ol>\n<li>\n<p><strong>What should I do if I receive an automated ticket from \"Organisationscheck a-prod-xxx\", but no URLs are listed?</strong></p>\n<ul>\n<li>This indicates that no expiration is imminent, and you can safely close the ticket.</li>\n</ul>\n</li>\n<li>\n<p><strong>Can I extend the expiration date for all users in a customer installation?</strong></p>\n<ul>\n<li>No, you only extend the expiration date for the user who made the request. If they are an administrator, inform them to extend other users as necessary.</li>\n</ul>\n</li>\n<li>\n<p><strong>Who do I contact if I receive a customer request for an extension?</strong></p>\n<ul>\n<li>Contact the account manager as per SRT to confirm the extension request before proceeding.</li>\n</ul>\n</li>\n</ol>",
    "user_segment_ids": [
        360000084973
    ]
}