{
    "id": 21402486964882,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21402486964882.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21402486964882-PAYBACK-High-Usage-Announcement-Special-Handling",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20389541164690,
    "created_at": "2024-09-16T14:33:10Z",
    "updated_at": "2024-09-16T15:11:36Z",
    "name": "PAYBACK - High Usage Announcement Special Handling",
    "title": "PAYBACK - High Usage Announcement Special Handling",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-09-16T15:11:35Z",
    "user_segment_id": 360000084973,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [
        "Large-scale",
        "Preparation",
        "PAYBACK Panel",
        "Survey",
        "System Performance"
    ],
    "body": "<h1 id=\"h_01J7XM1DD5TGVKWF5NH5F54R8E\">Overview</h1>\n<p>The customer Payback has a yearly (or bi-yearly) activity where they send large numbers of emails for their surveys. For example:</p>\n<p>The survey is expected to involve 150,000 participants and is scheduled to run from 23.09.2024 to 31.10.2024.</p>\n<p>Payback will request for utilization charts for the invitation and reminder days, which can span for long periods of time (1 month), and they need that information on a <strong>daily basis</strong>. This article contains a runbook for quickly going through the task.</p>\n<p>Sample ticket/s:</p>\n<ul>\n<li>Legacy Tivian ticket: <a href=\"https://tivian.atlassian.net/browse/TIVI-35150\">https://tivian.atlassian.net/browse/TIVI-35150</a>\n</li>\n<li>ZD ticket: <a href=\"https://central-supportdesk.zendesk.com/agent/tickets/4470152\">https://central-supportdesk.zendesk.com/agent/tickets/4470152</a> </li>\n</ul>\n<h1 id=\"h_01J7XM1DD532M7DC3G8Y0PPH3Q\">Solution</h1>\n<ol>\n<li>Customers first need to provide us with the information for <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20304775281554-Handling-High-Usage-Announcements-from-Customers\">Handling High Usage Announcements from Customers</a>\n<ol>\n<li>They will most of the time raise a ticket with this information already, and in advance (maybe 2-3 weeks in advance)</li>\n</ol>\n</li>\n<li>Once that is done, we need to <strong>raise a SaaS CR</strong> to make sure that the Payback instances are properly scaled (example: <a href=\"https://trilogy-eng.atlassian.net/browse/DXI-103\">https://trilogy-eng.atlassian.net/browse/DXI-103</a>)</li>\n<li>Once confirmed:\n<ol>\n<li>If the due date of the survey is less than 1 week ahead, place the ticket on <strong>hold</strong> until the <strong>2nd day of the survey</strong>\n</li>\n<li>For this process to work, make sure that the ticket is of <strong>Urgent</strong> priority.</li>\n</ol>\n</li>\n<li>When the ticket comes off hold:\n<ol>\n<li>Navigate to the dedicated Payback Grafana dashboard: <a href=\"https://grafana.prod-de-03.customervoice360.com/d/cdrxcub8bo64gc/payback-meera?orgId=1\">https://grafana.prod-de-03.customervoice360.com/d/cdrxcub8bo64gc/payback-meera?orgId=1</a> </li>\n<li>Take screenshots of the graphs, preferably splitting them into:\n<ol>\n<li>\n<strong>Webserver/FPM pool (nginx, HPA NGINX, FPM Pool)</strong><br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21403640785682\" width=\"238\" height=\"195\">\n</li>\n<li>\n<strong>Database</strong><br><img src=\"https://discoverxi-supportdesk.zendesk.com/hc/article_attachments/21403653714194\" width=\"247\" height=\"193\">\n</li>\n<li>Send the customer the obtained screenshots, and <strong>place on hold for 24 hours</strong> for the process to repeat the next day</li>\n</ol>\n</li>\n</ol>\n</li>\n</ol>\n<h1 id=\"h_01J7XNGMQ1QK02EJZVDB8WMH1Y\">Graph Explanations</h1>\n<ul>\n<li>Of particular interest here are the two web server/FPM pool panels <strong>HPA NGINX</strong> and <strong>HPA FPMPOOL. </strong>As can be seen in these two panels, the current number (yellow line), which corresponds to the minimum number so far (would be a dashed green line, but is covered by the yellow one) of 12 pods each, is sufficient to process the corresponding requests at all times.</li>\n<li>If there were more requests or possible peaks, there would still be a lot of room for improvement, as theoretically up to 40 pods are available.</li>\n<li>This is directly related to the performance of the database server, which, however, if you look at the <strong>CPU Utilization</strong> panel, even at times when the number of requests (Panel: \"Number of parallel requests over all pods\") and thus also the number of database connections (Panel: \"Database Connections\") or the associated network traffic (Panel: \"Network Receive/Transmit Throughput Average\"), could be processed at all times.\n<ul>\n<li>This is ultimately reflected in the fast access times: <strong>AVG Request Time</strong>.</li>\n</ul>\n</li>\n<li>The <strong>Total fpmpool Processes (linear)</strong> and <strong>fpmpool connection rate per Pod</strong> panels provide information on how many active processes were processed simultaneously by the Pod and the speed at which processes were established, but here too there is still room for improvement until the theoretical limit is reached.</li>\n<li>The <strong>Database Connection Peaks</strong> and <strong>CPU Utilization Peaks</strong> panels are simply a different representation of <strong>Database Connections</strong> and <strong>CPU Utilization</strong> and are intended to make it easier to identify peaks in the form of plateaus.</li>\n<li>The <strong>Freeable Memory</strong> panel is more for purely statistical purposes and looks very busy, but this is due to the fact that RAM is always fully utilized if required, as communication between the CPU and RAM, for example, is much faster than between the CPU and hard disk (depending on the application and use case, data may only be stored in RAM).</li>\n</ul>\n<p> </p>\n<h1 id=\"h_01J7XM1DD598DAABPMXSAVQ7GB\">Process Deviations</h1>\n<p>The customer could also request a couple of other things, besides the daily monitoring.</p>\n<h3 id=\"h_01J7XN9PPN1J87ZS05GNXA1C0Y\">Checking that their survey is in good standing before the go-live date</h3>\n<p>This task is not in the usual support scope, but rather falls into PS scope; the scope is still <strong>TBD at the time of writing</strong></p>\n<h3 id=\"h_01J7XNA4PAZCQ27EPR0K48C0AB\">Request explanations for the dashboards</h3>\n<p>For example, the customer could ask questions of this type:</p>\n<p><em>Some peaks are noticeable. e.g. </em></p>\n<ul>\n<li><em>Database Connection around 11:10 a.m. on July 15th.</em></li>\n<li><em>Network Receive around 2:40 p.m. on July 15th.</em></li>\n<li><em>Network Receive some peaks on July 16th and July 17th.</em></li>\n</ul>\n<p><em>How should these outliers be interpreted?</em></p>\n<p><strong>While there is no clear-cut answer to these, as it will depend on a lot of factors, a great explanations from the Legacy team can be found below:</strong></p>\n<p><em>Please note that these statistics cover the work in the admin area as well as the survey area and panel website. A separation is not technically possible because everything accesses the same resources. This means that actions in the admin area that may cause a lot of connections or traffic (imports/exports) also appear in the charts shown.</em></p>\n<p><em>Such actions can cause such peaks. However, you can also see from the CPU utilization that these peaks had no effect on the DB host or the FPMPOOL pods, i.e. where the actual work is done (e.g. data that EFS reads out and processes or data that is written as a result of processing).</em></p>\n<p><em>Basically, you cannot say across the board that there is a direct connection between the number of connections or traffic and CPU utilization on the DB server or FPMPOOL side. A connection can contain a very simple or a very complex database query, which then requires very little or a lot of CPU, or just a single query or a million queries where the bulk of the CPU is used. Here there were many connections, but they required few resources.</em></p>\n<p><em>When it comes to traffic, an export or import can of course differ greatly compared to the few bytes that are transferred on many survey pages, especially when you have already left the home page and the majority is already in the cache.</em></p>\n<p><em>Tracing when which action caused which peak can only be found out by very time-consuming analysis of the log files. Since there were never any performance bottlenecks of any kind, I would refrain from carrying out such an analysis. Everything is within a normal range. Broken down from the participant's point of view, the only problem is if the pods permanently reach the maximum of 40 or the CPU is permanently at 100%.</em></p>\n<h1 id=\"h_01J7XNEHYQNB7YT0FYWPTBKYGS\">Troubleshooting</h1>\n<p>It could also happen that things do not go as planned, and the customer reports issues with their performance OR SaaS receives an alert related to the good standing of the instances.</p>\n<p>With the current accesses, you are only able to access Grafana and take a peek at the dashboards, afterwich you need to <a href=\"https://trilogy-eng.atlassian.net/jira/software/c/projects/DXI/issues\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>raise a SaaS incident</strong></a> for investigating the issue.</p>",
    "user_segment_ids": [
        360000084973
    ]
}