{
    "id": 21890854511506,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/21890854511506.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/21890854511506-Requesting-Vanity-URL-s-for-DXi-Installations",
    "author_id": 369584192734,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234774909202,
    "created_at": "2024-10-10T06:38:50Z",
    "updated_at": "2024-10-10T07:02:21Z",
    "name": "Requesting Vanity URL's for DXi Installations",
    "title": "Requesting Vanity URL's for DXi Installations",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-10-10T07:02:18Z",
    "user_segment_id": null,
    "permission_group_id": 1075294,
    "content_tag_ids": [],
    "label_names": [
        "Discover XI",
        "Vanity Name",
        "DNS Setup",
        "SSL Certificate",
        "Tivian"
    ],
    "body": "<h1 id=\"h_01J9TJEC9452ZKHS3TN44KCQ3F\">Overview</h1>\n<p>DXi instances will be provisioned by default with technical URL's like <a href=\"https://ab1234.customervoice.com\">https://ab1234.customervoice.com</a>, and you may want your own URL branding in place. When this happens, you can either provide a domain you already have purchased or ask Tivian to purchase and provision a vanity domain for you.</p>\n<p>If you are in the above situation, then this article is for you!</p>\n<h1 id=\"h_01J9TJEC95GDMQ5M5GZZZNHWKF\">Solution</h1>\n<p>If you haven't yet purchased a domain, and you want to have Tivian provision and manage the new domain (vanity URL) for you, you will need to request this via a support ticket.</p>\n<p>In order to have a new vanity URL provisioned for you, we will need the below information from your side, as it is required when registering the domain with our provider:</p>\n<ul>\n<li>The domain you wish to purchase</li>\n<li>First Name</li>\n<li>Last Name</li>\n<li>Company Name</li>\n<li>Address (Street, ZIP Code, City, Country)</li>\n<li>Phone</li>\n<li>Email Address</li>\n</ul>\n<p>Once this information is supplied to the Support team, we will be able to proceed with the domain purchase and provisioning for you (SSL certificate included).</p>\n<p>Please note that the DNS propagation may take up to 48 hours once the domain is provisioned.</p>\n<p>&lt;supportagent&gt;</p>\n<p>You can check <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20304696897682\" target=\"_blank\" rel=\"noopener noreferrer\">Domain, Alias, CNAME, SSL in EFS</a> for the available options when it comes to vanity URL's and DNS in Tivian DXi.</p>\n<div class=\"alert alert-danger\" role=\"alert\">\n<p><em><strong>NOTE:</strong> if customer is IPSOS, purchasing of vanity URL's is pre-approved. If any other customer is requesting this, we need to seek approval from Sales: <a href=\"https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/20304714254610\" target=\"_blank\" rel=\"noopener noreferrer\">DXI Routing Table &amp; Priority Handling</a>.</em></p>\n</div>\n<p>Below is the high-level overview of how to proceed when the customer requests that we purchase and manage for them a vanity URL:</p>\n<ol>\n<li>Log a SaaS CR with the information provided by the customer; sample template for <a href=\"https://trilogy-eng.atlassian.net/browse/DXI-390\" target=\"_blank\" rel=\"noopener noreferrer\">CR</a>:<br>\n<p><em>We need a new vanity URL (www.vanityurl.com) for the Discover XI installation (https://abcd.customervoice360.com).</em></p>\n<p><em>Historically, Tivian handled the URL purchase and SSL certificate configuration.</em></p>\n<p><em>Actions Required:</em><br><em>- Confirm Tivian's involvement in purchasing the URL and handling SSL certificate configuration.</em><br><em>- DNS setup (CNAME, ALIAS, or relevant records) based on the DNS provider's capabilities.</em><br><em>- Verification of successful DNS propagation and SSL certificate installation.</em></p>\n</li>\n<li>Once the CR is completed, inform the customer accordingly</li>\n</ol>\n<p>&lt;/supportagent&gt;</p>\n<h1 id=\"h_01J9TJEC9545D91NAV46RJCCQ1\">Summary</h1>\n<p>Applying for a new vanity name for a Discover XI installation requires logging a ticket with the support team with the required details, and once completed, waiting for DNS changes to propagate.</p>\n<h2 id=\"h_01J9TJEC95DJMR6M3NEEHAR951\">FAQ</h2>\n<ol>\n<li>\n<strong>Who handles the URL purchase and SSL certificate configuration?</strong><br>Tivian handles the URL purchase and SSL certificate configuration. However, you can also bring in your own domains.</li>\n<li>\n<strong>Why is my information needed if the support team is handling the domain purchase and DNS setup?</strong><br>In some cases, the support team may need your information for verification purposes during domain purchase.</li>\n<li>\n<strong>How long does it take for DNS changes to propagate fully?</strong><br>It can take up to 48 hours for DNS changes to propagate fully.</li>\n</ol>",
    "user_segment_ids": []
}