{
    "id": 23121290998034,
    "url": "https://discoverxi-supportdesk.zendesk.com/api/v2/help_center/en-us/articles/23121290998034.json",
    "html_url": "https://discoverxi-supportdesk.zendesk.com/hc/en-us/articles/23121290998034-Hurricane-SES-Migration-FAQ",
    "author_id": 19166001344402,
    "comments_disabled": false,
    "draft": false,
    "promoted": false,
    "position": 0,
    "vote_sum": 0,
    "vote_count": 0,
    "section_id": 20234751255186,
    "created_at": "2024-12-06T17:32:27Z",
    "updated_at": "2024-12-18T17:27:38Z",
    "name": "Hurricane - SES Migration FAQ",
    "title": "Hurricane - SES Migration FAQ",
    "source_locale": "en-us",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2024-12-18T17:27:38Z",
    "user_segment_id": 360000084973,
    "permission_group_id": 1075274,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p><strong>General Migration Information</strong></p>\n<ul>\n<li>\n<p><strong>What is the Hurricane to SES migration?</strong><br>We are migrating our email-sending service from Hurricane to Amazon SES to improve email deliverability and reliability.</p>\n</li>\n<li>\n<p><strong>Do I need to take any action?</strong><br>If you received a domain verification communication, update your DNS records. Otherwise, the transition will be seamless for you.</p>\n</li>\n<li>\n<strong>Would we be impacted if we use our own mail relay server?</strong><br>They should have received an communication. New Server hostname should be changed to outboundemail1.tivian.com</li>\n</ul>\n<hr>\n<p><strong>Domain Verification</strong></p>\n<ul>\n<li>\n<p><strong>Why am I being asked to verify domains I don't use?</strong><br>All domains in your instance are included for future-proofing. Ignore unused domains but verify those you want to send emails from.</p>\n</li>\n<li>\n<p><strong>How do I know which domains I need to verify?</strong><br>Check the list of domains in our communication. It covers all the domains. And according to our records, <a href=\"#h_01JEEGR1AW8GF7HETPYKX6TV0P\">here is the list of the domains that you have used in the past year.</a></p>\n</li>\n<li>\n<p><strong>I received communications for different cohorts. Why?</strong><br>If you have multiple instances, please verify domains for each instance as instructed.</p>\n</li>\n<li>\n<strong>When can the old DKIM entry be deleted?<br></strong>We will notify you before older DKIM entries can be deleted. <br>Deletion of older DKIM entries before the new DNS entries have been verified by us, will lead to loss of email functionality.</li>\n</ul>\n<hr>\n<p><strong>Time Constraints and Extensions</strong></p>\n<ul>\n<li>\n<p><strong>Can I get an extension for verifying my domains?</strong><br>Extensions are possible until December 16 at the latest. Complete verification as soon as possible to avoid email interruptions.</p>\n</li>\n<li>\n<p><strong>What happens if I don't verify my domains in time?</strong><br>You won’t be able to send emails from unverified domains, and email functionalities like surveys may fail.</p>\n</li>\n</ul>\n<hr>\n<p><strong>Domain Control and Responsibility</strong></p>\n<ul>\n<li>\n<p><strong>You control our domain. Why do I need to make changes?</strong><br>If we control your domain, we’ll make the changes. The request applies only to domains we don’t control. If you believe there is an error, please help us with the domains that you believe are controlled by us.</p>\n</li>\n<li>\n<p><strong>Who is responsible for making the DNS changes?</strong><br>You or your IT team must make changes for domains not under our control. We’ve provided the DKIM and CNAME records in the communication.</p>\n</li>\n<li>\n<strong>Where can I find all the domain names which will be impacted with this migration? <br></strong>List of domains based on the folder which was sent in the comms. Each folder has a set of zone files. The names of the zone files correspond to the domain names.<strong><br></strong>\n</li>\n</ul>\n<hr>\n<p><strong>Post-Migration</strong></p>\n<ul>\n<li>\n<p><strong>What should I do if my emails stop working after the migration?</strong><br>Contact us immediately and ensure all required domains are verified.</p>\n</li>\n<li>\n<p><strong>Will there be any changes to how I use the email functionality?</strong><br>The migration should be seamless, with no changes to email functionality. Contact us if you notice any issues.</p>\n</li>\n<li>\n<p><strong>What will be the process for the future?</strong><br>Please submit a ticket with us. We will supply you with the necessary zone file, and after you update the DNS entry, please be aware that it may take up to 72 hours for the changes to fully propagate on the AWS side. <br>For such requests, the process would be:<span style=\"color: #2f3941; font-family: system-ui, -apple-system, ' system-ui' , ' Segoe UI' , Roboto, Oxygen-Sans, Ubuntu, Cantarell, ' Helvetica Neue' , Arial, sans-serif; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; background-color: #fff7ed; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; display: inline !important; float: none;\"><br></span></p>\n<ul>\n<li>CS -&gt; SaaS:<br>\n<ul>\n<li>File a ticket for SaaS to add the domain into the system under SES</li>\n<li>SaaS will generate the new zone file and provide this Zone file to CS</li>\n</ul>\n</li>\n<li> CS -&gt; Customer<br>\n<ul>\n<li>CS sends the zone file to the customer and waits for confirmation from the customer that the zone file has been updated</li>\n<li>CS verifies that the domain entries have been updated by checking the customer's public DNS entries</li>\n<li>CS verifies that the domain is now verified by AWS SES, or puts the ticket on hold until AWS verifies the domain (which may take up to 72 hours)</li>\n<li>CS then notifies the customer that the domain is ready for use.</li>\n</ul>\n</li>\n</ul>\n<p><span style=\"color: #2f3941; font-family: system-ui, -apple-system, ' system-ui' , ' Segoe UI' , Roboto, Oxygen-Sans, Ubuntu, Cantarell, ' Helvetica Neue' , Arial, sans-serif; font-size: 14px; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; background-color: #fff7ed; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial; display: inline !important; float: none;\"> </span></p>\n</li>\n</ul>\n<hr>\n<h2 id=\"h_01JEEGR1AW8GF7HETPYKX6TV0P\">\n<br>How to find domains used by a customer in the last 12 months?<br><br>\n</h2>\n<p>In \"DXI - Hurricane sender domain stats by customer\", The pivot table on the <strong><em>pvt_CustomDomains</em></strong> tab can be filtered by a customer to quickly see used in last 12 month domains.<br><br><a href=\"https://docs.google.com/spreadsheets/d/1CQmDPjwnJPvtZDlpL9joDMdpn_gumZaLr5QAwCxKIvw/edit?gid=1867633889#gid=1867633889\">DXI Migration Activity Sheet</a> : You can find all the domains, related customer and their ZONE file details here.</p>\n<p> </p>\n<h2 id=\"h_01JEEKE76EB7V597KKM9VQ1H4J\">New Questions</h2>\n<p>If any questions are not answered in the FAQs, please raise an SC with <strong>Raghul Suthagar, Noumaan Shah, Leonardo Lima, Anton VanDerBijl, Muhammad Usman, Chris Morino,</strong> and <strong>Aditi Garg</strong>. <br><br>After you receive the answers to the questions on the ticket, please make sure the KB article is updated accordingly. This will streamline the handling of similar tickets in the future.<br><br><br><br> </p>",
    "user_segment_ids": [
        360000084973
    ]
}